{
  "cropData": {
    "rice": {
      "definition": "एक घास जो एक अनाज अन्न के रूप में खेती होती है।",
      "advantages": "विश्व की आधिकांश जनसंख्या के लिए मुख्य भोजन है। कार्बोहाइड्रेट, प्रोटीन और फाइबर का अच्छा स्रोत है। उगाने में तुलनात्मक रूप से सस्ती होती है।",
      "disadvantages": "चावल एक पानी की आवश्यकता रखने वाली फसल है। इसे कीट और रोगों के प्रति भी संवेदनशील किया जा सकता है।",
      "method to grow": "चावल भीगे हुए खेतों में उगाया जाता है। बीज पानी में बोये जाते हैं और खेतों को उम्मीद के अनुसार भरा जाता है। चावल के पौधे पानी में उगते हैं और जब वे पक जाते हैं, तब उन्हें कटा जाता है।",
      "how to grow": "चावल कई प्रकार की जलवायु में उगाया जा सकता है, लेकिन यह गर्म और आर्द्र जलवायु में सबसे अच्छे रहता है। मिट्टी अच्छी ड्रेन होनी चाहिए और पौष्टिक होनी चाहिए। चावल एक तुलनात्मक रूप से आसान फसल है, लेकिन इसे अधिक मात्रा में पानी की आवश्यकता होती है।",
      "cost of growth": "चावल की उगाई की लागत स्थान और खेती के तरीके पर आधारित होती है। हालांकि, यह आमतौर पर सस्ती फसल होती है।",
      "difficulty": "चावल एक आसान फसल है, लेकिन इसे अधिक मात्रा में पानी की आवश्यकता होती है। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "चावल एक बहुमुखी फसल है जिसे विभिन्न व्यंजनों में उपयोग किया जा सकता है। यह कार्बोहाइड्रेट, प्रोटीन और फाइबर का अच्छा स्रोत भी है।",
      "source": "https://www.britannica.com/plant/rice",
      "equipment": "कुदाल, रेक, पानी डालने का डिब्बा, बीज, उर्वरक",
      "time duration": "6-8 महीने",
      "img": "./picture/paddy.jpg",
      "name": "चावल"
    },
    "wheat": {
      "definition": "एक घास जो एक अनाज अन्न के रूप में खेती होती है।",
      "advantages": "विश्व की तिहाई जनसंख्या के लिए मुख्य भोजन है। यह कार्बोहाइड्रेट, प्रोटीन और फाइबर का अच्छा स्रोत है। गेहूँ उगाने में तुलनात्मक रूप से सस्ती है।",
      "disadvantages": "गेहूँ एक पानी की आवश्यकता रखने वाली फसल है। इसे कीट और रोगों के प्रति भी संवेदनशील किया जा सकता है।",
      "method to grow": "गेहूँ सूखे खेतों में उगाया जाता है। बीज मिट्टी में बोये जाते हैं और खेतों को आवश्यकता के हिसाब से सिंचाई की जाती है। गेहूँ के पौधे मिट्टी में उगते हैं और जब वे पक जाते हैं, तब उन्हें कटा जाता है।",
      "how to grow": "गेहूँ कई प्रकार की जलवायु में उगाया जा सकता है, लेकिन यह ठंडी, मितव्यंतर जलवायु में सबसे अच्छे रहता है। मिट्टी अच्छी ड्रेन होनी चाहिए और पौष्टिक होनी चाहिए। गेहूँ एक तुलनात्मक रूप से आसान फसल है, लेकिन यह अधिक मात्रा में पानी की आवश्यकता होती है।",
      "cost of growth": "गेहूँ की उगाई की लागत स्थान और खेती के तरीके पर आधारित होती है। हालांकि, यह आमतौर पर सस्ती फसल होती है।",
      "difficulty": "गेहूँ एक आसान फसल है, लेकिन यह अधिक मात्रा में पानी की आवश्यकता होती है। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "गेहूँ एक बहुमुखी फसल है जिसे विभिन्न व्यंजनों में उपयोग किया जा सकता है। यह कार्बोहाइड्रेट, प्रोटीन और फाइबर का अच्छा स्रोत भी है।",
      "source": "https://www.britannica.com/plant/wheat",
      "equipment": "कुदाल, रेक, पानी डालने का डिब्बा, बीज, उर्वरक",
      "time duration": "7-8 महीने",
      "img": "./picture/wheat.jpg",
      "name": "गेहूँ"
    },
    "mung bean": {
      "definition": "एक पौधे द्वारा उगाए जाने वाले खाद्य बीज।",
      "advantages": "मूंग दाल प्रोटीन, फाइबर और विटामिन का एक अच्छा स्रोत है। इसे उगाने की लागत भी संयंत्रों में कम होती है।",
      "disadvantages": "मूंग दाल की फसल कीटों और रोगों के प्रति संवेदनशील हो सकती है।",
      "method to grow": "मूंग दाल को अच्छी ड्रेनेज वाली मिट्टी में उगाया जाता है। बीजों को मिट्टी में बोया जाता है और खेतों को आवश्यकतानुसार सिंचित किया जाता है। मूंग दाल के पौधे मिट्टी में बढ़ते हैं और पकने पर उगाई जाती हैं।",
      "how to grow": "मूंग दाल कई जलवायु में उगाई जा सकती है, लेकिन यह गर्म और आर्द्र जलवायु में सर्वोत्तम फलती है। मिट्टी अच्छी ड्रेनेज वाली और उर्वरा होनी चाहिए। मूंग दाल को उगाने के लिए संयंत्रों को खूबसूरत पानी की आवश्यकता होती है।",
      "cost of growth": "मूंग दाल की खेती की लागत स्थान और खेती केतरीके पर निर्भर करती है। हालांकि, यह आमतौर पर उगाने में एक सस्ती फसल होती है।",
      "difficulty": "मूंग दाल को उगाना संयंत्रों के लिए एक सुलभ फसल है, लेकिन इसके लिए बहुत सारा पानी चाहिए। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "मूंग दाल एक बहुमुखी फसल है जो विभिन्न व्यंजनों में उपयोग की जा सकती है। यह प्रोटीन, फाइबर और विटामिन का एक अच्छा स्रोत भी है।",
      "source": "https://www.britannica.com/plant/mung-bean",
      "equipment": "खुरपी, हरीभरी, पानी देने की कन, बीज, उर्वरक",
      "time duration": "60-70 दिन",
      "img": "./picture/mong",
      "name": "मूंग दाल"
    },
    "tea": {
      "definition": "कैमेलिया सिनेंसिस पौधे की पत्तियों से तैयार की जाने वाली एक सुगंधित पेय।",
      "advantages": "चाय एंटीऑक्सीडेंट का एक अच्छा स्रोत है और कई स्वास्थ्य लाभों का होने का प्रमाणित हो चुका है। इसे उगाने की लागत भी संयंत्रों में कम होती है।",
      "disadvantages": "चाय की फसल कीटों और रोगों के प्रति संवेदनशील हो सकती है।",
      "method to grow": "चाय को अच्छीड्रेनेज वाली मिट्टी में उगाया जाता है। पौधों को कटिंग्स से प्रजनन करके धरती में लगाया जाता है। चाय के पौधे नियमित रूप से काटे जाते हैं और पत्तियाँ जब वे नवीनतम और नरम होती हैं, तब काटी जाती हैं।",
      "how to grow": "चाय कई जलवायु में उगाई जा सकती है, लेकिन यह गर्म और आर्द्र जलवायु में सर्वोत्तम फलती है। मिट्टी अच्छी ड्रेनेज वाली और उर्वरा होनी चाहिए। चाय को उगाने के लिए संयंत्रों को खूबसूरत पानी की आवश्यकता होती है।",
      "cost of growth": "चाय की खेती की लागत स्थान और खेती के तरीके पर निर्भर करती है। हालांकि, यह आमतौर पर उगाने में एक सस्ती फसल होती है।",
      "difficulty": "चाय को उगाना संयंत्रों के लिए एक सुलभ फसल है, लेकिन इसके लिए बहुत सारा पानी चाहिए। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "चाय एक बहुमुखी फसल है जो विभिन्न व्यंजनों में उपयोग की जा सकती है। यह एंटीऑक्सीडेंट का भी एक अच्छास्रोत है और कई स्वास्थ्य लाभों का होने का प्रमाणित हो चुका है।",
      "source": "https://www.britannica.com/plant/tea-plant",
      "equipment": "खुरपी, हरीभरी, पानी देने की कन, चाय के पौधे, उर्वरक",
      "time duration": "3-4 साल",
      "img": "./picture/tea",
      "name": "चाय"
    },
    "millet": {
      "definition": "अपने खाद्य बीज के लिए उत्पादित एक घास की फसल।",
      "advantages": "मिलेट अपेक्षाकृत सस्ती खेती के साथ-साथ कार्बोहाइड्रेट, प्रोटीन और फाइबर का अच्छा स्रोत है।",
      "disadvantages": "मिलेट कीटों और रोगों के प्रति संवेदनशील हो सकता है।",
      "method to grow": "मिलेट अच्छी ड्रेनेज वाली मिट्टी में उगाया जाता है। बीजों को मिट्टी में रोपण किया जाता है और खेतों को आवश्यकतानुसार सिंचाई की जाती है। मिलेट के पौधे मिट्टी में उग जाते हैं और जब वे पक जाते हैं, तब उन्हें कट लिया जाता है।",
      "how to grow": "मिलेट विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह गर्म और सूखी जलवायु में सर्वोत्तम फलती है। मिट्टी अच्छी ड्रेनेज वाली और पौष्टिक होनी चाहिए। मिलेट एक सुलभ फसल है, लेकिन इसे बहुत सारे सूर्य की रोशनी की आवश्यकता होती है।",
      "cost of growth": "मिलेट की खेती की लागत स्थान और खेती के तरीके पर निर्भर करती है। हालांकि, यह आमतौर पर उगाने में एक सस्ती फसल होती है।",
      "difficulty": "मिलेट उगाने में एक अपेक्षाकृत सरल फसल है, लेकिन इसे बहुत सारे सूर्य की रोशनी की आवश्यकता होती है। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "मिलेट एक बहुमुखी फसल है जिसे विभिन्न पकवानों में उपयोग किया जा सकता है। यह कार्बोहाइड्रेट, प्रोटीन और फाइबर का एक अच्छा स्रोत भी है।",
      "source": "https://www.britannica.com/plant/millet",
      "equipment": "कुदाल, झरना, पानी देने की कन, बीज, उर्वरक",
      "time duration": "60-70 दिन",
      "img": "./picture/millet.jpg",
      "name": "मिलेट"
    },
    "maize": {
      "definition": "एक अनाज अन्न है जो दुनिया में सबसे व्यापक रूप से उगाया जाने वाला अनाज है।",
      "advantages": "मक्का कार्बोहाइड्रेट, प्रोटीन और फाइबर का अच्छा स्रोत है। इसे उगाना अपेक्षाकृत सस्ती खेती है।",
      "disadvantages": "मक्का कीटों और रोगों के प्रति संवेदनशील हो सकता है।",
      "method to grow": "मक्का अच्छी ड्रेनेज वाली मिट्टी में उगाया जाता है। बीजों को मिट्टी में रोपण किया जाता है और खेतों कोआवश्यकतानुसार स िंचाई की जाती है। मक्का के पौधे मिट्टी में उग जाते हैं और जब वे पक जाते हैं, तब उन्हें कट लिया जाता है।",
      "how to grow": "मक्का विभिन्न जलवायु में उगाई जा सकती है, लेकिन यह गर्म और आर्द्र जलवायु में सबसे अच्छा फलता है। मिट्टी अच्छी ड्रेनेज वाली और पौष्टिक होनी चाहिए। मक्का एक सुलभ फसल है, लेकिन यह बहुत सारा पानी की आवश्यकता होता है।",
      "cost of growth": "मक्का की खेती की लागत स्थान और खेती के तरीके पर निर्भर करती है। हालांकि, यह आमतौर पर उगाने में एक सस्ती फसल होती है।",
      "difficulty": "मक्का उगाने में एक अपेक्षाकृत सरल फसल है, लेकिन यह बहुत सारा पानी की आवश्यकता होता है। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "मक्का एक बहुमुखी फसल है जिसे विभिन्न पकवानों में उपयोग किया जा सकता है। यह कार्बोहाइड्रेट, प्रोटीन और फाइबर का एक अच्छा स्रोत भी है।",
      "source": "https://www.britannica.com/plant/maize",
      "equipment": "कुदाल, झरना, पानी देने कीकन, बीज, उर्वरक",
      "time duration": "90-120 दिन",
      "img": "./picture/maize.jpg",
      "name": "मक्का"
    },
    "lentil": {
      "definition": "एक दाली का पौधा जिसके खाद्य बीज के लिए उगाया जाता है।",
      "advantages": "मसूर दाल प्रोटीन, फाइबर और लोहे का एक अच्छा स्रोत है। इसकी उगाई कम खर्चीली भी होती है।",
      "disadvantages": "मसूर दाल की कीट और रोगों के प्रति संवेदनशील हो सकती है।",
      "method to grow": "मसूर दाल को अच्छी निकासी वाली मिट्टी में उगाया जाता है। बीज मिट्टी में रोपा जाता है और फिर खेतों को आवश्यकतानुसार सिंचाई की जाती है। मसूर के पौधे मिट्टी में बढ़ते हैं और जब वे पक जाते हैं तब उन्हें काट लिया जाता है।",
      "how to grow": "मसूर दाल को विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह ठंडी, आर्द्र जलवायु में बेहतरीन फलती है। मिट्टी अच्छी निकासी और पोषक होनी चाहिए। मसूर एक तुलनात्मकता से आसान फसल है, लेकिन इसे बहुत सारा पानी चाहिए।",
      "cost of growth": "मसूर दाल की उगाई की लागत स्थान और खेती की विधि पर निर्भर करती है। हालांकि, यह आमतौर पर एक सस्ती फसल है।",
      "difficulty": "मसूर एक तुलनात्मकता से आसान फसल है, लेकिन इसे बहुत सारा पानी चाहिए। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "मसूर एक विविधतापूर्ण फसल है जो विभिन्न व्यंजनों में उपयोग किया जा सकता है। यह प्रोटीन, फाइबर और लोहे का एक अच्छा स्रोत भी है।",
      "source": "https://www.britannica.com/plant/lentil",
      "equipment": "खुरपी, कुदाल, सिंचाई की मटकी, बीज, उर्वरक",
      "time duration": "60-70 दिन",
      "img": "./picture/litne.jpg",
      "name": "lentil"
    },
    "jute": {
      "definition": "फाइबर के लिए उगाई जाने वाली पौधा।",
      "advantages": "जूट एक मजबूत और टिकाऊ फाइबर है। इसकी उगाई कम खर्चीली भी होती है।",
      "disadvantages": "जूट जल की बहुत अधिक आवश्यकता होती है। यह कीटों और रोगों के प्रति संवेदनशील भी हो सकती है।",
      "method to grow": "जूट को अच्छी निकासी वाली मिट्टी में उगाया जाता है। बीज मिट्टी में रोपा जाता है और फिर खेतों को आवश्यकतानुसार सिंचाई की जाती है। जूट के पौधे मिट्टी में बढ़ते हैं और जब वे पक जाते हैं तब उन्हें काट लिया जाता है।",
      "how to grow": "जूट को विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह गर्म, आर्द्र जलवायु में बेहतरीन फलती है। मिट्टी अच्छी निकासी और पोषक होनी चाहिए। जूट एक तुलनात्मकता से आसान फसल है, लेकिन इसे बहुत सारा पानी चाहिए।",
      "cost of growth": "जूट की उगाई की लागत स्थान और खेती की विधि पर निर्भर करती है। हालांकि, यह आमतौर पर एक सस्ती फसल है।",
      "difficulty": "जूट एक तुलनात्मकता से आसान फसल है, लेकिन इसे बहुत सारा पानी चाहिए। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "जूट एक विविधतापूर्ण फसल है जिसका उपयोग विभिन्न उत्पादों में किया जा सकता है। यह फाइबर का एक अच्छा स्रोत भी है।",
      "source": "https://www.britannica.com/plant/jute",
      "equipment": "खुरपी, कुदाल, सिंचाई की मटकी, बीज, उर्वरक",
      "time duration": "120-150 दिन",
      "img": "./picture/jute.jpg",
      "name": "jute"
    },
    "coffee": {
      "definition": "एक छोटा पेड़ जिसे बीनों के लिए उगाया जाता है, जो भूने जाते हैं और कॉफ़ी उत्पादन के लिए पीसे जाते हैं।",
      "advantages": "कॉफ़ी एक उत्तेजक है जो चेतावनी और मनोबल को बढ़ा सकता है। इसकी उगाई भी सस्ती होती है।",
      "disadvantages": "कॉफ़ी आदी हो सकती है। कुछ लोगों में यह चिंता और अनिद्रा का कारण भी बन सकती है।",
      "method to grow": "कॉफ़ी अच्छी निकासी वाली मिट्टी में उगायी जाती है। पौधे बीजों से प्रसारित किए जाते हैं और फिर मिट्टी में लगाए जाते हैं। कॉफ़ी के पौधे मिट्टी में बढ़ते हैं और जब बीन पक जाती है तब इन्हें काट लिया जाता है।",
      "how to grow": "कॉफ़ी को विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह गर्म, आर्द्र जलवायु में बेहतरीन फलती है। मिट्टी अच्छी निकासी और पोषक होनी चाहिए। कॉफ़ी एक तुलनात्मकता से आसान फसल है, लेकिन इसे बहुत सारे सूर्य की किरणों की आवश्यकता होती है।",
      "cost of growth": "कॉफ़ी की उगाई की लागत स्थान और खेती की विधि पर निर्भर करती है। हालांकि, यह आमतौर पर एक सस्ती फसल है।",
      "difficulty": "कॉफ़ी एक तुलनात्मकता से आसान फसल है, लेकिन इसे बहुत सारे सूर्य की किरणों की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "कॉफ़ी एक विविधतापूर्ण फसल है जिसका उपयोग विभिन्न उत्पादों में किया जा सकता है। यह एंटीऑक्सिडेंट का भी एक अच्छा स्रोत है।",
      "source": "https://www.britannica.com/plant/coffee",
      "equipment": "खुरपी, कुदाल, सिंचाई की मटकी, बीज, उर्वरक",
      "time duration": "3-4 साल",
      "img": "./picture/coffe.jpg",
      "name": "coffee"
    },
    "cotton": {
      "definition": "एक मुलायम, फफ्फूसी बुनियादी रेशा जो कपास पौधे के बीजों के चारों ओर सुरक्षात्मक थैले में बढ़ता है।",
      "advantages": "कपास एक मुलायम और सुखद फैब्रिक है। इसकी उत्पादन में भी सस्ती लागत होती है।",
      "disadvantages": "कपास एक पानी-आवश्यक फसल हो सकती है। इसे कीट और रोगों के प्रति भी संवेदनशीलता हो सकती है।",
      "method to grow": "कपास अच्छी निकासी वाली मिट्टी में उगायी जाती है। पौधे बीजों से प्रसारित किए जाते हैं और फिर मिट्टी में लगाए जाते हैं। कपास के पौधे मिट्टी में बढ़ते हैं और जब खुले हुए बोल्स होते हैं तब इन्हें कटा जाता है।",
      "how to grow": "कपास को विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह गर्म, आर्द्र जलवायु में बेहतरीन फलती है। मिट्टी अच्छी निकासी और पोषक होनी चाहिए। कपास एक तुलनात्मकता से आसान फसल है, लेकिन इसे बहुत सारा पानी की आवश्यकता होती है।",
      "cost of growth": "कपास की उगाई की लागत स्थान और खेती की विधि पर निर्भर करती है। हालांकि, यह आमतौर पर एक सस्ती फसल है।",
      "difficulty": "कपास एक तुलनात्मकता से आसान फसल है, लेकिन इसे बहुत सारा पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "कपास एक विविधतापूर्ण फसल है जिसका उपयोग विभिन्न उत्पादों में किया जा सकता है। यह एक अच्छा फाइबर का स्रोत भी है।",
      "source": "https://www.britannica.com/plant/cotton",
      "equipment": "खुरपी, कुदाल, सिंचाई की मटकी, बीज, उर्वरक",
      "time duration": "4-5 महीने",
      "img": "./picture/cotton.jpg",
      "name": "cotton"
    },
    "groundnut": {
      "definition": "खाने के बीज के लिए उगायी जाने वाली एक दाली फली।",
      "advantages": "मूंगफली प्रोटीन और वसा का अच्छा स्रोत है। इसे उगाना भी निर्मूल और सस्ता होता है।",
      "disadvantages": "मूंगफली कीटों और रोगों के प्रति संक्रमण के प्रति संवेदनशील हो सकती है।",
      "method to grow": "मूंगफली अच्छी निकासी वाली मिट्टी में उगाई जाती है। बीज मिट्टी में बोए जाते हैं और खेतों को आवश्यकतानुसार सिंचित किया जाता है। मूंगफली के पौधे मिट्टी में उगते हैं और जब मजबूत और पके हो जाते हैं तब इन्हें कटा जाता है।",
      "how to grow": "मूंगफली को विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह गर्म, आर्द्र जलवायु में बेहतरीन फलती है। मिट्टी अच्छी निकासी और पोषक होनी चाहिए। मूंगफली एक तुलनात्मकता से आसान फसल है, लेकिन इसे बहुत सारा पानी की आवश्यकता होती है।",
      "cost of growth": "मूंगफली की उगाई की लागत स्थान और खेती की विधि पर निर्भर करती है। हालांकि, यह आमतौर पर एक सस्ती फसल होती है।",
      "difficulty": "मूंगफली एक तुलनात्मकता से आसान फसल है, लेकिन इसे बहुत सारा पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "मूंगफली एक विविधतापूर्ण फसल है जिसे विभिन्न व्यंजनों में उपयोग किया जा सकता है। यह प्रोटीन और वसा का एक अच्छा स्रोत भी है।",
      "source": "https://www.britannica.com/plant/groundnut",
      "equipment": "खुरपी, कुदाल, सिंचाई की मटकी, बीज, उर्वरक",
      "time duration": "90-120 दिन",
      "img": "",
      "name": "groundnut"
    },
    "peas": {
      "definition": "खाने के बीज के लिए उगाई जाने वाली एक दाली फली।",
      "advantages": "मटर प्रोटीन, फाइबर और विटामिन का एक अच्छा स्रोत है। इसे उगाना भी निर्मूल और सस्ता होता है।",
      "disadvantages": "मटर कीटों और रोगों के प्रति संक्रमण के प्रति संवेदनशील हो सकती है।",
      "method to grow": "मटर अच्छी निकासी वाली मिट्टी में उगाई जाती है। बीज मिट्टी में बोए जाते हैं और खेतों को आवश्यकतानुसार सिंचित किया जाता है। मटर के पौधे मिट्टी में उगते हैं और जब खरपतवार और पोड़े पक जाते हैं तब इन्हें कटा जाता है।",
      "how to grow": "मटर को विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह शीतल, आर्द्र जलवायु में बेहतरीन फलती है। मिट्टी अच्छी निकासी और पोषक होनी चाहिए। मटर एक तुलनात्मकता से आसान फसल है, लेकिन इसे बहुत सारा पानी की आवश्यकता होती है।",
      "cost of growth": "मटर की उगाई की लागत स्थान और खेती की विधि पर निर्भर करती है। हालांकि, यह आमतौर पर एक सस्ती फसल होती है।",
      "difficulty": "मटर एक तुलनात्मकता से आसान फसल है, लेकिन इसे बहुत सारा पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "मटर एक विविधतापूर्ण फसल है जिसे विभिन्न व्यंजनों में उपयोग किया जा सकता है। यह प्रोटीन, फाइबर और विटामिन का एक अच्छा स्रोत भी है।",
      "source": "https://www.britannica.com/plant/pea",
      "equipment": "खुरपी, कुदाल, सिंचाई की मटकी, बीज, उर्वरक",
      "time duration": "60-70 दिन",
      "img": "./picture/pea.jpg",
      "name": "मटर"
    },
    "rubber": {
      "definition": "रबर एक प्राकृतिक पॉलिमर है जो रबर के पेड़ों के रस से निकाला जाता है।",
      "advantages": "रबर एक बहुआयामी सामग्री है जो विभिन्न उत्पादों में उपयोग की जा सकती है। इसे उत्पादित करना भी यथार्थ में सस्ता होता है।",
      "disadvantages": "रबर पानी-प्रवाही फसल हो सकती है। यह कीटों और रोगों के प्रति संवेदनशील भी हो सकती है।",
      "method to grow": "रबर के पेड़ सुखग्रस्त मिट्टी में उगाए जाते हैं। पेड़ों से रस निकाला जाता है, जो फिर रबर में प्रसंस्कृत किया जाता है।",
      "how to grow": "रबर के पेड़ विभिन्न जलवायु में उगाए जा सकते हैं, लेकिन वे गर्म और आर्द्र जलवायु में बेहतर फलते हैं। मिट्टी सुख-प्रवाहित और उर्वरा होनी चाहिए। रबर के पेड़ उगाना एक संघर्षमय फसल है, लेकिन इसको काफी सारा पानी की आवश्यकता होती है।",
      "cost of growth": "रबर की खेती करने का खर्च स्थान और खेती के तरीके पर निर्भर करता है। हालांकि, इसे आमतौर पर सस्ती फसल माना जाता है।",
      "difficulty": "रबर के पेड़ एक संघर्षमय फसल है, लेकिन इसे काफी सारा पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण होता है।",
      "other details": "रबर एक बहुआयामी सामग्री है जो टायर, होज, और दस्ताने जैसे विभिन्न उत्पादों में उपयोग की जा सकती है। रबर के पेड़ मूल रूप से दक्षिण अमेरिका में पाए जाते थे, लेकिन अब वे दुनिया के कई हिस्सों में उगाए जाते हैं। वैश्विक रबर बाजार अरबों डॉलर के कीमती है।",
      "source": "https://www.britannica.com/plant/rubber-tree",
      "equipment": "खुरपी, उलटी, पानी की टंकी, बीज, खाद",
      "time duration": "7-8 साल",
      "img": "./picture/rubber.jpg",
      "name": "रबर"
    },
    "sugarcane": {
      "definition": "एक लंबा घास जो मिठे रस के लिए उगाई जाती है, जिससे चीनी बनाई जाती है।",
      "advantages": "गन्ना उगाना एक अपेक्षाकृत सरल फसल है और यह चीनी का एक अच्छा स्रोत है।",
      "disadvantages": "गन्ना पानी-प्रवाही फसल हो सकती है। यह कीटों और रोगों के प्रति संवेदनशील भी हो सकती है।",
      "method to grow": "गन्ना सुख-प्रवाहित मिट्टी में उगाया जाता है। पौधे के टुकड़ों से प्रसारित होता है और फिर धरती में लगाए जाते हैं। गन्ने के पौधे मिट्टी में उगते हैं और पक जाते हैं जब वे परिपक्व होते हैं।",
      "how to grow": "गन्ना विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह गर्म, आर्द्र जलवायु में बेहतर फलता है। मिट्टी सुख-प्रवाहित और उर्वरा होनी चाहिए। गन्ना उगाना एक अपेक्षाकृत सरल फसल है, लेकिन यह काफी सारा पानी की आवश्यकता होती है।",
      "cost of growth": "गन्ने की खेती करने का खर्च स्थान और खेती के तरीके पर निर्भर करता है। हालांकि, इसे आमतौर पर सस्ती फसल माना जाता है।",
      "difficulty": "गन्ना उगाना एक अपेक्षाकृत सरल फसल है, लेकिन यह काफी सारा पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण होता है।",
      "other details": "गन्ना एक बहुआयामी फसल है जिसे चीनी, गुड़ और एथेनॉल जैसे विभिन्न उत्पादों में उपयोग किया जा सकता है। गन्ना उगाने का मूल स्थान दक्षिण एशिया माना जाता है, लेकिन यह अब विश्वभर में उगाया जाता है। गन्ने के बाजार में अच्छी मांग होती है और इसकी खेती व्यापारिक रूप से लाभदायक हो सकती है।",
      "source": "https://www.britannica.com/plant/sugarcane",
      "equipment": "खुरपी, उलटी, पानी की टंकी, बीज, खाद",
      "time duration": "10-12 महीने",
      "img": "./picture/sugarcane.jpg",
      "name": "गन्ना"
    },
    "tobacco": {
      "definition": "तम्बाकू उत्पादों बनाने के लिए अपने पत्तों के लिए उगाए जाने वाले पौधे की खेती की जाती है।",
      "advantages": "तम्बाकू एक सरल फसल है और यह लाभदायक फसल हो सकती है।",
      "disadvantages": "तम्बाकू एक अत्यधिक आदी हेतु द्रव्य है और मृत्यु और रोग का मुख्य कारण है।",
      "method to grow": "तम्बाकू को सुखी और प्रवाहित मिट्टी में उगाया जाता है। बीज से पौधे अंकुरित किए जाते हैं और फिर मिट्टी में लगाए जाते हैं। तम्बाकू के पौधे मिट्टी में उगते हैं और जब वे परिपक्व हो जाते हैं, तब वे कटाई के लिए तैयार हो जाते हैं।",
      "how to grow": "तम्बाकू विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह गर्म और आर्द्र जलवायु में बेहतर फलता है। मिट्टी सुखी और प्रवाहित होनी चाहिए। तम्बाकू उगाना एक सरल फसल है, लेकिन यह काफी सारा पानी की आवश्यकता होती है।",
      "cost of growth": "तम्बाकू की खेती करने का खर्च स्थान और खेती के तरीके पर निर्भर करता है। हालांकि, इसे आमतौर पर उगाने के लिए एक सस्ती फसल माना जाता है।",
      "difficulty": "तम्बाकू एक सरल फसल है, लेकिन यह काफी सारा पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "तम्बाकू एक बहुमुखी फसल है जिसका उपयोग सिगरेट, सीगर, और तांबाकू चबाने के उत्पादों में किया जा सकता है। तम्बाकू अमेरिका का जन्मस्थान है, लेकिन अब यह दुनिया के कई हिस्सों में उगाया जाता है। वैश्विक तम्बाकू बाजार बिलियन डॉलर की मान्यता प्राप्त है।",
      "source": "https://www.britannica.com/plant/tobacco",
      "equipment": "कुदाल, फावड़ा, पानी की टंकी, बीज, खाद",
      "time duration": "6-8 महीने",
      "img": "./picture/tobacco.jpg",
      "name": "तम्बाकू"
    },
    "kidney beans": {
      "definition": "खाने के लिए उगाई जाने वाली एक फली फली फसल।",
      "advantages": "राजमा प्रोटीन, फाइबर, और लोहे का एक अच्छा स्रोत है। यह उगाने के लिए यथार्थ में सस्ती फसल होती है।",
      "disadvantages": "राजमा की फसल की कीटों और रोगों के प्रति संवेदनशील हो सकती है।",
      "method to grow": "राजमा सुखी और प्रवाहित मिट्टी में उगाया जाता है। बीज मिट्टी में बोए जाते हैं और खेतों को उचित जल आपूर्ति से सिंचाई की जाती है। राजमा के पौधे मिट्टी में उगते हैं और पॉड परिपक्व हो जाने पर उगाए जाते हैं।",
      "how to grow": "राजमा विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह गर्म और आर्द्र जलवायु में बेहतर फलता है। मिट्टी सुखी और प्रवाहित होनी चाहिए। राजमा उगाना एक सरल फसल है, लेकिन यह काफी सारा पानी की आवश्यकता होती है।",
      "cost of growth": "राजमा उगाने की लागत स्थान और खेती के तरीके पर निर्भर करती है। हालांकि, इसे आमतौर पर सस्ती फसल माना जाता है।",
      "difficulty": "राजमा एक सरल फसल है, लेकिन यह काफी सारा पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "राजमा एक बहुमुखी फसल है जिसे विभिन्न व्यंजनों में उपयोग किया जा सकता है। यह भी प्रोटीन, फाइबर, और लोहे का एक अच्छा स्रोत है।",
      "source": "https://www.britannica.com/plant/kidney-bean",
      "equipment": "कुदाल, फावड़ा, पानी की टंकी, बीज, खाद",
      "time duration": "60-70 दिन",
      "img": "./picture/rajma.jpg",
      "name": "राजमा"
    },
    "moth beans": {
      "definition": "एक खाद्य बीज के लिए उगाया जाने वाला एक दालीय पौधा।",
      "advantages": "मोथ बीन्स प्रोटीन, फाइबर, और आयरन का एक अच्छा स्रोत हैं। उन्हें उगाना भी शोध ज्यादा खर्च नहीं होता है।",
      "disadvantages": "मोथ बीन्स की कीटों और रोगों के प्रति संवेदनशील हो सकती हैं।",
      "method to grow": "मोथ बीन्स अच्छे ड्रेनेज वाले मिट्टी में उगाए जाते हैं। बीज मिट्टी में बोये जाते हैं और फसल के खेतों को आवश्यकतानुसार सिंचित किया जाता है। मोथ बीन्स के पौधे मिट्टी में उग जाते हैं और जब पोड्स पक जाते हैं तो उन्हें कटा जाता है।",
      "how to grow": "मोथ बीन्स विभिन्न जलवायु में उगाए जा सकते हैं, लेकिन उन्हें गर्म और आर्द्र जलवायु में सबसे अच्छा परिणाम मिलता है। मिट्टी अच्छे ड्रेनेज वाली और पौष्टिक होनी चाहिए। मोथ बीन्स उगाना उपजाऊ होता है, लेकिन उन्हें अधिक मात्रा में पानी की आवश्यकता होती है।",
      "cost of growth": "मोथ बीन्स को उगाने का खर्च स्थान और खेती के तरीके पर निर्भर करता है। हालांकि, यह आमतौर पर एक सस्ती फसल होती है।",
      "difficulty": "मोथ बीन्स उगाना आसान फसल है, लेकिन इसे अधिक मात्रा में पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण होता है।",
      "other details": "मोथ बीन्स एक विविधतापूर्ण फसल हैं जिन्हें विभिन्न व्यंजनों में उपयोग किया जा सकता है। वे प्रोटीन, फाइबर और आयरन का एक अच्छा स्रोत भी हैं।",
      "source": "https://www.britannica.com/plant/moth-bean",
      "equipment": "कुदाल, कुराद, सिंचाई की बरतन, बीज, खाद",
      "time duration": "60-70 दिन",
      "img": "./picture/moth.jpg",
      "name": "moth beans"
    },
    "coconut": {
      "definition": "नारियल का फल, जो एक लंबा, पतला पेड़ होता है।",
      "advantages": "नारियल प्रोटीन, फाइबर, और वसा का एक अच्छा स्रोत हैं। उन्हें उगाना भी शोध ज्यादा खर्च नहीं होता है।",
      "disadvantages": "नारियल जल संचयी फसल हो सकती है। वे कीटों और रोगों के प्रति संवेदनशील भी हो सकते हैं।",
      "method to grow": "नारियल अच्छे ड्रेनेज वाले मिट्टी में उगाया जाता है। नारियल के पेड़ मिट्टी में लगाए जाते हैं और फसल के खेतों को आवश्यकतानुसार सिंचित किया जाता है। नारियल के पेड़ मिट्टी में बढ़ते हैं और जब नारियल पक जाते हैं तब उन्हें कटा जाता है।",
      "how to grow": "नारियल विभिन्न जलवायु में उगाए जा सकते हैं, लेकिन उन्हें गर्म और आर्द्र जलवायु में सबसे अच्छा परिणाम मिलता है। मिट्टी अच्छे ड्रेनेज वाली और पौष्टिक होनी चाहिए। नारियल के पेड़ उगाना आसान फसल होती है, लेकिन उन्हें अधिक मात्रा में पानी की आवश्यकता होती है।",
      "cost of growth": "नारियल उगाने का खर्च स्थान और खेती के तरीके पर निर्भर करता है। हालांकि, यह आमतौर पर एक सस्ती फसल होती है।",
      "difficulty": "नारियल के पेड़ उगाना आसान फसल है, लेकिन उन्हें अधिक मात्रा में पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण होता है।",
      "other details": "नारियल एक विविधतापूर्ण फसल है जो नारियल की दूध, नारियल का तेल और नारियल पानी सहित विभिन्न उत्पादों में उपयोग की जा सकती है। नारियल के पेड़ गर्म देशों में पैदा होते हैं, लेकिन आज वे दुनिया के कई हिस्सों में उगाए जाते हैं। वैश्विक नारियल बाजार अरबों डॉलर का मोल्यांकन होता है।",
      "source": "https://www.britannica.com/plant/coconut-palm",
      "equipment": "कुदाल, कुराद, सिंचाई की बरतन, बीज, खाद",
      "time duration": "5-7 वर्ष",
      "img": "./picture/coconut.jpg",
      "name": "coconut"
    },
    "black gram": {
      "definition": "एक खाद्य बीज के लिए उगाया जाने वाला एक लेजूम है।",
      "advantages": "ब्लैक ग्राम में प्रोटीन, फाइबर और लोहा की अच्छी आपूर्ति होती है। इसे उगाना भी सस्ता होता है।",
      "disadvantages": "ब्लैक ग्राम की कीट और रोगों के प्रति संक्रमण हो सकता है।",
      "method to grow": "ब्लैक ग्राम को अच्छी निकासी वाली मिट्टी में उगाया जाता है। बीज मिट्टी में बोए जाते हैं और फ़ील्ड को जैसे आवश्यक होता है उसी अनुसार सिंचाई की जाती है। ब्लैक ग्राम के पौधे मिट्टी में उगने लगते हैं और फली पक जाने पर उगाई जाती हैं।",
      "how to grow": "ब्लैक ग्राम को विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह गर्म और आर्द्र जलवायु में सबसे अच्छा प्रदर्शन करता है। मिट्टी का निकासी होना चाहिए और पोषणशील होना चाहिए। ब्लैक ग्राम एक सरल फसल है, लेकिन इसके लिए बहुत सारा पानी की आवश्यकता होती है।",
      "cost of growth": "ब्लैक ग्राम की खेती की लागत स्थान और खेती की विधि पर निर्भर करती है। हालांकि, यह एक सामान्य रूप से सस्ती फसल है।",
      "difficulty": "ब्लैक ग्राम एक सरल फसल है, लेकिन इसके लिए बहुत सारा पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "ब्लैक ग्राम एक बहुमुखी फसल है जिसे विभिन्न व्यंजनों में उपयोग किया जा सकता है। यह प्रोटीन, फाइबर और लोहा की अच्छी आपूर्ति भी करती है।",
      "source": "https://www.britannica.com/plant/black-gram",
      "equipment": "कुदाल, उन्नत वाली, सिंचाई की बरसाती कान, बीज, उर्वरक",
      "time duration": "60-70 दिन",
      "img": "./picture/blackgram.jpg",
      "name": "ब्लैक ग्राम"
    },
    "adzuki beans": {
      "definition": "एक खाद्य बीज के लिए उगाया जाने वाला एक लेजूम है।",
      "advantages": "एडजुकी बीन्स प्रोटीन, फाइबर और लोहा की अच्छी आपूर्ति होती हैं। उन्हें उगाना भी सस्ता होता है।",
      "disadvantages": "एडजुकी बीन्स की कीट और रोगों के प्रति संक्रमण हो सकता है।",
      "method to grow": "एडजुकी बीन्स को अच्छी निकासी वाली मिट्टी में उगाया जाता है। बीज मिट्टी में बोए जाते हैं और फ़ील्ड को जैसे आवश्यक होता है उसी अनुसार सिंचाई की जाती है। एडजुकी बीन्स के पौधे मिट्टी में उगने लगते हैं और फली पक जाने पर उगाई जाती हैं।",
      "how to grow": "एडजुकी बीन्स को विभिन्न जलवायु में उगाया जा सकता है, लेकिन वे गर्म और आर्द्र जलवायु में सबसे अच्छा प्रदर्शन करते हैं। मिट्टी का निकासी होना चाहिए और पोषणशील होना चाहिए। एडजुकी बीन्स एक सरल फसल हैं, लेकिन वे बहुत सारा पानी की आवश्यकता होती है।",
      "cost of growth": "एडजुकी बीन्स की खेती की लागत स्थान और खेती की विधि पर निर्भर करती है। हालांकि, यह एक सामान्य रूप से सस्ती फसल है।",
      "difficulty": "एडजुकी बीन्स एक सरल फसल हैं, लेकिन उन्हें बहुत सारा पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "एडजुकी बीन्स एक बहुमुखी फसल हैं जिन्हें विभिन्न व्यंजनों में उपयोग किया जा सकता है। वे प्रोटीन, फाइबर और लोहा की अच्छी आपूर्ति भी करते हैं।",
      "source": "https://www.britannica.com/plant/adzuki-bean",
      "equipment": "कुदाल, उन्नत वाली, सिंचाई की बरसाती कान, बीज, उर्वरक",
      "time duration": "60-70 दिन",
      "img": "./picture/adjzuki beans'.jpg",
      "name": "एडजुकी बीन्स"
    },
    "pigeon pea": {
      "definition": "खाद्य बीज के लिए उगायी जाने वाली एक दालीय फली।",
      "advantages": "तूर दाल प्रोटीन, फाइबर और लोहा की अच्छी आपूर्ति करती है। इसकी उगाई की लागत भी सस्ती होती है।",
      "disadvantages": "तूर दाल की फसल कीट और रोगों के प्रति संवेदनशील हो सकती है।",
      "method to grow": "तूर दाल को अच्छी निकासी वाली मिट्टी में उगाया जाता है। बीज मिट्टी में बोए जाते हैं और फ़ील्ड को जैसे आवश्यक होता है उसी अनुसार सिंचाई की जाती है। तूर दाल के पौधे मिट्टी में उगने लगते हैं और फली पक जाने पर उगाई जाती है।",
      "how to grow": "तूर दाल को विभिन्न जलवायु में उगाया जा सकता है, लेकिन वे गर्म और आर्द्र जलवायु में सबसे अच्छा प्रदर्शन करते हैं। मिट्टी का निकासी होना चाहिए और पोषणशील होना चाहिए। तूर दाल एक सरल फसल हैं, लेकिन वे बहुत सारा पानी की आवश्यकता होती है।",
      "cost of growth": "तूर दाल की खेती की लागत स्थान और खेती की विधि पर निर्भर करती है। हालांकि, यह आमतौर पर सस्ती फसल होती है।",
      "difficulty": "तूर दाल एक सरल फसल हैं, लेकिन वे बहुत सारा पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण होता है।",
      "other details": "तूर दाल एक बहुमुखी फसल है जिसका उपयोग विभिन्न व्यंजनों में किया जा सकता है। यह एक अच्छा प्रोटीन, फाइबर और लोहा का स्रोत भी है।",
      "source": "https://www.britannica.com/plant/pigeon-pea",
      "equipment": "कुदाल, उन्नत वाली, सिंचाई की बरसाती कान, बीज, उर्वरक",
      "time duration": "90-120 दिन",
      "img": "./picture/pigeonpea.jpg",
      "name": "तूर दाल"
    },
    "chickpea": {
      "definition": "खाद्य बीज के लिए उगायी जाने वाली एक दालीय फली।",
      "advantages": "चने एक अच्छा प्रोटीन, फाइबर और लोहा का स्रोत हैं। इनकी उगाई की लागत भी सस्ती होती है।",
      "disadvantages": "चने की फसल कीट और रोगों के प्रति संवेदनशील हो सकती है।",
      "method to grow": "चने को अच्छी निकासी वाली मिट्टी में उगाया जाता है। बीज मिट्टी में बोए जाते हैं और फ़ील्ड को जैसे आवश्यक होता है उसी अनुसार सिंचाई की जाती है। चने के पौधे मिट्टी में उगने लगते हैं और फली पक जाने पर उगाई जाती है।",
      "how to grow": "चने को विभिन्न जलवायु में उगाया जा सकता है, लेकिन वे गर्म और आर्द्र जलवायु में सबसे अच्छा प्रदर्शन करते हैं। मिट्टी का निकासी होना चाहिए और पोषणशील होना चाहिए। चने एक सरल फसल हैं, लेकिन वे बहुत सारा पानी की आवश्यकता होती है।",
      "cost of growth": "चने की खेती की लागत स्थान और खेती की विधि पर निर्भर करती है। हालांकि, यह आमतौर पर सस्ती फसल होती है।",
      "difficulty": "चने एक सरल फसल हैं, लेकिन वे बहुत सारा पानी की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण होता है।",
      "other details": "चने एक बहुमुखी फसल है जिसका उपयोग विभिन्न व्यंजनों में किया जा सकता है। यह एक अच्छा प्रोटीन, फाइबर और लोहा का स्रोत भी है।",
      "source": "https://www.britannica.com/plant/chickpea",
      "equipment": "कुदाल, उन्नत वाली, सिंचाई की बरसाती कान, बीज, उर्वरक",
      "time duration": "60-70 दिन",
      "img": "./picture/chana.png",
      "name": "चना"
    },
    "banana": {
      "definition": "एक खाद्य फल - वनस्पति विज्ञान में एक जाति के अंतर्गत कई प्रकार के बड़े घासनीय फूल वाले पौधों द्वारा उत्पादित एक खाद्य फल है। फल आकार, रंग और कठोरता में अस्थायी होता है, लेकिन आमतौर पर इलायची दार और मुड़े हुए होता है, जिसमें स्टार्च से भरी नरम मांस और पका हुआ ताजा रंग वाली छिलका होती है। जब फल पक जाता है, तो यह हरा, पीला, लाल, बैंगनी या भूरा होता है।",
      "advantages": "बनाने में पोटेशियम, विटामिन सी और फाइबर का अच्छा स्रोत होता है। इन्हें खरीदने में भी उपयुक्त होता है।",
      "disadvantages": "बनाने की खेती की कीटों और रोगों के प्रति संवेदनशील हो सकती है।",
      "method to grow": "बनाने उष्णकटिबंधीय और अर्ध-उष्णकटिबंधीय जलवायु में उगाये जाते हैं। पौधों को सप्लिंग्स या बीजों से प्रजनन किया जाता है। पौधों को अच्छी निकासी वाली मिट्टी में उगाया जाता है और उन्हें बहुत सारा पानी की आवश्यकता होती है। फल पक जाते हैं तब पौधे कटाए जाते हैं।",
      "how to grow": "बनाने को विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह गर्म और नम जलवायु में बेहतर फलता है। मिट्टी का अच्छा निकासी और पोषणशील होना चाहिए। बनाने की खेती निर्माण की दृष्टि से एक सस्ती मात्रा में होती है, लेकिन यह बहुत सारा पानी की आवश्यकता होती है।",
      "cost of growth": "बनाने की खेती की लागत स्थान और खेती के तरीके पर निर्भर करती है। हालांकि, यह आमतौर पर एक सस्ती फसल उगाने की लागत होती है।",
      "difficulty": "बनाने उगाना एक आसान फसल है, लेकिन इसमें बहुत सारा पानी की आवश्यकता होती है। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "बनाना एक बहुमुखी फसल है जिसे विभिन्न व्यंजनों में उपयोग किया जा सकता है। यह पोटेशियम, विटामिन सी और फाइबर का अच्छा स्रोत भी है।",
      "source": "https://www.britannica.com/plant/banana",
      "equipment": "फावड़ा, कुदाल, सिंचाई करने की कन, बीज, खाद",
      "time duration": "12-18 महीने",
      "img": "./picture/banana.jpg",
      "name": "बनाना"
    },
    "grapes": {
      "definition": "एक प्रकार का बेरी जो आमतौर पर मिठा और बीजरहित होता है। अंगूर आमतौर पर हरी, लाल या बैंगनी रंग का होता है। इसे अक्सर वाइन बनाने के लिए उपयोग किया जाता है, लेकिन इसे ताजा खाने या अन्य व्यंजनों में उपयोग किया जा सकता है।",
      "advantages": "अंगूर एंटीऑक्सीडेंट्स, पोटेशियम और विटामिन का एक अच्छा स्रोत होता है। इसे खरीदने में भी उपयुक्त होता है।",
      "disadvantages": "अंगूर की खेती की कीटों और रोगों के प्रति संवेदनशील हो सकती है।",
      "method to grow": "अंगूर उष्णकटिबंधीय और अर्ध-उष्णकटिबंधीय जलवायु में उगाए जाते हैं। पौधों को कटिंग्स या बीज से प्रजनन किया जाता है। पौधों को अच्छी निकासी वाली मिट्टी में उगाया जाता है और उन्हें बहुत सारा सूरज की आवश्यकता होती है। अंगूर पक जाते हैं तब पौधे कटे जाते हैं।",
      "how to grow": "अंगूर विभिन्न जलवायु में उगाया जा सकता है, लेकिन यह गर्म और सूखे जलवायु में बेहतर फलता है। मिट्टी का अच्छा निकासी और पोषणशील होना चाहिए। अंगूर उगाना एक आसान फसल है, लेकिन इसमें सूरज की बहुत सारी आवश्यकता होती है।",
      "cost of growth": "अंगूर की खेती की लागत स्थान और खेती के तरीके पर निर्भर करती है। हालांकि, यह आमतौर पर एक सस्ती फसल उगाने की लागत होती है।",
      "difficulty": "अंगूर एक आसान फसल है, लेकिन इसमें सूरज की बहुत सारी आवश्यकता होती है। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "अंगूर एक बहुमुखी फसल है जिसे विभिन्न व्यंजनों में उपयोग किया जा सकता है। यह एंटीऑक्सीडेंट्स, पोटेशियम और विटामिन का एक अच्छा स्रोत भी है।",
      "source": "https://www.britannica.com/plant/grape",
      "equipment": "फावड़ा, कुदाल, सिंचाई करने की कन, बीज, खाद",
      "time duration": "90-120 दिन",
      "img": "./picture/grapes.jpg",
      "name": "अंगूर"
    },
    "apple": {
      "definition": "सेब एपल वृक्ष द्वारा उत्पादित एक सेब की तरह का फल है। सेब उष्णकटिबंधीय जलवायु में उगते हैं और गुलाबी परिवार के सदस्य हैं। वे सामान्यतः गोल या ओवल के आकार में होते हैं और हल्की त्वचा होती है जो हरे, लाल, पीले या रंगों की मिश्रण हो सकती है। सेब फाइबर, विटामिन सी और पोटैशियम का अच्छा स्रोत हैं।",
      "advantages": "सेब फाइबर, विटामिन सी और पोटैशियम का अच्छा स्रोत हैं। उन्हें खरीदने में भी सस्ते होते हैं।",
      "disadvantages": "सेब की कीटों और रोगों के प्रति प्रवण हो सकती हैं।",
      "method to grow": "सेब उष्णकटिबंधीय जलवायु में उगते हैं। पेड़ों को बीजों से या ग्राफ्टिंग से प्रजनन किया जाता है। पेड़ों को अच्छी निर्धारित मिट्टी में उगाया जाता है और उन्हें धूप की बहुत आवश्यकता होती है। पेड़ तब कटे जाते हैं जब सेब पक जाते हैं।",
      "how to grow": "सेब विभिन्न जलवायु में उगाए जा सकते हैं, लेकिन वे शीतोष्ण, सूखी जलवायु में सर्वोत्तम रहते हैं। मिट्टी अच्छी निर्धारित होनी चाहिए और पोषक भरी होनी चाहिए। सेब के पेड़ एक अप्रत्यक्ष फसल हैं, लेकिन उन्हें धूप की बहुत आवश्यकता होती है।",
      "cost of growth": "सेब की खेती का खर्च स्थान और खेती की विधि पर निर्भर करता है। हालांकि, यह आमतौर पर एक सस्ती फसल होती है।",
      "difficulty": "सेब के पेड़ एक अप्रत्यक्ष फसल हैं, लेकिन उन्हें धूप की बहुत आवश्यकता होती है। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "सेब एक विविध फसल हैं जो विभिन्न व्यंजनों में उपयोग किया जा सकता है। वे फाइबर, विटामिन सी और पोटैशियम का अच्छा स्रोत भी हैं।",
      "source": "https://www.britannica.com/plant/apple",
      "equipment": "कुदाल, रेक, पानी देने की कान, बीज, खाद",
      "time duration": "1-3 वर्ष",
      "img": "./picture/apple.jpg",
      "name": "सेब"
    },
    "mango": {
      "definition": "एक उष्णकटिबंधीय फल जो दक्षिण एशिया का मूल्यांकन है। आम आमतौर पर अंडाकार आकार में होते हैं और पीले, संतरे या लाल रंग की त्वचा होती है। आम का मांस मीठा और रसीला होता है और इसे ताजगी से खाया जा सकता है या विभिन्न व्यंजनों में उपयोग किया जा सकता है। आम विटामिन सी, पोटैशियम और फाइबर का अच्छा स्रोत हैं।",
      "advantages": "आम विटामिन सी, पोटैशियम और फाइबर का अच्छा स्रोत हैं। उन्हें खरीदने में भी सस्ते होते हैं।",
      "disadvantages": "आम की कीटों और रोगों के प्रति प्रवण हो सकती हैं।",
      "method to grow": "आम उष्णकटिबंधीय और उपशांत जलवायु में उगते हैं। पेड़ों को बीजों से या ग्राफ्टिंग से प्रजनन किया जाता है। पेड़ों को अच्छी निर्धारित मिट्टी में उगाया जाता है और उन्हें धूप की बहुत आवश्यकता होती है। पेड़ तब कटे जाते हैं जब आम पक जाते हैं।",
      "how to grow": "आम विभिन्न जलवायु में उगाए जा सकते हैं, लेकिन वे उष्ण, आर्द्र जलवायु में सबसे अच्छी तरह से उगते हैं। मिट्टी अच्छी निर्धारित होनी चाहिए और पोषक भरी होनी चाहिए। आम के पेड़ एक अप्रत्यक्ष फसल हैं, लेकिन उन्हें धूप की बहुत आवश्यकता होती है।",
      "cost of growth": "आम की खेती का खर्च स्थान और खेती की विधि पर निर्भर करता है। हालांकि, यह आमतौर पर एक सस्ती फसल होती है।",
      "difficulty": "आम के पेड़ एक अप्रत्यक्ष फसल हैं, लेकिन उन्हें धूप की बहुत आवश्यकता होती है। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "आम एक विविध फसल हैं जो विभिन्न व्यंजनों में उपयोग किया जा सकता है। वे विटामिन सी, पोटैशियम और फाइबर का अच्छा स्रोत भी हैं।",
      "source": "https://www.britannica.com/plant/mango",
      "equipment": "कुदाल, रेक, पानी देने की कान, बीज, खाद",
      "time duration": "3-5 वर्ष",
      "img": "./picture/mango.jpg",
      "name": "आम"
    },
    "muskmelon": {
      "definition": "एक प्रकार का खरबूजा जो आमतौर पर गोल या ओवल के आकार में होता है और मीठी नारंगी मांस होता है। मस्कमेलन विटामिन ए, पोटैशियम और फाइबर का अच्छा स्रोत हैं।",
      "advantages": "मस्कमेलन विटामिन ए, पोटैशियम और फाइबर का अच्छा स्रोत हैं। उन्हें खरीदने में भी सस्ते होते हैं।",
      "disadvantages": "मस्कमेलन की कीटों और रोगों के प्रति प्रवण हो सकती हैं।",
      "method to grow": "मस्कमेलन उष्णद्वीपीय और अपशांत जलवायु में उगाया जाता है। पौधों को बीजों से या ग्राफ्टिंग से प्रजनन किया जाता है। पौधों को अच्छी निर्धारित मिट्टी में उगाया जाता है और उन्हें धूप की बहुत आवश्यकता होती है। पौधे तब कटे जाते हैं जब मस्कमेलन पक जाते हैं।",
      "how to grow": "मस्कमेलन विभिन्न जलवायु में उगाए जा सकते हैं, लेकिन वे गर्म और आर्द्र जलवायु में सबसे अच्छी तरह से उगते हैं। मिट्टी अच्छी निर्धारित होनी चाहिए और पोषक भरी होनी चाहिए। मस्कमेलन पौधे एक सस्ती फसल होते हैं, लेकिन उन्हें धूप की बहुत आवश्यकता होती है।",
      "cost of growth": "मस्कमेलन की खेती का खर्च स्थान और खेती की विधि पर निर्भर करता है। हालांकि, यह आमतौर पर एक सस्ती फसल होती है।",
      "difficulty": "मस्कमेलन पौधे एक अप्रत्यक्ष फसल हैं, लेकिन उन्हें धूप की बहुत आवश्यकता होती है। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "मस्कमेलन एक विविध फसल हैं जो विभिन्न व्यंजनों में उपयोग किया जा सकता है। वे विटामिन ए, पोटैशियम और फाइबर का अच्छा स्रोत भी हैं।",
      "source": "https://www.britannica.com/plant/muskmelon",
      "equipment": "कुदाल, रेक, पानी देने की कान, बीज, खाद",
      "time duration": "3-5 महीने",
      "img": "./picture/muskmelon.jpg",
      "name": "खरबूजा"
    },
    "orange": {
      "definition": "एक साइट्रस फल जो दक्षिण पूर्व एशिया का मूल है। संतरे विटामिन सी, पोटैशियम और फाइबर का अच्छा स्रोत हैं।",
      "advantages": "संतरे विटामिन सी, पोटैशियम और फाइबर का अच्छा स्रोत हैं। उन्हें खरीदने में भी सस्ते होते हैं।",
      "disadvantages": "संतरे की कीटों और रोगों के प्रति प्रवण हो सकते हैं।",
      "method to grow": "संतरे उष्णद्वीपीय और अपशांत जलवायु में उगाए जाते हैं। पेड़ों को बीजों से या ग्राफ्टिंग से प्रजनन किया जाता है। पेड़ों को अच्छी निर्धारित मिट्टी में उगाया जाता है और उन्हें धूप की बहुत आवश्यकता होती है। पेड़ तब काटे जाते हैं जब संतरे पक जाते हैं।",
      "how to grow": "संतरे विभिन्न जलवायु में उगाए जा सकते हैं, लेकिन वे गर्म और सूखे जलवायु में सबसे अच्छी तरह से उगते हैं। मिट्टी अच्छी निर्धारित होनी चाहिए और पोषक भरी होनी चाहिए। संतरे पेड़ उगाना एक अप्रत्यक्ष फसल हैं, लेकिन उन्हें धूप की बहुत आवश्यकता होती है।",
      "cost of growth": "संतरे की खेती का खर्च स्थान और खेती की विधि पर निर्भर करता है। हालांकि, यह आमतौर पर एक सस्ती फसल होती है।",
      "difficulty": "संतरे पेड़ उगाना एक अप्रत्यक्ष फसल हैं, लेकिन उन्हें धूप की बहुत आवश्यकता होती है। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "संतरे एक विविध फसल हैं जो विभिन्न व्यंजनों में उपयोग किया जा सकता है। वे विटामिन सी, पोटैशियम और फाइबर का अच्छा स्रोत भी हैं।",
      "source": "https://www.britannica.com/plant/orange",
      "equipment": "कुदाल, रेक, पानी देने की कान, बीज, खाद",
      "time duration": "4-6 साल",
      "img": "./picture/orange.jpg",
      "name": "संतरा"
    },
    "papaya": {
      "definition": "एक उष्णकटिबंधीय फल जो मध्य अमेरिका का मूल है। पपीते में विटामिन सी, पोटैशियम और फाइबर का अच्छा स्रोत होता है।",
      "advantages": "पपीते में विटामिन सी, पोटैशियम और फाइबर का अच्छा स्रोत होता है। इन्हें खरीदने में भी निर्मलता से सस्ते होते हैं।",
      "disadvantages": "पपीते की कीटों और रोगों के प्रति प्रवण हो सकते हैं।",
      "method to grow": "पपीते उष्णद्वीपीय और अपशांत जलवायु में उगाए जाते हैं। पेड़ों को बीजों से या ग्राफ्टिंग से प्रजनन किया जाता है। पेड़ों को अच्छी निर्धारित मिट्टी में उगाया जाता है और उन्हें धूप की बहुत आवश्यकता होती है। पपीते पक जाते हैं तब कटाए जाते हैं।",
      "how to grow": "पपीते विभिन्न जलवायु में उगाए जा सकते हैं, लेकिन वे गर्म और आर्द्र जलवायु में सबसे अच्छी तरह से उगते हैं। मिट्टी अच्छी निर्धारित होनी चाहिए और पोषक भरी होनी चाहिए। पपीते पेड़ उगाना एक अप्रत्यक्ष फसल हैं, लेकिन धूप की बहुत आवश्यकता होती है।",
      "cost of growth": "पपीते को उगाने का खर्च स्थान और पालन पद्धति पर निर्भर करता है। हालांकि, यह एक सामान्य रूप से सस्ती फसल होती है।",
      "difficulty": "पपीते के पेड़ उगाना एक अप्रत्यक्ष फसल हैं, लेकिन धूप की बहुत आवश्यकता होती है। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "पपीते एक विविध फसल हैं जो विभिन्न व्यंजनों में उपयोग किया जा सकता है। वे विटामिन सी, पोटैशियम और फाइबर का अच्छा स्रोत भी हैं।",
      "source": "https://www.britannica.com/plant/papaya",
      "equipment": "कुदाल, रेक, पानी देने की कान, बीज, खाद",
      "time duration": "3-5 साल",
      "img": "./picture/papaya.jpg",
      "name": "पपीता"
    },
    "pomegranate": {
      "definition": "इरान का मूल होने वाला एक फल। अनार सामान्यतः गोलाकार होता है और इसका लाल, रसीला मांस होता है। यह विटामिन सी, पोटैशियम और फाइबर का अच्छा स्रोत है।",
      "advantages": "अनार विटामिन सी, पोटैशियम और फाइबर का अच्छा स्रोत होता है। इन्हें खरीदने में भी निर्मलता से सस्ते होते हैं।",
      "disadvantages": "अनार को बीज से निकालना कठिन हो सकता है।",
      "method to grow": "अनार उष्णकटिबंधीय और अपशांत जलवायु में उगाए जाते हैं। पेड़ बीजों से या ग्राफ्टिंग से प्रजनन किया जाता है। उन्हें अच्छी निर्धारित मिट्टी में उगाया जाता है और धूप की बहुत आवश्यकता होती है। अनार पक जाते हैं तब कटाए जाते हैं।",
      "how to grow": "अनार विभिन्न जलवायु में उगाए जा सकते हैं, लेकिन वे गर्म और सूखी जलवायु में सबसे अच्छी तरह से उगते हैं। मिट्टी अच्छी निर्धारित होनी चाहिए और पोषक भरी होनी चाहिए। अनार के पेड़ सामान्यतः उगाने में सुविधाजनक होते हैं, लेकिन उन्हें धूप की बहुत आवश्यकता होती है।",
      "cost of growth": "अनार को उगाने का खर्च स्थान और पालन पद्धति पर निर्भर करता है। हालांकि, यह एक सामान्य रूप से सस्ती फसल होती है।",
      "difficulty": "अनार के पेड़ सामान्यतः उगाने में सुविधाजनक होते हैं, लेकिन उन्हें धूप की बहुत आवश्यकता होती है। कीटों और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "अनार एक विविध फसल हैं जो विभिन्न व्यंजनों में उपयोग किया जा सकता है। वे विटामिन सी, पोटैशियम और फाइबर का अच्छा स्रोत भी हैं।",
      "source": "https://www.britannica.com/plant/pomegranate",
      "equipment": "कुदाल, रेक, पानी देने की कान, बीज, खाद",
      "time duration": "6-8 साल",
      "img": "./picture/pomegranate.jpg",
      "name": "अनार"
    },
    "watermelon": {
      "definition": "एक प्रकार का खरबूज़ जो सामान्य रूप से गोल या अंडाकार आकार का होता है और इसमें मिठे, लाल मांस होता है। तरबूज़ अफ्रीका की मूल निवासी हैं और विटामिन ए, पोटेशियम, और फाइबर का एक अच्छा स्रोत है।",
      "advantages": "तरबूज़ विटामिन ए, पोटेशियम, और फाइबर का एक अच्छा स्रोत है। इसे खरीदना भी निर्मूल्य होता है।",
      "disadvantages": "तरबूज़ की कीटों और रोगों के प्रति आसार हो सकता है।",
      "method to grow": "तरबूज़ मध्यम और उपमहाद्वीपीय जलवायु में उगाए जाते हैं। पौधे के बीजों से या पेड़ों के छालनी से प्रजनन किया जाता है। उन्हें अच्छी निर्वहनी वाली मिट्टी में उगाया जाता है और उन्हें अधिक सूर्य प्रकाश की आवश्यकता होती है। तरबूज़ पकने पर कटाई की जाती है।",
      "how to grow": "तरबूज़ विभिन्न जलवायु में उगाया जा सकता है, लेकिन वह गर्म और आर्द्र जलवायु में सबसे अच्छे अंक प्राप्त करता है। मिट्टी अच्छी निर्वहनी वाली और पौष्टिक होनी चाहिए। तरबूज़ के पौधे एक अपेक्षाकृत सरलता से उगाए जा सकते हैं, लेकिन उन्हें बहुत सूर्य प्रकाश की आवश्यकता होती है।",
      "cost of growth": "तरबूज़ की उगाई की लागत स्थान और खेती के तरीके पर निर्भर करती है। हालांकि, यह आमतौर पर उगाने के लिए एक निर्मूल्य फसल होती है।",
      "difficulty": "तरबूज़ के पौधे उगाना सरल होता है, लेकिन उन्हें बहुत सूर्य प्रकाश की आवश्यकता होती है। कीट और रोगों को नियंत्रित करना भी महत्वपूर्ण है।",
      "other details": "तरबूज़ एक बहुमुखी फसल है जो विभिन्न व्यंजनों में उपयोग किया जा सकता है। यह विटामिन ए, पोटेशियम, और फाइबर का एक अच्छा स्रोत है।",
      "source": "https://www.britannica.com/plant/watermelon",
      "equipment": "तरवार, रेक, सिंचाई की टोटी, बीज, खाद",
      "time duration": "3-4 महीने",
      "img": "./picture/water melon.jpg",
      "name": "तरबूज़"
    }
  }
}