{
    "h1_name":"BOLLWORM",
    "h1_para":"Bollworm larva on boll. The cotton bollworm (a.k.a. corn earworm) is a serious pest in the southern cotton growing areas. In Kansas cotton, infestations are sometimes observed, although damage has been limited even when high infestations have developed in corn and grain sorghum.",

    "h2_name":"APHIDS",
    "h2_para":"Aphids have soft pear-shaped bodies with long legs and antennae and may be green, yellow, brown, red, or black depending on the species and the plants they feed on. A few species appear waxy or woolly due to the secretion of a waxy white or gray substance over their body surface.",
    
    "h3_name":"WHITEFLIES",
    "h3_para":"Whiteflies are tiny, sap-sucking insects that may become abundant in vegetable and ornamental plantings, especially during warm weather. They excrete sticky honeydew and cause yellowing or death of leaves. Outbreaks often occur when the natural biological control is disrupted.",

    "h4_name":"GRASSHOPPERS",
    "h4_para":"Grasshoppers are an important source of food for many species of grassland birds. Recognizing pest from non-pest species can help in managing those grasshopper populations that are a potential threat to a crop while not harming non-pest species, which can have a valuable ecological role.",

    "h5_name":"LEAFHOPPER",
    "h5_para":"Leafhoppers are commonly brown, gray, green, or yellow overall or a mottled mix of coloration. Some species are brightly colored, while others blend with the color of their host plant(s). Leafhoppers are active insects that walk rapidly sideways or readily jump when disturbed.",

    "h6_name":"ARMYWORM",
    "h6_para":"Armyworms are caterpillar pests of grass pastures and cereal crops. They are the only caterpillars that growers are likely to encounter in cereal crops, although occasionally native budworm will also attack grain when underlying weed hosts dry out.",

    "h7_name":"TERMITES",
    "h7_para":"Termites threaten major crops, which form the basis of household nutrition in many countries such as wheat, maize, groundnut, sugarcane, yams and cassava. The most common termite species in India are Microtermes and Odontotermes",

    "h8_name":"MITES",
    "h8_para":"mites are serious pests in indoor and outdoor agricultural ecosystems and are controlled by synthetic pesticides. Pesticides adversely affect natural enemies and lead to environmental pollution, human health problems, harmful side effects, and risk of pest resistance.",

    "h9_name":"JASSIDS",
    "h9_para":"Jassid is a sucking pest occurring throughout the crop growing period on cotton in all the zones. The pest injects toxins into leaves while feeding which results in abnormal changes in leaves - marginal chlorosis and reddening",

    "h10_name":"STEMBORERS",
    "h10_para":"Stem borers constitute the most widely distributed and injurious group of insect pests of cereal crops. They are commonly known to be one of the limiting factors of cereal production worldwide. They are present in field throughout the crop growing stage from seedling to maturity"
}