{
    "cropData": {
      "rice": {
        "definition": "ਇੱਕ ਅਨਾਜ ਅਨਾਜ ਵਜੋਂ ਉਗਾਇਆ ਗਿਆ ਘਾਹ।",
        "advantages": "ਦੁਨੀਆ ਦੀ ਅੱਧੀ ਤੋਂ ਵੱਧ ਆਬਾਦੀ ਲਈ ਇੱਕ ਮੁੱਖ ਭੋਜਨ। ",
        "disadvantages": "ਚਾਵਲ ਇੱਕ ਪਾਣੀ ਦੀ ਤੀਬਰ ਫਸਲ ਹੈ। ",
        "method to grow": "ਹੜ੍ਹ ਵਾਲੇ ਖੇਤਾਂ ਵਿੱਚ ਚੌਲਾਂ ਦੀ ਖੇਤੀ ਕੀਤੀ ਜਾਂਦੀ ਹੈ। ",
        "how to grow": "ਚਾਵਲ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੁੰਦਾ ਹੈ। ",
        "cost of growth": "ਚੌਲਾਂ ਦੀ ਕਾਸ਼ਤ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਚਾਵਲ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਸ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਚਾਵਲ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/rice",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "6-8 ਮਹੀਨੇ",
        "img": "/cropImg/paddy.webp",
        "name": "ਚੌਲ"
      },
      "wheat": {
        "definition": "ਇੱਕ ਅਨਾਜ ਅਨਾਜ ਵਜੋਂ ਉਗਾਇਆ ਗਿਆ ਘਾਹ।",
        "advantages": "ਵਿਸ਼ਵ ਦੀ ਆਬਾਦੀ ਦੇ ਇੱਕ ਤਿਹਾਈ ਤੋਂ ਵੱਧ ਲੋਕਾਂ ਲਈ ਇੱਕ ਮੁੱਖ ਭੋਜਨ। ",
        "disadvantages": "ਕਣਕ ਇੱਕ ਪਾਣੀ ਦੀ ਤੀਬਰ ਫਸਲ ਹੈ। ",
        "method to grow": "ਕਣਕ ਸੁੱਕੇ ਖੇਤਾਂ ਵਿੱਚ ਉਗਾਈ ਜਾਂਦੀ ਹੈ। ",
        "how to grow": "ਕਣਕ ਨੂੰ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਠੰਡੇ, ਤਪਸ਼ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੈ। ",
        "cost of growth": "ਕਣਕ ਦੀ ਕਾਸ਼ਤ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਕਣਕ ਉਗਾਉਣ ਲਈ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਸ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਕਣਕ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/wheat",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "7-8 ਮਹੀਨੇ",
        "img": "/cropImg/wheat.webp",
        "name": "ਕਣਕ"
      },
      "mung bean": {
        "definition": "ਇਸ ਦੇ ਖਾਣ ਯੋਗ ਬੀਜਾਂ ਲਈ ਉਗਾਈ ਇੱਕ ਫਲ਼ੀ।",
        "advantages": "ਮੂੰਗ ਦਾਲ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਵਿਟਾਮਿਨ ਦਾ ਇੱਕ ਚੰਗਾ ਸਰੋਤ ਹੈ। ",
        "disadvantages": "ਮੂੰਗੀ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੀ ਹੈ।",
        "method to grow": "ਮੂੰਗੀ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਈ ਜਾਂਦੀ ਹੈ। ",
        "how to grow": "ਮੂੰਗ ਦੀਆਂ ਫਲੀਆਂ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਈਆਂ ਜਾ ਸਕਦੀਆਂ ਹਨ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੁੰਦੀਆਂ ਹਨ। ",
        "cost of growth": "ਮੂੰਗੀ ਦੀ ਕਾਸ਼ਤ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਮੂੰਗੀ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਮੂੰਗ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/mung-bean",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "60-70 ਦਿਨ",
        "img": "/cropImg/mong.webp",
        "name": "ਮੂੰਗ ਦੀ ਦਾਲ"
      },
      "tea": {
        "definition": "ਕੈਮੇਲੀਆ ਸਾਈਨੇਨਸਿਸ ਪੌਦੇ ਦੇ ਪੱਤਿਆਂ ਤੋਂ ਤਿਆਰ ਇੱਕ ਖੁਸ਼ਬੂਦਾਰ ਪੀਣ ਵਾਲਾ ਪਦਾਰਥ।",
        "advantages": "ਚਾਹ ਐਂਟੀਆਕਸੀਡੈਂਟਸ ਦਾ ਇੱਕ ਚੰਗਾ ਸਰੋਤ ਹੈ ਅਤੇ ਇਸ ਵਿੱਚ ਕਈ ਸਿਹਤ ਲਾਭ ਹਨ। ",
        "disadvantages": "ਚਾਹ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੀ ਹੈ।",
        "method to grow": "ਚਾਹ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਈ ਜਾਂਦੀ ਹੈ। ",
        "how to grow": "ਚਾਹ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੈ। ",
        "cost of growth": "ਚਾਹ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਚਾਹ ਉਗਾਉਣ ਲਈ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਸ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਚਾਹ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/tea",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "3-4 ਸਾਲ",
        "img": "/cropImg/tea.webp",
        "name": "ਚਾਹ"
      },
      "millet": {
        "definition": "ਇਸ ਦੇ ਖਾਣ ਯੋਗ ਬੀਜਾਂ ਲਈ ਕਾਸ਼ਤ ਕੀਤੀ ਘਾਹ।",
        "advantages": "ਬਾਜਰਾ ਕਾਰਬੋਹਾਈਡਰੇਟ, ਪ੍ਰੋਟੀਨ ਅਤੇ ਫਾਈਬਰ ਦਾ ਚੰਗਾ ਸਰੋਤ ਹੈ। ",
        "disadvantages": "ਬਾਜਰਾ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦਾ ਹੈ।",
        "method to grow": "ਬਾਜਰੇ ਨੂੰ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ। ",
        "how to grow": "ਬਾਜਰੇ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਸੁੱਕੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੁੰਦਾ ਹੈ। ",
        "cost of growth": "ਬਾਜਰੇ ਨੂੰ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਬਾਜਰਾ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਸਨੂੰ ਬਹੁਤ ਜ਼ਿਆਦਾ ਧੁੱਪ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਬਾਜਰਾ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/millet",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "60-70 ਦਿਨ",
        "img": "/cropImg/millet.webp",
        "name": "ਬਾਜਰਾ"
      },
      "maize": {
        "definition": "ਇੱਕ ਅਨਾਜ ਅਨਾਜ ਜੋ ਵਿਸ਼ਵ ਵਿੱਚ ਸਭ ਤੋਂ ਵੱਧ ਵਿਆਪਕ ਤੌਰ 'ਤੇ ਉਗਾਈ ਜਾਣ ਵਾਲੀ ਅਨਾਜ ਦੀ ਫਸਲ ਹੈ।",
        "advantages": "ਮੱਕੀ ਕਾਰਬੋਹਾਈਡਰੇਟ, ਪ੍ਰੋਟੀਨ ਅਤੇ ਫਾਈਬਰ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹੈ। ",
        "disadvantages": "ਮੱਕੀ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੀ ਹੈ।",
        "method to grow": "ਮੱਕੀ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਈ ਜਾਂਦੀ ਹੈ। ",
        "how to grow": "ਮੱਕੀ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੁੰਦਾ ਹੈ। ",
        "cost of growth": "ਮੱਕੀ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਮੱਕੀ ਉਗਾਉਣ ਲਈ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਸ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਮੱਕੀ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/maize",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "90-120 ਦਿਨ",
        "img": "/cropImg/maize.webp",
        "name": "ਮੱਕੀ"
      },
      "lentil": {
        "definition": "ਇਸ ਦੇ ਖਾਣ ਯੋਗ ਬੀਜਾਂ ਲਈ ਉਗਾਈ ਇੱਕ ਫਲ਼ੀ।",
        "advantages": "ਦਾਲ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਆਇਰਨ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹੈ। ",
        "disadvantages": "ਦਾਲ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੀ ਹੈ।",
        "method to grow": "ਦਾਲ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਈ ਜਾਂਦੀ ਹੈ। ",
        "how to grow": "ਦਾਲਾਂ ਨੂੰ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਉਹ ਠੰਡੇ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਦਾਲ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਦਾਲ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਦਾਲ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/lentil",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "60-70 ਦਿਨ",
        "img": "/cropImg/litne.webp",
        "name": "ਦਾਲ"
      },
      "jute": {
        "definition": "ਇੱਕ ਪੌਦਾ ਇਸਦੇ ਰੇਸ਼ੇ ਲਈ ਕਾਸ਼ਤ ਕੀਤਾ ਜਾਂਦਾ ਹੈ।",
        "advantages": "ਜੂਟ ਇੱਕ ਮਜ਼ਬੂਤ ​​ਅਤੇ ਟਿਕਾਊ ਰੇਸ਼ਾ ਹੈ। ",
        "disadvantages": "ਜੂਟ ਇੱਕ ਪਾਣੀ ਦੀ ਤੀਬਰ ਫਸਲ ਹੈ। ",
        "method to grow": "ਜੂਟ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ। ",
        "how to grow": "ਜੂਟ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੁੰਦਾ ਹੈ। ",
        "cost of growth": "ਜੂਟ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਜੂਟ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਸ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਜੂਟ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਉਤਪਾਦਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/jute",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "120-150 ਦਿਨ",
        "img": "/cropImg/jute.webp",
        "name": "ਜੂਟ"
      },
      "coffee": {
        "definition": "ਇੱਕ ਝਾੜੀ ਜਾਂ ਛੋਟਾ ਰੁੱਖ ਇਸ ਦੀਆਂ ਬੀਨਜ਼ ਲਈ ਕਾਸ਼ਤ ਕੀਤਾ ਜਾਂਦਾ ਹੈ, ਜੋ ਕੌਫੀ ਪੈਦਾ ਕਰਨ ਲਈ ਭੁੰਨਿਆ ਜਾਂਦਾ ਹੈ ਅਤੇ ਜ਼ਮੀਨ ਵਿੱਚ ਹੁੰਦਾ ਹੈ।",
        "advantages": "ਕੌਫੀ ਇੱਕ ਉਤੇਜਕ ਹੈ ਜੋ ਸੁਚੇਤਤਾ ਅਤੇ ਬੋਧਾਤਮਕ ਕਾਰਜ ਨੂੰ ਸੁਧਾਰ ਸਕਦੀ ਹੈ। ",
        "disadvantages": "ਕੌਫੀ ਆਦੀ ਹੋ ਸਕਦੀ ਹੈ। ",
        "method to grow": "ਕੌਫੀ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਈ ਜਾਂਦੀ ਹੈ। ",
        "how to grow": "ਕੌਫੀ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੈ। ",
        "cost of growth": "ਕੌਫੀ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਕੌਫੀ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਸਨੂੰ ਬਹੁਤ ਜ਼ਿਆਦਾ ਧੁੱਪ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਕੌਫੀ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਉਤਪਾਦਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/coffee",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "3-4 ਸਾਲ",
        "img": "/cropImg/coffe.webp",
        "name": "ਕਾਫੀ"
      },
      "cotton": {
        "definition": "ਇੱਕ ਨਰਮ, ਫੁੱਲਦਾਰ ਸਟੈਪਲ ਫਾਈਬਰ ਜੋ ਕਪਾਹ ਦੇ ਪੌਦੇ ਦੇ ਬੀਜਾਂ ਦੇ ਆਲੇ ਦੁਆਲੇ ਇੱਕ ਸੁਰੱਖਿਆ ਵਾਲੇ ਕੇਸ ਵਿੱਚ ਉੱਗਦਾ ਹੈ।",
        "advantages": "ਕਪਾਹ ਇੱਕ ਨਰਮ ਅਤੇ ਆਰਾਮਦਾਇਕ ਫੈਬਰਿਕ ਹੈ। ",
        "disadvantages": "ਕਪਾਹ ਇੱਕ ਪਾਣੀ ਦੀ ਤੀਬਰ ਫਸਲ ਹੋ ਸਕਦੀ ਹੈ। ",
        "method to grow": "ਕਪਾਹ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਈ ਜਾਂਦੀ ਹੈ। ",
        "how to grow": "ਕਪਾਹ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੁੰਦਾ ਹੈ। ",
        "cost of growth": "ਕਪਾਹ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਕਪਾਹ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਸ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਕਪਾਹ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਉਤਪਾਦਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/cotton",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "4-5 ਮਹੀਨੇ",
        "img": "/cropImg/cotton.webp",
        "name": "ਕਪਾਹ"
      },
      "groundnut": {
        "definition": "ਇਸ ਦੇ ਖਾਣ ਯੋਗ ਬੀਜਾਂ ਲਈ ਉਗਾਈ ਇੱਕ ਫਲ਼ੀ।",
        "advantages": "ਮੂੰਗਫਲੀ ਪ੍ਰੋਟੀਨ ਅਤੇ ਚਰਬੀ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹੈ। ",
        "disadvantages": "ਮੂੰਗਫਲੀ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੀ ਹੈ।",
        "method to grow": "ਮੂੰਗਫਲੀ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਈ ਜਾਂਦੀ ਹੈ। ",
        "how to grow": "ਮੂੰਗਫਲੀ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਮੂੰਗਫਲੀ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਮੂੰਗਫਲੀ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਮੂੰਗਫਲੀ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/groundnut",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "90-120 ਦਿਨ",
        "img": "/cropImg/groundnut.webp",
        "name": "ਮੂੰਗਫਲੀ"
      },
      "peas": {
        "definition": "ਇਸ ਦੇ ਖਾਣ ਯੋਗ ਬੀਜਾਂ ਲਈ ਉਗਾਈ ਇੱਕ ਫਲ਼ੀ।",
        "advantages": "ਮਟਰ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਵਿਟਾਮਿਨ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਮਟਰ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਮਟਰ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਏ ਜਾਂਦੇ ਹਨ। ",
        "how to grow": "ਮਟਰ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਏ ਜਾ ਸਕਦੇ ਹਨ, ਪਰ ਉਹ ਠੰਡੇ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਮਟਰ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਮਟਰ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਮਟਰ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/pea",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "60-70 ਦਿਨ",
        "img": "/cropImg/pea.webp",
        "name": "ਮਟਰ"
      },
      "rubber": {
        "definition": "ਇੱਕ ਕੁਦਰਤੀ ਪੌਲੀਮਰ ਜੋ ਰਬੜ ਦੇ ਰੁੱਖਾਂ ਦੇ ਰਸ ਤੋਂ ਕੱਢਿਆ ਜਾਂਦਾ ਹੈ।",
        "advantages": "ਰਬੜ ਇੱਕ ਬਹੁਮੁਖੀ ਸਮੱਗਰੀ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਉਤਪਾਦਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "disadvantages": "ਰਬੜ ਇੱਕ ਪਾਣੀ ਦੀ ਤੀਬਰ ਫਸਲ ਹੋ ਸਕਦੀ ਹੈ। ",
        "method to grow": "ਰਬੜ ਦੇ ਦਰੱਖਤ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਏ ਜਾਂਦੇ ਹਨ। ",
        "how to grow": "ਰਬੜ ਦੇ ਦਰੱਖਤ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਏ ਜਾ ਸਕਦੇ ਹਨ, ਪਰ ਉਹ ਨਿੱਘੇ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਰਬੜ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਰਬੜ ਦੇ ਰੁੱਖ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹਨ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਰਬੜ ਇੱਕ ਬਹੁਮੁਖੀ ਸਮੱਗਰੀ ਹੈ ਜੋ ਟਾਇਰਾਂ, ਹੋਜ਼ਾਂ ਅਤੇ ਦਸਤਾਨੇ ਸਮੇਤ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਉਤਪਾਦਾਂ ਵਿੱਚ ਵਰਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/rubber-tree",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "7-8 ਸਾਲ",
        "img": "/cropImg/rubber.webp",
        "name": "ਰਬੜ"
      },
      "sugarcane": {
        "definition": "ਇੱਕ ਉੱਚਾ ਘਾਹ ਜੋ ਇਸ ਦੇ ਮਿੱਠੇ ਰਸ ਲਈ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ, ਜਿਸ ਦੀ ਵਰਤੋਂ ਚੀਨੀ ਬਣਾਉਣ ਲਈ ਕੀਤੀ ਜਾਂਦੀ ਹੈ।",
        "advantages": "ਗੰਨਾ ਉਗਾਉਣ ਲਈ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ ਅਤੇ ਇਹ ਖੰਡ ਦਾ ਇੱਕ ਚੰਗਾ ਸਰੋਤ ਹੈ।",
        "disadvantages": "ਗੰਨਾ ਪਾਣੀ ਨਾਲ ਭਰਪੂਰ ਫਸਲ ਹੋ ਸਕਦੀ ਹੈ। ",
        "method to grow": "ਗੰਨਾ ਚੰਗੀ ਨਿਕਾਸੀ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ। ",
        "how to grow": "ਗੰਨਾ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੁੰਦਾ ਹੈ। ",
        "cost of growth": "ਗੰਨੇ ਦੀ ਕਾਸ਼ਤ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਗੰਨਾ ਉਗਾਉਣ ਲਈ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਸ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਗੰਨਾ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਉਤਪਾਦਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ, ਜਿਵੇਂ ਕਿ ਖੰਡ, ਗੁੜ ਅਤੇ ਈਥਾਨੌਲ। ",
        "source": "https://www.britannica.com/plant/sugarcane",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "12-18 ਮਹੀਨੇ",
        "img": "/cropImg/sugar.webp",
        "name": "ਗੰਨਾ"
      },
      "tobacco": {
        "definition": "ਇੱਕ ਪੌਦਾ ਜੋ ਇਸਦੇ ਪੱਤਿਆਂ ਲਈ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ, ਜੋ ਤੰਬਾਕੂ ਉਤਪਾਦ ਬਣਾਉਣ ਲਈ ਵਰਤੇ ਜਾਂਦੇ ਹਨ।",
        "advantages": "ਤੰਬਾਕੂ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ ਅਤੇ ਇਹ ਇੱਕ ਲਾਭਦਾਇਕ ਫਸਲ ਹੋ ਸਕਦੀ ਹੈ।",
        "disadvantages": "ਤੰਬਾਕੂ ਇੱਕ ਬਹੁਤ ਜ਼ਿਆਦਾ ਨਸ਼ਾ ਕਰਨ ਵਾਲਾ ਪਦਾਰਥ ਹੈ ਅਤੇ ਇਹ ਮੌਤ ਅਤੇ ਬਿਮਾਰੀਆਂ ਦਾ ਇੱਕ ਵੱਡਾ ਕਾਰਨ ਹੈ।",
        "method to grow": "ਤੰਬਾਕੂ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ। ",
        "how to grow": "ਤੰਬਾਕੂ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੁੰਦਾ ਹੈ। ",
        "cost of growth": "ਤੰਬਾਕੂ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਤੰਬਾਕੂ ਉਗਾਉਣ ਲਈ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਸ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਤੰਬਾਕੂ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਸਿਗਰੇਟ, ਸਿਗਾਰ ਅਤੇ ਚਬਾਉਣ ਵਾਲੇ ਤੰਬਾਕੂ ਸਮੇਤ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਉਤਪਾਦਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/tobacco",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "6-8 ਮਹੀਨੇ",
        "img": "/cropImg/tobacco.webp",
        "name": "ਤੰਬਾਕੂ"
      },
      "kidney beans": {
        "definition": "ਇਸ ਦੇ ਖਾਣ ਯੋਗ ਬੀਜਾਂ ਲਈ ਉਗਾਈ ਇੱਕ ਫਲ਼ੀ।",
        "advantages": "ਕਿਡਨੀ ਬੀਨਜ਼ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਆਇਰਨ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਕਿਡਨੀ ਬੀਨਜ਼ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੀ ਹੈ।",
        "method to grow": "ਕਿਡਨੀ ਬੀਨਜ਼ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਈਆਂ ਜਾਂਦੀਆਂ ਹਨ। ",
        "how to grow": "ਕਿਡਨੀ ਬੀਨਜ਼ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਈ ਜਾ ਸਕਦੀ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੁੰਦੀਆਂ ਹਨ। ",
        "cost of growth": "ਕਿਡਨੀ ਬੀਨ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਕਿਡਨੀ ਬੀਨਜ਼ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਕਿਡਨੀ ਬੀਨਜ਼ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/kidney-bean",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "60-70 ਦਿਨ",
        "img": "/cropImg/rajma.webp",
        "name": "ਗੁਰਦੇ ਬੀਨਜ਼"
      },
      "moth beans": {
        "definition": "ਇਸ ਦੇ ਖਾਣ ਯੋਗ ਬੀਜਾਂ ਲਈ ਉਗਾਈ ਇੱਕ ਫਲ਼ੀ।",
        "advantages": "ਮੋਥ ਬੀਨਜ਼ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਆਇਰਨ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਮੋਥ ਬੀਨਜ਼ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਮੋਥ ਬੀਨਜ਼ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਈਆਂ ਜਾਂਦੀਆਂ ਹਨ। ",
        "how to grow": "ਮੋਥ ਬੀਨਜ਼ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਨਿੱਘੇ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਕੀੜਾ ਬੀਜਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਮੋਥ ਬੀਨਜ਼ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਕੀੜਾ ਬੀਨਜ਼ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/moth-bean",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "60-70 ਦਿਨ",
        "img": "/cropImg/moth.webp",
        "name": "ਕੀੜਾ ਬੀਨਜ਼"
      },
      "coconut": {
        "definition": "ਨਾਰੀਅਲ ਪਾਮ ਦਾ ਫਲ, ਜੋ ਕਿ ਇੱਕ ਉੱਚਾ, ਪਤਲਾ ਰੁੱਖ ਹੈ।",
        "advantages": "ਨਾਰੀਅਲ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਚਰਬੀ ਸਮੇਤ ਪੋਸ਼ਕ ਤੱਤਾਂ ਦਾ ਇੱਕ ਚੰਗਾ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਨਾਰੀਅਲ ਇੱਕ ਪਾਣੀ ਦੀ ਤੀਬਰ ਫਸਲ ਹੋ ਸਕਦੀ ਹੈ। ",
        "method to grow": "ਨਾਰੀਅਲ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ। ",
        "how to grow": "ਨਾਰੀਅਲ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਉਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਨਾਰੀਅਲ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਨਾਰੀਅਲ ਪਾਮ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਨਾਰੀਅਲ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਉਤਪਾਦਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ, ਜਿਸ ਵਿੱਚ ਨਾਰੀਅਲ ਦਾ ਦੁੱਧ, ਨਾਰੀਅਲ ਦਾ ਤੇਲ ਅਤੇ ਨਾਰੀਅਲ ਪਾਣੀ ਸ਼ਾਮਲ ਹੈ। ",
        "source": "https://www.britannica.com/plant/coconut-palm",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "5-7 ਸਾਲ",
        "img": "/cropImg/coconut.webp",
        "name": "ਨਾਰੀਅਲ"
      },
      "black gram": {
        "definition": "ਇਸ ਦੇ ਖਾਣ ਯੋਗ ਬੀਜਾਂ ਲਈ ਉਗਾਈ ਇੱਕ ਫਲ਼ੀ।",
        "advantages": "ਕਾਲੇ ਚਨੇ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਆਇਰਨ ਦਾ ਚੰਗਾ ਸਰੋਤ ਹੈ। ",
        "disadvantages": "ਕਾਲੇ ਚਨੇ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਕਾਲੇ ਛੋਲੇ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਏ ਜਾਂਦੇ ਹਨ। ",
        "how to grow": "ਕਾਲੇ ਛੋਲਿਆਂ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਹੁੰਦਾ ਹੈ। ",
        "cost of growth": "ਕਾਲੇ ਛੋਲੇ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਕਾਲੇ ਛੋਲੇ ਉਗਾਉਣ ਲਈ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਇਸ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਕਾਲੇ ਛੋਲੇ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/black-gram",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "60-70 ਦਿਨ",
        "img": "/cropImg/blackgram.webp",
        "name": "ਕਾਲਾ ਗ੍ਰਾਮ"
      },
      "adzuki beans": {
        "definition": "ਇਸ ਦੇ ਖਾਣ ਯੋਗ ਬੀਜਾਂ ਲਈ ਉਗਾਈ ਇੱਕ ਫਲ਼ੀ।",
        "advantages": "ਅਡਜ਼ੂਕੀ ਬੀਨਜ਼ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਆਇਰਨ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਅਡਜ਼ੂਕੀ ਬੀਨਜ਼ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਅਡਜ਼ੂਕੀ ਬੀਨਜ਼ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਈਆਂ ਜਾਂਦੀਆਂ ਹਨ। ",
        "how to grow": "ਅਡਜ਼ੂਕੀ ਬੀਨਜ਼ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਉਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਅਡਜ਼ੂਕੀ ਬੀਨਜ਼ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਅਡਜ਼ੂਕੀ ਬੀਨਜ਼ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਅਡਜ਼ੂਕੀ ਬੀਨਜ਼ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/adzuki-bean",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "60-70 ਦਿਨ",
        "img": "/cropImg/adjzukibeans.webp",
        "name": "adzuki ਬੀਨਜ਼"
      },
      "pigeon pea": {
        "definition": "ਇਸ ਦੇ ਖਾਣ ਯੋਗ ਬੀਜਾਂ ਲਈ ਉਗਾਈ ਇੱਕ ਫਲ਼ੀ।",
        "advantages": "ਕਬੂਤਰ ਦੇ ਮਟਰ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਆਇਰਨ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਕਬੂਤਰ ਦੇ ਮਟਰ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਕਬੂਤਰ ਦੇ ਮਟਰ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਏ ਜਾਂਦੇ ਹਨ। ",
        "how to grow": "ਕਬੂਤਰ ਮਟਰ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਏ ਜਾ ਸਕਦੇ ਹਨ, ਪਰ ਉਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਕਬੂਤਰ ਮਟਰ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਕਬੂਤਰ ਮਟਰ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਕਬੂਤਰ ਮਟਰ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/pigeon-pea",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "90-120 ਦਿਨ",
        "img": "/cropImg/pigeonpea.webp",
        "name": "ਕਬੂਤਰ ਮਟਰ"
      },
      "chickpea": {
        "definition": "ਇਸ ਦੇ ਖਾਣ ਯੋਗ ਬੀਜਾਂ ਲਈ ਉਗਾਈ ਇੱਕ ਫਲ਼ੀ।",
        "advantages": "ਛੋਲੇ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਆਇਰਨ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਛੋਲੇ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਛੋਲਿਆਂ ਦੀ ਕਾਸ਼ਤ ਚੰਗੀ ਨਿਕਾਸ ਵਾਲੀ ਮਿੱਟੀ ਵਿੱਚ ਕੀਤੀ ਜਾਂਦੀ ਹੈ। ",
        "how to grow": "ਛੋਲਿਆਂ ਨੂੰ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਉਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਛੋਲਿਆਂ ਦੀ ਕਾਸ਼ਤ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਛੋਲੇ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਛੋਲੇ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/chickpea",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "60-70 ਦਿਨ",
        "img": "/cropImg/chana.webp",
        "name": "ਛੋਲੇ"
      },
      "banana": {
        "definition": "ਇੱਕ ਖਾਣ ਯੋਗ ਫਲ - ਬੋਟੈਨੀਕਲ ਤੌਰ 'ਤੇ ਇੱਕ ਬੇਰੀ - ਮੂਸਾ ਜੀਨਸ ਵਿੱਚ ਕਈ ਕਿਸਮਾਂ ਦੇ ਵੱਡੇ ਜੜੀ ਬੂਟੀਆਂ ਦੇ ਫੁੱਲਾਂ ਵਾਲੇ ਪੌਦਿਆਂ ਦੁਆਰਾ ਪੈਦਾ ਕੀਤਾ ਜਾਂਦਾ ਹੈ। ",
        "advantages": "ਕੇਲਾ ਪੋਟਾਸ਼ੀਅਮ, ਵਿਟਾਮਿਨ ਸੀ ਅਤੇ ਫਾਈਬਰ ਦਾ ਚੰਗਾ ਸਰੋਤ ਹੈ। ",
        "disadvantages": "ਕੇਲੇ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਕੇਲੇ ਨੂੰ ਗਰਮ ਖੰਡੀ ਅਤੇ ਉਪ-ਉਪਖੰਡੀ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ। ",
        "how to grow": "ਕੇਲੇ ਨੂੰ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਉਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਕੇਲੇ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਕੇਲੇ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਸਾਰੇ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਕੇਲੇ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/banana",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "12-18 ਮਹੀਨੇ",
        "img": "/cropImg/banana.webp",
        "name": "ਕੇਲਾ"
      },
      "grapes": {
        "definition": "ਬੇਰੀ ਦੀ ਇੱਕ ਕਿਸਮ ਜੋ ਆਮ ਤੌਰ 'ਤੇ ਮਿੱਠੀ ਅਤੇ ਬੀਜ ਰਹਿਤ ਹੁੰਦੀ ਹੈ। ",
        "advantages": "ਅੰਗੂਰ ਐਂਟੀਆਕਸੀਡੈਂਟ, ਪੋਟਾਸ਼ੀਅਮ, ਅਤੇ ਵਿਟਾਮਿਨ ਕੇ ਦਾ ਇੱਕ ਚੰਗਾ ਸਰੋਤ ਹਨ। ਇਹ ਖਰੀਦਣ ਲਈ ਵੀ ਮੁਕਾਬਲਤਨ ਸਸਤੇ ਹਨ।",
        "disadvantages": "ਅੰਗੂਰ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਅੰਗੂਰ ਸਮਸ਼ੀਨ ਅਤੇ ਉਪ-ਉਪਖੰਡੀ ਮੌਸਮ ਵਿੱਚ ਉਗਾਏ ਜਾਂਦੇ ਹਨ। ",
        "how to grow": "ਅੰਗੂਰ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਏ ਜਾ ਸਕਦੇ ਹਨ, ਪਰ ਇਹ ਗਰਮ, ਸੁੱਕੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਅੰਗੂਰ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਅੰਗੂਰ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹੈ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਜ਼ਿਆਦਾ ਧੁੱਪ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਅੰਗੂਰ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/grape",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "90-120 ਦਿਨ",
        "img": "/cropImg/grapes.webp",
        "name": "ਅੰਗੂਰ"
      },
      "apple": {
        "definition": "ਸੇਬ ਦੇ ਦਰੱਖਤ ਦੁਆਰਾ ਪੈਦਾ ਕੀਤਾ ਗਿਆ ਇੱਕ ਪੋਮੇਸੀਸ ਫਲ। ",
        "advantages": "ਸੇਬ ਫਾਈਬਰ, ਵਿਟਾਮਿਨ ਸੀ ਅਤੇ ਪੋਟਾਸ਼ੀਅਮ ਦਾ ਚੰਗਾ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਸੇਬ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਸੇਬ ਸ਼ਾਂਤ ਮੌਸਮ ਵਿੱਚ ਉਗਾਏ ਜਾਂਦੇ ਹਨ। ",
        "how to grow": "ਸੇਬ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਉਹ ਠੰਡੇ, ਸੁੱਕੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਵਧ ਰਹੀ ਸੇਬ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਸੇਬ ਦੇ ਰੁੱਖ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹਨ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਜ਼ਿਆਦਾ ਧੁੱਪ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਸੇਬ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/apple",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "1-3 ਸਾਲ",
        "img": "/cropImg/apple.webp",
        "name": "ਸੇਬ"
      },
      "mango": {
        "definition": "ਇੱਕ ਗਰਮ ਖੰਡੀ ਫਲ ਜੋ ਦੱਖਣੀ ਏਸ਼ੀਆ ਦਾ ਮੂਲ ਹੈ। ",
        "advantages": "ਅੰਬ ਵਿਟਾਮਿਨ ਸੀ, ਪੋਟਾਸ਼ੀਅਮ ਅਤੇ ਫਾਈਬਰ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਅੰਬ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਅੰਬਾਂ ਨੂੰ ਗਰਮ ਖੰਡੀ ਅਤੇ ਉਪ-ਉਪਖੰਡੀ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ। ",
        "how to grow": "ਅੰਬਾਂ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕੰਮ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਅੰਬ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਅੰਬ ਦੇ ਰੁੱਖ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹਨ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਜ਼ਿਆਦਾ ਧੁੱਪ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਅੰਬ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/mango",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "3-5 ਸਾਲ",
        "img": "/cropImg/mango.webp",
        "name": "ਆਮ"
      },
      "muskmelon": {
        "definition": "ਤਰਬੂਜ ਦੀ ਇੱਕ ਕਿਸਮ ਜੋ ਆਮ ਤੌਰ 'ਤੇ ਗੋਲ ਜਾਂ ਅੰਡਾਕਾਰ ਆਕਾਰ ਦੀ ਹੁੰਦੀ ਹੈ ਅਤੇ ਇਸਦਾ ਮਿੱਠਾ, ਸੰਤਰੀ ਮਾਸ ਹੁੰਦਾ ਹੈ। ",
        "advantages": "ਖਰਬੂਜੇ ਵਿਟਾਮਿਨ ਏ, ਪੋਟਾਸ਼ੀਅਮ ਅਤੇ ਫਾਈਬਰ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਖਰਬੂਜੇ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਕਸਤੂਰੀ ਸ਼ਮਸ਼ੀਰ ਅਤੇ ਉਪ-ਉਪਖੰਡੀ ਮੌਸਮ ਵਿੱਚ ਉਗਾਈ ਜਾਂਦੀ ਹੈ। ",
        "how to grow": "ਕਸਤੂਰੀ ਨੂੰ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਉਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਖਰਬੂਜੇ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਕਸਤੂਰੀ ਦੇ ਪੌਦੇ ਉਗਾਉਣ ਲਈ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹਨ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਜ਼ਿਆਦਾ ਧੁੱਪ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "Muskmelons ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜੋ ਕਿ ਵੱਖ-ਵੱਖ ਪਕਵਾਨਾਂ ਵਿੱਚ ਵਰਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/muskmelon",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "3-5 ਮਹੀਨੇ",
        "img": "/cropImg/muskmelon.webp",
        "name": "muskemelon"
      },
      "orange": {
        "definition": "ਇੱਕ ਨਿੰਬੂ ਫਲ ਜੋ ਦੱਖਣ-ਪੂਰਬੀ ਏਸ਼ੀਆ ਦਾ ਮੂਲ ਹੈ। ",
        "advantages": "ਸੰਤਰੇ ਵਿਟਾਮਿਨ ਸੀ, ਪੋਟਾਸ਼ੀਅਮ ਅਤੇ ਫਾਈਬਰ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਸੰਤਰੇ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਸੰਤਰੇ ਸ਼ਾਂਤ ਅਤੇ ਉਪ-ਉਪਖੰਡੀ ਮੌਸਮ ਵਿੱਚ ਉਗਦੇ ਹਨ। ",
        "how to grow": "ਸੰਤਰੇ ਨੂੰ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ, ਸੁੱਕੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਸੰਤਰੇ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਸੰਤਰੇ ਦੇ ਰੁੱਖ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹਨ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਜ਼ਿਆਦਾ ਧੁੱਪ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਸੰਤਰੇ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/orange",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "4-6 ਸਾਲ",
        "img": "/cropImg/orange.webp",
        "name": "ਸੰਤਰਾ"
      },
      "papaya": {
        "definition": "ਇੱਕ ਗਰਮ ਖੰਡੀ ਫਲ ਜੋ ਮੱਧ ਅਮਰੀਕਾ ਦਾ ਮੂਲ ਹੈ। ",
        "advantages": "ਪਪੀਤਾ ਵਿਟਾਮਿਨ ਸੀ, ਪੋਟਾਸ਼ੀਅਮ ਅਤੇ ਫਾਈਬਰ ਦਾ ਚੰਗਾ ਸਰੋਤ ਹੈ। ",
        "disadvantages": "ਪਪੀਤਾ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦਾ ਹੈ।",
        "method to grow": "ਪਪੀਤਾ ਗਰਮ ਖੰਡੀ ਅਤੇ ਉਪ-ਉਪਖੰਡੀ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ। ",
        "how to grow": "ਪਪੀਤੇ ਨੂੰ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਉਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਪਪੀਤੇ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਪਪੀਤੇ ਦੇ ਰੁੱਖ ਉਗਾਉਣ ਲਈ ਇੱਕ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਫਸਲ ਹਨ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਜ਼ਿਆਦਾ ਧੁੱਪ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਪਪੀਤਾ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/papaya",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "3-5 ਸਾਲ",
        "img": "/cropImg/papaya.webp",
        "name": "ਪਪੀਤਾ"
      },
      "pomegranate": {
        "definition": "ਇੱਕ ਫਲ ਜੋ ਇਰਾਨ ਦਾ ਮੂਲ ਹੈ। ",
        "advantages": "ਅਨਾਰ ਵਿਟਾਮਿਨ ਸੀ, ਪੋਟਾਸ਼ੀਅਮ ਅਤੇ ਫਾਈਬਰ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਅਨਾਰ ਬੀਜਣਾ ਔਖਾ ਹੋ ਸਕਦਾ ਹੈ।",
        "method to grow": "ਅਨਾਰ ਸਮਸ਼ੀਨ ਅਤੇ ਉਪ-ਉਪਖੰਡੀ ਮੌਸਮ ਵਿੱਚ ਉਗਾਏ ਜਾਂਦੇ ਹਨ। ",
        "how to grow": "ਅਨਾਰ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਏ ਜਾ ਸਕਦੇ ਹਨ, ਪਰ ਇਹ ਗਰਮ, ਸੁੱਕੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਅਨਾਰ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਅਨਾਰ ਦੇ ਦਰੱਖਤ ਵਧਣ ਲਈ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਹੁੰਦੇ ਹਨ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਜ਼ਿਆਦਾ ਧੁੱਪ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਅਨਾਰ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/pomegranate",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "6-8 ਸਾਲ",
        "img": "/cropImg/pomogranate.webp",
        "name": "ਅਨਾਰ"
      },
      "watermelon": {
        "definition": "ਤਰਬੂਜ ਦੀ ਇੱਕ ਕਿਸਮ ਜੋ ਆਮ ਤੌਰ 'ਤੇ ਗੋਲ ਜਾਂ ਅੰਡਾਕਾਰ ਆਕਾਰ ਵਿੱਚ ਹੁੰਦੀ ਹੈ ਅਤੇ ਇਸਦਾ ਮਿੱਠਾ, ਲਾਲ ਮਾਸ ਹੁੰਦਾ ਹੈ। ",
        "advantages": "ਤਰਬੂਜ ਵਿਟਾਮਿਨ ਏ, ਪੋਟਾਸ਼ੀਅਮ ਅਤੇ ਫਾਈਬਰ ਦਾ ਵਧੀਆ ਸਰੋਤ ਹਨ। ",
        "disadvantages": "ਤਰਬੂਜ ਕੀੜਿਆਂ ਅਤੇ ਬਿਮਾਰੀਆਂ ਲਈ ਸੰਵੇਦਨਸ਼ੀਲ ਹੋ ਸਕਦੇ ਹਨ।",
        "method to grow": "ਤਰਬੂਜ ਸਮਸ਼ੀਨ ਅਤੇ ਉਪ-ਉਪਖੰਡੀ ਮੌਸਮ ਵਿੱਚ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ। ",
        "how to grow": "ਤਰਬੂਜ ਵੱਖ-ਵੱਖ ਮੌਸਮਾਂ ਵਿੱਚ ਉਗਾਏ ਜਾ ਸਕਦੇ ਹਨ, ਪਰ ਉਹ ਗਰਮ, ਨਮੀ ਵਾਲੇ ਮੌਸਮ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਕਰਦੇ ਹਨ। ",
        "cost of growth": "ਤਰਬੂਜ ਉਗਾਉਣ ਦੀ ਲਾਗਤ ਸਥਾਨ ਅਤੇ ਕਾਸ਼ਤ ਦੇ ਢੰਗ 'ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। ",
        "difficulty": "ਤਰਬੂਜ ਦੇ ਪੌਦੇ ਉਗਾਉਣ ਲਈ ਮੁਕਾਬਲਤਨ ਆਸਾਨ ਹੁੰਦੇ ਹਨ, ਪਰ ਉਹਨਾਂ ਨੂੰ ਬਹੁਤ ਜ਼ਿਆਦਾ ਧੁੱਪ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ। ",
        "other details": "ਤਰਬੂਜ ਇੱਕ ਬਹੁਪੱਖੀ ਫਸਲ ਹੈ ਜਿਸਦੀ ਵਰਤੋਂ ਕਈ ਤਰ੍ਹਾਂ ਦੇ ਪਕਵਾਨਾਂ ਵਿੱਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ। ",
        "source": "https://www.britannica.com/plant/watermelon",
        "equipment": "ਬੇਲਚਾ, ਰੇਕ, ਵਾਟਰਿੰਗ ਕੈਨ, ਬੀਜ, ਖਾਦ",
        "time duration": "3-4 ਮਹੀਨੇ",
        "img": "/cropImg/water melon.webp",
        "name": "ਤਰਬੂਜ"
      }
    }
  }