{
    "cropData": {
      "rice": {
        "definition": "तृणधान्य म्हणून लागवड केलेले गवत.",
        "advantages": "जगाच्या अर्ध्याहून अधिक लोकसंख्येसाठी मुख्य अन्न. ",
        "disadvantages": "तांदूळ हे पाणी जास्त लागणारे पीक आहे. ",
        "method to grow": "तुडुंब भरलेल्या शेतात भात पिकवला जातो. ",
        "how to grow": "तांदूळ विविध हवामानात घेतले जाऊ शकते, परंतु ते उष्ण, दमट हवामानात चांगले होते. ",
        "cost of growth": "भात पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "तांदूळ हे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्याला भरपूर पाणी लागते. ",
        "other details": "तांदूळ हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/rice",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "6-8 महिने",
        "img": "/cropImg/paddy.webp",
        "name": "तांदूळ"
      },
      "wheat": {
        "definition": "तृणधान्य म्हणून लागवड केलेले गवत.",
        "advantages": "जगातील एक तृतीयांश लोकसंख्येसाठी मुख्य अन्न. ",
        "disadvantages": "गहू हे पाणी जास्त लागणारे पीक आहे. ",
        "method to grow": "कोरड्या शेतात गहू पिकवला जातो. ",
        "how to grow": "गव्हाचे पीक विविध हवामानात घेतले जाऊ शकते, परंतु ते थंड, समशीतोष्ण हवामानात चांगले होते. ",
        "cost of growth": "गहू पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "गहू हे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्याला भरपूर पाणी लागते. ",
        "other details": "गहू हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/wheat",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "7-8 महिने",
        "img": "/cropImg/wheat.webp",
        "name": "गहू"
      },
      "mung bean": {
        "definition": "त्याच्या खाण्यायोग्य बियांसाठी उगवलेला शेंगा.",
        "advantages": "मूग हे प्रथिने, फायबर आणि जीवनसत्त्वे यांचा चांगला स्रोत आहे. ",
        "disadvantages": "मूग हे कीड आणि रोगांना बळी पडू शकतात.",
        "method to grow": "मुगाचे पीक चांगल्या निचऱ्याच्या जमिनीत घेतले जाते. ",
        "how to grow": "मूग विविध हवामानात पिकवता येते, परंतु ते उष्ण, दमट हवामानात चांगले करतात. ",
        "cost of growth": "मूग पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "मूग हे तुलनेने वाढण्यास सोपे पीक आहे, परंतु त्यांना भरपूर पाणी लागते. ",
        "other details": "मूग हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/mung-bean",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "60-70 दिवस",
        "img": "/cropImg/mong.webp",
        "name": "मूग"
      },
      "tea": {
        "definition": "कॅमेलिया सायनेन्सिस वनस्पतीच्या पानांपासून तयार केलेले एक सुगंधी पेय.",
        "advantages": "चहा हा अँटिऑक्सिडंट्सचा चांगला स्रोत आहे आणि त्याचे अनेक आरोग्य फायदे असल्याचे दिसून आले आहे. ",
        "disadvantages": "चहा कीटक आणि रोगांना बळी पडू शकतो.",
        "method to grow": "चहाचा चांगला निचरा होणाऱ्या जमिनीत पीक घेतले जाते. ",
        "how to grow": "चहा वेगवेगळ्या हवामानात पिकवता येतो, पण तो उष्ण, दमट हवामानात चांगला होतो. ",
        "cost of growth": "चहा पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "चहा हे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्याला भरपूर पाणी लागते. ",
        "other details": "चहा हे एक बहुमुखी पीक आहे ज्याचा वापर विविध पदार्थांमध्ये केला जाऊ शकतो. ",
        "source": "https://www.britannica.com/plant/tea",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "3-4 वर्षे",
        "img": "/cropImg/tea.webp",
        "name": "चहा"
      },
      "millet": {
        "definition": "त्याच्या खाण्यायोग्य बियांसाठी लागवड केलेले गवत.",
        "advantages": "बाजरी कार्बोहायड्रेट्स, प्रोटीन आणि फायबरचा चांगला स्रोत आहे. ",
        "disadvantages": "बाजरी कीटक आणि रोगांना बळी पडू शकते.",
        "method to grow": "बाजरी चांगल्या निचऱ्याच्या जमिनीत घेतली जाते. ",
        "how to grow": "बाजरीचे पीक विविध हवामानात घेतले जाऊ शकते, परंतु ते उबदार, कोरड्या हवामानात चांगले होते. ",
        "cost of growth": "बाजरी पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "बाजरी हे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्याला भरपूर सूर्यप्रकाश लागतो. ",
        "other details": "बाजरी हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/millet",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "60-70 दिवस",
        "img": "/cropImg/millet.webp",
        "name": "बाजरी"
      },
      "maize": {
        "definition": "तृणधान्य धान्य जे जगातील सर्वात मोठ्या प्रमाणावर पिकवले जाणारे धान्य पीक आहे.",
        "advantages": "मका हा कार्बोहायड्रेट, प्रथिने आणि फायबरचा चांगला स्रोत आहे. ",
        "disadvantages": "मका कीड आणि रोगांना बळी पडू शकतो.",
        "method to grow": "मका पाण्याचा चांगला निचरा होणाऱ्या जमिनीत होतो. ",
        "how to grow": "मका हे विविध हवामानात घेतले जाऊ शकते, परंतु ते उष्ण, दमट हवामानात चांगले होते. ",
        "cost of growth": "मका पिकवण्याचा खर्च ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलतो. ",
        "difficulty": "मका हे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्याला भरपूर पाणी लागते. ",
        "other details": "मका हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/maize",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "90-120 दिवस",
        "img": "/cropImg/maize.webp",
        "name": "मका"
      },
      "lentil": {
        "definition": "त्याच्या खाण्यायोग्य बियांसाठी उगवलेला शेंगा.",
        "advantages": "मसूर ही प्रथिने, फायबर आणि लोहाचा चांगला स्रोत आहे. ",
        "disadvantages": "मसूर कीटक आणि रोगांना बळी पडू शकतात.",
        "method to grow": "मसूर चांगल्या निचऱ्याच्या जमिनीत पिकतात. ",
        "how to grow": "मसूर वेगवेगळ्या हवामानात पिकवता येतात, परंतु ते थंड, ओलसर हवामानात चांगले करतात. ",
        "cost of growth": "मसूर पिकण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "मसूर हे तुलनेने वाढण्यास सोपे पीक आहे, परंतु त्यांना भरपूर पाणी लागते. ",
        "other details": "मसूर हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/lentil",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "60-70 दिवस",
        "img": "/cropImg/litne.webp",
        "name": "मसूर"
      },
      "jute": {
        "definition": "फायबरसाठी लागवड केलेली वनस्पती.",
        "advantages": "ताग एक मजबूत आणि टिकाऊ फायबर आहे. ",
        "disadvantages": "ताग हे पाणी जास्त लागणारे पीक आहे. ",
        "method to grow": "ताग चांगला निचरा होणाऱ्या जमिनीत पिकवला जातो. ",
        "how to grow": "जूट विविध हवामानात घेतले जाऊ शकते, परंतु ते उबदार, दमट हवामानात चांगले होते. ",
        "cost of growth": "ताग पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "ताग हे तुलनेने वाढण्यास सोपे पीक आहे, परंतु त्याला भरपूर पाणी लागते. ",
        "other details": "ताग हे एक बहुमुखी पीक आहे जे विविध उत्पादनांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/jute",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "120-150 दिवस",
        "img": "/cropImg/jute.webp",
        "name": "ज्यूट"
      },
      "coffee": {
        "definition": "बीन्ससाठी लागवड केलेले झुडूप किंवा लहान झाड, जे कॉफी तयार करण्यासाठी भाजलेले आणि ग्राउंड केले जाते.",
        "advantages": "कॉफी हे एक उत्तेजक आहे जे सतर्कता आणि संज्ञानात्मक कार्य सुधारू शकते. ",
        "disadvantages": "कॉफी व्यसनाधीन असू शकते. ",
        "method to grow": "उत्तम निचरा होणाऱ्या जमिनीत कॉफीची लागवड केली जाते. ",
        "how to grow": "कॉफी विविध हवामानात पिकवता येते, परंतु ती उबदार, दमट हवामानात उत्तम प्रकारे पिकते. ",
        "cost of growth": "कॉफी पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "कॉफी हे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्याला भरपूर सूर्यप्रकाश लागतो. ",
        "other details": "कॉफी हे एक अष्टपैलू पीक आहे जे विविध उत्पादनांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/coffee",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "3-4 वर्षे",
        "img": "/cropImg/coffe.webp",
        "name": "कॉफी"
      },
      "cotton": {
        "definition": "एक मऊ, मऊ स्टेपल फायबर जो कापूस रोपाच्या बियाभोवती संरक्षणात्मक केसमध्ये वाढतो.",
        "advantages": "कापूस एक मऊ आणि आरामदायक फॅब्रिक आहे. ",
        "disadvantages": "कापूस हे पाणी-केंद्रित पीक असू शकते. ",
        "method to grow": "चांगल्या निचऱ्याच्या जमिनीत कापूस पिकवला जातो. ",
        "how to grow": "विविध हवामानात कापूस पिकवता येतो, पण ते उष्ण, दमट हवामानात उत्तम प्रकारे पिकवते. ",
        "cost of growth": "कापूस पिकवण्याचा खर्च ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलतो. ",
        "difficulty": "कापूस हे तुलनेने वाढण्यास सोपे पीक आहे, परंतु त्याला भरपूर पाणी लागते. ",
        "other details": "कापूस हे एक बहुमुखी पीक आहे ज्याचा वापर विविध उत्पादनांमध्ये केला जाऊ शकतो. ",
        "source": "https://www.britannica.com/plant/cotton",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "4-5 महिने",
        "img": "/cropImg/cotton.webp",
        "name": "कापूस"
      },
      "groundnut": {
        "definition": "त्याच्या खाण्यायोग्य बियांसाठी उगवलेला शेंगा.",
        "advantages": "शेंगदाणे प्रथिने आणि चरबीचा चांगला स्रोत आहे. ",
        "disadvantages": "भुईमूग हे कीड आणि रोगांना बळी पडू शकतात.",
        "method to grow": "भुईमुगाचा चांगला निचरा होणाऱ्या जमिनीत पीक घेतले जाते. ",
        "how to grow": "शेंगदाणे विविध हवामानात घेतले जाऊ शकतात, परंतु ते उबदार, दमट हवामानात चांगले करतात. ",
        "cost of growth": "शेंगदाणे पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "भुईमूग हे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्यांना भरपूर पाणी लागते. ",
        "other details": "शेंगदाणे हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/groundnut",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "90-120 दिवस",
        "img": "/cropImg/groundnut.webp",
        "name": "भुईमूग"
      },
      "peas": {
        "definition": "त्याच्या खाण्यायोग्य बियांसाठी उगवलेला शेंगा.",
        "advantages": "मटार हे प्रथिने, फायबर आणि जीवनसत्त्वे यांचा चांगला स्रोत आहे. ",
        "disadvantages": "मटार कीटक आणि रोगांना बळी पडू शकतात.",
        "method to grow": "मटार चांगल्या निचऱ्याच्या जमिनीत पिकतात. ",
        "how to grow": "मटार विविध हवामानात घेतले जाऊ शकतात, परंतु ते थंड, ओलसर हवामानात चांगले करतात. ",
        "cost of growth": "मटार पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "मटार हे तुलनेने वाढण्यास सोपे पीक आहे, परंतु त्यांना भरपूर पाणी लागते. ",
        "other details": "मटार हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/pea",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "60-70 दिवस",
        "img": "/cropImg/pea.webp",
        "name": "वाटाणे"
      },
      "rubber": {
        "definition": "एक नैसर्गिक पॉलिमर जो रबराच्या झाडांच्या रसातून काढला जातो.",
        "advantages": "रबर ही एक बहुमुखी सामग्री आहे जी विविध उत्पादनांमध्ये वापरली जाऊ शकते. ",
        "disadvantages": "रबर हे पाणी-केंद्रित पीक असू शकते. ",
        "method to grow": "रबराची झाडे पाण्याचा निचरा होणाऱ्या जमिनीत वाढतात. ",
        "how to grow": "रबराची झाडे विविध हवामानात उगवता येतात, परंतु ते उष्ण, दमट हवामानात चांगले करतात. ",
        "cost of growth": "रबर पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "रबराची झाडे वाढण्यास तुलनेने सोपे पीक आहेत, परंतु त्यांना भरपूर पाणी लागते. ",
        "other details": "रबर ही एक बहुमुखी सामग्री आहे जी टायर, होसेस आणि हातमोजे यासह विविध उत्पादनांमध्ये वापरली जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/rubber-tree",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "7-8 वर्षे",
        "img": "/cropImg/rubber.webp",
        "name": "रबर"
      },
      "sugarcane": {
        "definition": "गोड रसासाठी उगवलेले एक उंच गवत, ज्याचा उपयोग साखर तयार करण्यासाठी केला जातो.",
        "advantages": "ऊस हे वाढण्यास तुलनेने सोपे पीक आहे आणि ते साखरेचा चांगला स्रोत आहे.",
        "disadvantages": "ऊस हे पाणी-केंद्रित पीक असू शकते. ",
        "method to grow": "चांगला निचरा होणाऱ्या जमिनीत ऊसाची लागवड केली जाते. ",
        "how to grow": "ऊस विविध हवामानात पिकवता येतो, परंतु तो उष्ण, दमट हवामानात चांगला होतो. ",
        "cost of growth": "ऊस पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "ऊस हे तुलनेने वाढण्यास सोपे पीक आहे, परंतु त्याला भरपूर पाणी लागते. ",
        "other details": "ऊस हे एक बहुमुखी पीक आहे ज्याचा वापर साखर, मोलॅसिस आणि इथेनॉलसह विविध उत्पादनांमध्ये केला जाऊ शकतो. ",
        "source": "https://www.britannica.com/plant/sugarcane",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "12-18 महिने",
        "img": "/cropImg/sugar.webp",
        "name": "ऊस"
      },
      "tobacco": {
        "definition": "एक वनस्पती जी तिच्या पानांसाठी उगवली जाते, जी तंबाखू उत्पादने बनवण्यासाठी वापरली जाते.",
        "advantages": "तंबाखू हे वाढण्यास तुलनेने सोपे पीक आहे आणि ते फायदेशीर पीक असू शकते.",
        "disadvantages": "तंबाखू हा एक अत्यंत व्यसन करणारा पदार्थ आहे आणि तो मृत्यू आणि रोगाचे प्रमुख कारण आहे.",
        "method to grow": "तंबाखूची लागवड चांगल्या निचऱ्याच्या जमिनीत केली जाते. ",
        "how to grow": "तंबाखूची लागवड विविध हवामानात केली जाऊ शकते, परंतु उष्ण, दमट हवामानात ते उत्तम प्रकारे पिकते. ",
        "cost of growth": "तंबाखू पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "तंबाखू हे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्याला भरपूर पाणी लागते. ",
        "other details": "तंबाखू हे एक बहुमुखी पीक आहे ज्याचा वापर सिगारेट, सिगार आणि तंबाखू चघळणे यासह विविध उत्पादनांमध्ये केला जाऊ शकतो. ",
        "source": "https://www.britannica.com/plant/tobacco",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "6-8 महिने",
        "img": "/cropImg/tobacco.webp",
        "name": "तंबाखू"
      },
      "kidney beans": {
        "definition": "त्याच्या खाण्यायोग्य बियांसाठी उगवलेला शेंगा.",
        "advantages": "किडनी बीन्स प्रथिने, फायबर आणि लोहाचा चांगला स्रोत आहे. ",
        "disadvantages": "किडनी बीन्स कीटक आणि रोगांना बळी पडू शकतात.",
        "method to grow": "किडनी बीन्स चांगल्या निचऱ्याच्या जमिनीत पिकतात. ",
        "how to grow": "किडनी बीन्स विविध हवामानात घेतले जाऊ शकतात, परंतु ते उबदार, दमट हवामानात चांगले करतात. ",
        "cost of growth": "राजमा पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "किडनी बीन्स हे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्यांना भरपूर पाणी लागते. ",
        "other details": "राजमा हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/kidney-bean",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "60-70 दिवस",
        "img": "/cropImg/rajma.webp",
        "name": "राजमा"
      },
      "moth beans": {
        "definition": "त्याच्या खाण्यायोग्य बियांसाठी उगवलेला शेंगा.",
        "advantages": "मॉथ बीन्स प्रथिने, फायबर आणि लोहाचा चांगला स्रोत आहे. ",
        "disadvantages": "मॉथ बीन्स कीटक आणि रोगांसाठी अतिसंवेदनशील असू शकतात.",
        "method to grow": "मॉथ बीन्स चांगला निचरा होणाऱ्या जमिनीत पिकतात. ",
        "how to grow": "मॉथ बीन्स विविध हवामानात पिकवता येतात, परंतु ते उबदार, दमट हवामानात चांगले करतात. ",
        "cost of growth": "मोथ बीन्स पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "मॉथ बीन्स हे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्यांना भरपूर पाणी लागते. ",
        "other details": "मॉथ बीन्स हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/moth-bean",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "60-70 दिवस",
        "img": "/cropImg/moth.webp",
        "name": "पतंग बीन्स"
      },
      "coconut": {
        "definition": "नारळ पामचे फळ, जे एक उंच, सडपातळ झाड आहे.",
        "advantages": "नारळ हे प्रथिने, फायबर आणि चरबीसह पोषक तत्वांचा चांगला स्रोत आहे. ",
        "disadvantages": "नारळ हे पाणी-केंद्रित पीक असू शकते. ",
        "method to grow": "उत्तम निचरा होणाऱ्या जमिनीत नारळाची लागवड केली जाते. ",
        "how to grow": "नारळाची लागवड विविध हवामानात केली जाऊ शकते, परंतु ते उबदार, दमट हवामानात चांगले करतात. ",
        "cost of growth": "नारळ पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "नारळाचे तळवे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्यांना भरपूर पाणी लागते. ",
        "other details": "नारळ हे एक बहुमुखी पीक आहे जे नारळाचे दूध, नारळ तेल आणि नारळाच्या पाण्यासह विविध उत्पादनांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/coconut-palm",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "5-7 वर्षे",
        "img": "/cropImg/coconut.webp",
        "name": "नारळ"
      },
      "black gram": {
        "definition": "त्याच्या खाण्यायोग्य बियांसाठी उगवलेला शेंगा.",
        "advantages": "काळा हरभरा प्रथिने, फायबर आणि लोहाचा चांगला स्रोत आहे. ",
        "disadvantages": "काळे हरभरे कीड आणि रोगांना बळी पडू शकतात.",
        "method to grow": "काळा हरभरा चांगला निचरा होणाऱ्या जमिनीत पिकतो. ",
        "how to grow": "काळे हरभरे विविध हवामानात घेतले जाऊ शकतात, परंतु ते उष्ण, दमट हवामानात चांगले करतात. ",
        "cost of growth": "काळा हरभरा पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "काळा हरभरा हे तुलनेने वाढण्यास सोपे पीक आहे, परंतु त्याला भरपूर पाणी लागते. ",
        "other details": "काळा हरभरा हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/black-gram",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "60-70 दिवस",
        "img": "/cropImg/blackgram.webp",
        "name": "काळा हरभरा"
      },
      "adzuki beans": {
        "definition": "त्याच्या खाण्यायोग्य बियांसाठी उगवलेला शेंगा.",
        "advantages": "Adzuki सोयाबीनचे प्रथिने, फायबर आणि लोहाचा चांगला स्रोत आहे. ",
        "disadvantages": "Adzuki सोयाबीनचे कीटक आणि रोग संवेदनाक्षम असू शकते.",
        "method to grow": "Adzuki सोयाबीनचे चांगले निचरा होणाऱ्या जमिनीत उगवले जाते. ",
        "how to grow": "Adzuki सोयाबीनचे विविध हवामानात पीक घेतले जाऊ शकते, परंतु ते उबदार, दमट हवामानात चांगले करतात. ",
        "cost of growth": "अडझुकी बीन्स पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "Adzuki सोयाबीनचे पीक वाढण्यास तुलनेने सोपे आहे, परंतु त्यांना भरपूर पाणी लागते. ",
        "other details": "अॅडझुकी बीन्स हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/adzuki-bean",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "60-70 दिवस",
        "img": "/cropImg/adjzukibeans.webp",
        "name": "adzuki सोयाबीनचे"
      },
      "pigeon pea": {
        "definition": "त्याच्या खाण्यायोग्य बियांसाठी उगवलेला शेंगा.",
        "advantages": "कबुतराचे वाटाणे प्रथिने, फायबर आणि लोहाचा चांगला स्रोत आहे. ",
        "disadvantages": "कबूतर मटार कीटक आणि रोगांसाठी अतिसंवेदनशील असू शकतात.",
        "method to grow": "कबुतराचे मटार चांगल्या निचरा होणाऱ्या जमिनीत घेतले जातात. ",
        "how to grow": "कबूतर मटार विविध हवामानात घेतले जाऊ शकतात, परंतु ते उबदार, दमट हवामानात चांगले करतात. ",
        "cost of growth": "कबूतर मटार पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "कबूतर वाटाणे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्यांना भरपूर पाणी लागते. ",
        "other details": "कबूतर मटार हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/pigeon-pea",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "90-120 दिवस",
        "img": "/cropImg/pigeonpea.webp",
        "name": "कबूतर वाटाणा"
      },
      "chickpea": {
        "definition": "त्याच्या खाण्यायोग्य बियांसाठी उगवलेला शेंगा.",
        "advantages": "चणे हे प्रथिने, फायबर आणि लोहाचा चांगला स्रोत आहे. ",
        "disadvantages": "चणे कीटक आणि रोगांना बळी पडू शकतात.",
        "method to grow": "चणे चांगले निचरा होणाऱ्या जमिनीत घेतले जातात. ",
        "how to grow": "चणे विविध हवामानात घेतले जाऊ शकतात, परंतु ते उबदार, दमट हवामानात चांगले करतात. ",
        "cost of growth": "चणे पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "चणे हे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्यांना भरपूर पाणी लागते. ",
        "other details": "चणे हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/chickpea",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "60-70 दिवस",
        "img": "/cropImg/chana.webp",
        "name": "चणे"
      },
      "banana": {
        "definition": "एक खाद्य फळ - वनस्पतिदृष्ट्या एक बेरी - मुसा वंशातील अनेक प्रकारच्या मोठ्या वनौषधींच्या फुलांच्या वनस्पतींद्वारे उत्पादित केले जाते. ",
        "advantages": "केळी पोटॅशियम, व्हिटॅमिन सी आणि फायबरचा चांगला स्रोत आहे. ",
        "disadvantages": "केळी कीटक आणि रोगांना बळी पडू शकतात.",
        "method to grow": "केळी उष्णकटिबंधीय आणि उपोष्णकटिबंधीय हवामानात पिकतात. ",
        "how to grow": "केळी विविध हवामानात पिकवता येतात, परंतु ते उष्ण, दमट हवामानात चांगले करतात. ",
        "cost of growth": "केळी पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "केळी हे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्यांना भरपूर पाणी लागते. ",
        "other details": "केळी हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/banana",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "12-18 महिने",
        "img": "/cropImg/banana.webp",
        "name": "केळी"
      },
      "grapes": {
        "definition": "बेरीचा एक प्रकार जो सामान्यतः गोड आणि बिया नसलेला असतो. ",
        "advantages": "द्राक्षे अँटिऑक्सिडंट्स, पोटॅशियम आणि व्हिटॅमिन के चा चांगला स्रोत आहेत. ते खरेदी करण्यासाठी देखील तुलनेने स्वस्त आहेत.",
        "disadvantages": "द्राक्षे कीटक आणि रोगांना बळी पडू शकतात.",
        "method to grow": "द्राक्षे समशीतोष्ण आणि उपोष्णकटिबंधीय हवामानात घेतले जातात. ",
        "how to grow": "द्राक्षे विविध हवामानात उगवता येतात, परंतु ते उष्ण, कोरड्या हवामानात चांगले करतात. ",
        "cost of growth": "द्राक्षे पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "द्राक्षे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्यांना भरपूर सूर्यप्रकाशाची आवश्यकता असते. ",
        "other details": "द्राक्षे हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/grape",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "90-120 दिवस",
        "img": "/cropImg/grapes.webp",
        "name": "द्राक्षे"
      },
      "apple": {
        "definition": "सफरचंदाच्या झाडाद्वारे तयार होणारे एक पोमेशियस फळ. ",
        "advantages": "सफरचंद फायबर, व्हिटॅमिन सी आणि पोटॅशियमचा चांगला स्रोत आहे. ",
        "disadvantages": "सफरचंद कीटक आणि रोगांना बळी पडू शकतात.",
        "method to grow": "सफरचंद समशीतोष्ण हवामानात घेतले जातात. ",
        "how to grow": "सफरचंद विविध हवामानात पिकवता येतात, परंतु ते थंड, कोरड्या हवामानात चांगले करतात. ",
        "cost of growth": "सफरचंद वाढवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "सफरचंद झाडे वाढण्यास तुलनेने सोपे पीक आहेत, परंतु त्यांना भरपूर सूर्यप्रकाश आवश्यक आहे. ",
        "other details": "सफरचंद हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/apple",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "1-3 वर्षे",
        "img": "/cropImg/apple.webp",
        "name": "सफरचंद"
      },
      "mango": {
        "definition": "दक्षिण आशियातील एक उष्णकटिबंधीय फळ. ",
        "advantages": "आंबा व्हिटॅमिन सी, पोटॅशियम आणि फायबरचा चांगला स्रोत आहे. ",
        "disadvantages": "आंबा कीटक आणि रोगांना बळी पडू शकतो.",
        "method to grow": "आंबे उष्णकटिबंधीय आणि उपोष्णकटिबंधीय हवामानात घेतले जातात. ",
        "how to grow": "आंबा विविध हवामानात पिकवता येतो, परंतु ते उष्ण, दमट हवामानात चांगले करतात. ",
        "cost of growth": "आंबा पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "आंब्याची झाडे वाढण्यास तुलनेने सोपे पीक आहे, परंतु त्यांना भरपूर सूर्यप्रकाश लागतो. ",
        "other details": "आंबा हे एक अष्टपैलू पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/mango",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "3-5 वर्षे",
        "img": "/cropImg/mango.webp",
        "name": "आंबा"
      },
      "muskmelon": {
        "definition": "एक प्रकारचा खरबूज जो सामान्यत: गोल किंवा अंडाकृती आकाराचा असतो आणि त्याचे मांस गोड, नारिंगी असते. ",
        "advantages": "कस्तुरी हे व्हिटॅमिन ए, पोटॅशियम आणि फायबरचा चांगला स्रोत आहे. ",
        "disadvantages": "कस्तुरी कीटक आणि रोगांसाठी संवेदनाक्षम असू शकतात.",
        "method to grow": "कस्तुरी समशीतोष्ण आणि उपोष्णकटिबंधीय हवामानात वाढतात. ",
        "how to grow": "कस्तुरी वेगवेगळ्या हवामानात उगवता येतात, परंतु ते उष्ण, दमट हवामानात चांगले करतात. ",
        "cost of growth": "कस्तुरी खरबूज वाढवण्याची किंमत स्थान आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "कस्तुरीची झाडे वाढण्यास तुलनेने सोपे पीक आहेत, परंतु त्यांना भरपूर सूर्यप्रकाशाची आवश्यकता असते. ",
        "other details": "कस्तुरी हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/muskmelon",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "3-5 महिने",
        "img": "/cropImg/muskmelon.webp",
        "name": "muskemelon"
      },
      "orange": {
        "definition": "दक्षिणपूर्व आशियातील एक लिंबूवर्गीय फळ. ",
        "advantages": "संत्री व्हिटॅमिन सी, पोटॅशियम आणि फायबरचा चांगला स्रोत आहे. ",
        "disadvantages": "संत्री कीटक आणि रोगांना बळी पडू शकतात.",
        "method to grow": "संत्री समशीतोष्ण आणि उपोष्णकटिबंधीय हवामानात पिकतात. ",
        "how to grow": "संत्री विविध हवामानात उगवता येतात, परंतु ते उबदार, कोरड्या हवामानात चांगले करतात. ",
        "cost of growth": "संत्रा पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "संत्र्याची झाडे वाढण्यास तुलनेने सोपे पीक आहेत, परंतु त्यांना भरपूर सूर्यप्रकाशाची आवश्यकता असते. ",
        "other details": "संत्री हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/orange",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "4-6 वर्षे",
        "img": "/cropImg/orange.webp",
        "name": "संत्रा"
      },
      "papaya": {
        "definition": "एक उष्णकटिबंधीय फळ जे मूळ मध्य अमेरिका आहे. ",
        "advantages": "पपई व्हिटॅमिन सी, पोटॅशियम आणि फायबरचा चांगला स्रोत आहे. ",
        "disadvantages": "पपई कीटक आणि रोगांना बळी पडू शकते.",
        "method to grow": "पपई उष्णकटिबंधीय आणि उपोष्णकटिबंधीय हवामानात घेतले जाते. ",
        "how to grow": "पपईची लागवड विविध हवामानात करता येते, परंतु ते उष्ण, दमट हवामानात चांगले करतात. ",
        "cost of growth": "पपई पिकवण्याची किंमत ठिकाण आणि लागवडीच्या पद्धतीनुसार बदलते. ",
        "difficulty": "पपईची झाडे वाढण्यास तुलनेने सोपे पीक आहेत, परंतु त्यांना भरपूर सूर्यप्रकाशाची आवश्यकता असते. ",
        "other details": "पपई हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/papaya",
        "equipment": "फावडे, रेक, वॉटरिंग कॅन, बियाणे, खत",
        "time duration": "3-5 वर्षे",
        "img": "/cropImg/papaya.webp",
        "name": "पपई"
      },
      "pomegranate": {
        "definition": "मूळचे इराणचे फळ. ",
        "advantages": "डाळिंब हे व्हिटॅमिन सी, पोटॅशियम आणि फायबरचा चांगला स्रोत आहे. ",
        "disadvantages": "डाळिंब बियाणे कठीण होऊ शकते.",
        "method to grow": "डाळिंब समशीतोष्ण आणि उपोष्णकटिबंधीय हवामानात घेतले जातात. ",
        "how to grow": "डाळिंब विविध हवामानात घेतले जाऊ शकतात, परंतु ते उबदार, कोरड्या हवामानात चांगले करतात. ",
        "cost of growth": "डाळिंब पिकवण्याची किंमत ठिकाण आणि लागवड पद्धतीनुसार बदलते. ",
        "difficulty": "डाळिंबाची झाडे वाढण्यास तुलनेने सोपी असतात, परंतु त्यांना भरपूर सूर्यप्रकाश लागतो. ",
        "other details": "डाळिंब हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/pomegranate",
        "equipment": "फावडे, दंताळे, पाणी पिण्याची कॅन, बियाणे, खत",
        "time duration": "6-8 वर्षे",
        "img": "/cropImg/pomogranate.webp",
        "name": "डाळिंब"
      },
      "watermelon": {
        "definition": "एक प्रकारचा खरबूज जो सामान्यत: गोल किंवा अंडाकृती आकाराचा असतो आणि त्याचे मांस गोड, लाल असते. ",
        "advantages": "टरबूज हे व्हिटॅमिन ए, पोटॅशियम आणि फायबरचा चांगला स्रोत आहे. ",
        "disadvantages": "टरबूज कीटक आणि रोगांना बळी पडू शकतात.",
        "method to grow": "टरबूज समशीतोष्ण आणि उपोष्णकटिबंधीय हवामानात घेतले जातात. ",
        "how to grow": "टरबूज विविध हवामानात घेतले जाऊ शकतात, परंतु ते उबदार, दमट हवामानात चांगले करतात. ",
        "cost of growth": "टरबूज पिकवण्याची किंमत ठिकाण आणि लागवड पद्धतीनुसार बदलते. ",
        "difficulty": "टरबूज रोपे वाढण्यास तुलनेने सोपे आहेत, परंतु त्यांना भरपूर सूर्यप्रकाश आवश्यक आहे. ",
        "other details": "टरबूज हे एक बहुमुखी पीक आहे जे विविध पदार्थांमध्ये वापरले जाऊ शकते. ",
        "source": "https://www.britannica.com/plant/watermelon",
        "equipment": "फावडे, दंताळे, पाणी पिण्याची कॅन, बियाणे, खत",
        "time duration": "3-4 महिने",
        "img": "/cropImg/water melon.webp",
        "name": "टरबूज"
      }
    }
  }