{
    "cropData": {
      "rice": {
        "definition": "અનાજ તરીકે ઉગાડવામાં આવતું ઘાસ.",
        "advantages": "વિશ્વની અડધાથી વધુ વસ્તી માટે મુખ્ય ખોરાક. ",
        "disadvantages": "ચોખા એ પાણી-સઘન પાક છે. ",
        "method to grow": "ચોખા પૂરગ્રસ્ત ખેતરોમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "ચોખા વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ છે. ",
        "cost of growth": "સ્થાન અને ખેતીની પદ્ધતિના આધારે ચોખા ઉગાડવાનો ખર્ચ બદલાય છે. ",
        "difficulty": "ચોખા એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "ચોખા એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/rice",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "6-8 મહિના",
        "img": "/cropImg/paddy.webp",
        "name": "ચોખા"
      },
      "wheat": {
        "definition": "અનાજ તરીકે ઉગાડવામાં આવતું ઘાસ.",
        "advantages": "વિશ્વની એક તૃતીયાંશ વસ્તી માટે મુખ્ય ખોરાક. ",
        "disadvantages": "ઘઉં એ પાણી-સઘન પાક છે. ",
        "method to grow": "ઘઉં સૂકા ખેતરોમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "ઘઉં વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ઠંડી, સમશીતોષ્ણ આબોહવામાં શ્રેષ્ઠ ઉગાડવામાં આવે છે. ",
        "cost of growth": "ઘઉં ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "ઘઉં ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "ઘઉં એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/wheat",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "7-8 મહિના",
        "img": "/cropImg/wheat.webp",
        "name": "ઘઉં"
      },
      "mung bean": {
        "definition": "તેના ખાદ્ય બીજ માટે ઉગાડવામાં આવતી એક કઠોળ.",
        "advantages": "મગની દાળ પ્રોટીન, ફાઈબર અને વિટામિન્સનો સારો સ્ત્રોત છે. ",
        "disadvantages": "મગની દાળ જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "મગની દાળ સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "મગની દાળ વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ કરે છે. ",
        "cost of growth": "મગની દાળ ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "મગ એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "મગ એક બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/mung-bean",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "60-70 દિવસ",
        "img": "/cropImg/mong.webp",
        "name": "મગ ના દાણા"
      },
      "tea": {
        "definition": "કેમેલિયા સિનેન્સિસ પ્લાન્ટના પાંદડામાંથી તૈયાર કરાયેલ એક સુગંધિત પીણું.",
        "advantages": "ચા એન્ટીઑકિસડન્ટોનો સારો સ્ત્રોત છે અને તે ઘણા સ્વાસ્થ્ય લાભો દર્શાવે છે. ",
        "disadvantages": "ચા જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "ચા સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "ચા વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ છે. ",
        "cost of growth": "ચા ઉગાડવાની કિંમત સ્થળ અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "ચા એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "ચા એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/tea",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "3-4 વર્ષ",
        "img": "/cropImg/tea.webp",
        "name": "ચા"
      },
      "millet": {
        "definition": "તેના ખાદ્ય બીજ માટે ઉગાડવામાં આવેલ ઘાસ.",
        "advantages": "બાજરી કાર્બોહાઇડ્રેટ્સ, પ્રોટીન અને ફાઇબરનો સારો સ્ત્રોત છે. ",
        "disadvantages": "બાજરી જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "બાજરી સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "બાજરી વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, શુષ્ક આબોહવામાં શ્રેષ્ઠ ઉગાડવામાં આવે છે. ",
        "cost of growth": "બાજરી ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "બાજરી એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ સૂર્યપ્રકાશની જરૂર પડે છે. ",
        "other details": "બાજરી એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/millet",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "60-70 દિવસ",
        "img": "/cropImg/millet.webp",
        "name": "બાજરી"
      },
      "maize": {
        "definition": "અનાજનો અનાજ જે વિશ્વમાં સૌથી વધુ વ્યાપકપણે ઉગાડવામાં આવતો અનાજનો પાક છે.",
        "advantages": "મકાઈ કાર્બોહાઈડ્રેટ્સ, પ્રોટીન અને ફાઈબરનો સારો સ્ત્રોત છે. ",
        "disadvantages": "મકાઈ જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "મકાઈ સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "મકાઈ વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ થાય છે. ",
        "cost of growth": "મકાઈ ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "મકાઈ એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "મકાઈ એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/maize",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "90-120 દિવસ",
        "img": "/cropImg/maize.webp",
        "name": "મકાઈ"
      },
      "lentil": {
        "definition": "તેના ખાદ્ય બીજ માટે ઉગાડવામાં આવતી એક કઠોળ.",
        "advantages": "મસૂર પ્રોટીન, ફાઈબર અને આયર્નનો સારો સ્ત્રોત છે. ",
        "disadvantages": "મસૂર જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "મસૂર સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "મસૂર વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ઠંડી, ભેજવાળી આબોહવામાં શ્રેષ્ઠ કરે છે. ",
        "cost of growth": "મસૂર ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "મસૂર ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "મસૂર એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/lentil",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "60-70 દિવસ",
        "img": "/cropImg/litne.webp",
        "name": "મસૂર"
      },
      "jute": {
        "definition": "તેના ફાઇબર માટે ઉગાડવામાં આવતો છોડ.",
        "advantages": "જ્યુટ એક મજબૂત અને ટકાઉ ફાઇબર છે. ",
        "disadvantages": "શણ એ પાણી-સઘન પાક છે. ",
        "method to grow": "જ્યુટ સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "જ્યુટ વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ છે. ",
        "cost of growth": "જ્યુટ ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "જ્યુટ એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "શણ એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ ઉત્પાદનોમાં થઈ શકે છે. ",
        "source": "https://www.britannica.com/plant/jute",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "120-150 દિવસ",
        "img": "/cropImg/jute.webp",
        "name": "શણ"
      },
      "coffee": {
        "definition": "તેના કઠોળ માટે ઉગાડવામાં આવતું ઝાડવા અથવા નાનું વૃક્ષ, જે કોફી બનાવવા માટે શેકવામાં આવે છે અને જમીન પર હોય છે.",
        "advantages": "કોફી એક ઉત્તેજક છે જે સતર્કતા અને જ્ઞાનાત્મક કાર્યને સુધારી શકે છે. ",
        "disadvantages": "કોફી વ્યસનકારક હોઈ શકે છે. ",
        "method to grow": "કોફી સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "કોફી વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ છે. ",
        "cost of growth": "કોફી ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "કોફી ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ સૂર્યપ્રકાશની જરૂર પડે છે. ",
        "other details": "કોફી એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ ઉત્પાદનોમાં થઈ શકે છે. ",
        "source": "https://www.britannica.com/plant/coffee",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "3-4 વર્ષ",
        "img": "/cropImg/coffe.webp",
        "name": "કોફી"
      },
      "cotton": {
        "definition": "એક નરમ, રુંવાટીવાળું મુખ્ય ફાઇબર જે કપાસના છોડના બીજની આસપાસ રક્ષણાત્મક કેસમાં ઉગે છે.",
        "advantages": "કપાસ એ નરમ અને આરામદાયક ફેબ્રિક છે. ",
        "disadvantages": "કપાસ પાણી-સઘન પાક બની શકે છે. ",
        "method to grow": "કપાસની ખેતી સારી રીતે નિકાલવાળી જમીનમાં થાય છે. ",
        "how to grow": "કપાસ વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ થાય છે. ",
        "cost of growth": "કપાસ ઉગાડવાનો ખર્ચ સ્થળ અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "કપાસ એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "કપાસ એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ ઉત્પાદનોમાં થઈ શકે છે. ",
        "source": "https://www.britannica.com/plant/cotton",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "4-5 મહિના",
        "img": "/cropImg/cotton.webp",
        "name": "કપાસ"
      },
      "groundnut": {
        "definition": "તેના ખાદ્ય બીજ માટે ઉગાડવામાં આવતી એક કઠોળ.",
        "advantages": "મગફળી પ્રોટીન અને ચરબીનો સારો સ્ત્રોત છે. ",
        "disadvantages": "મગફળી જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "મગફળી સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "મગફળી વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ છે. ",
        "cost of growth": "મગફળી ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "મગફળી એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "મગફળી એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/groundnut",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "90-120 દિવસ",
        "img": "/cropImg/groundnut.webp",
        "name": "મગફળી"
      },
      "peas": {
        "definition": "તેના ખાદ્ય બીજ માટે ઉગાડવામાં આવતી એક કઠોળ.",
        "advantages": "વટાણા પ્રોટીન, ફાઈબર અને વિટામિન્સનો સારો સ્ત્રોત છે. ",
        "disadvantages": "વટાણા જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "વટાણા સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "વટાણા વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ઠંડી, ભેજવાળી આબોહવામાં શ્રેષ્ઠ કરે છે. ",
        "cost of growth": "વટાણા ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "વટાણા એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "વટાણા એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/pea",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "60-70 દિવસ",
        "img": "/cropImg/pea.webp",
        "name": "વટાણા"
      },
      "rubber": {
        "definition": "કુદરતી પોલિમર જે રબરના ઝાડના રસમાંથી કાઢવામાં આવે છે.",
        "advantages": "રબર એ બહુમુખી સામગ્રી છે જેનો ઉપયોગ વિવિધ ઉત્પાદનોમાં થઈ શકે છે. ",
        "disadvantages": "રબર પાણી-સઘન પાક બની શકે છે. ",
        "method to grow": "રબરના વૃક્ષો સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "રબરના વૃક્ષો વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ છે. ",
        "cost of growth": "સ્થાન અને ખેતીની પદ્ધતિના આધારે વધતી રબરની કિંમત બદલાય છે. ",
        "difficulty": "રબરના ઝાડ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેમને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "રબર એ બહુમુખી સામગ્રી છે જેનો ઉપયોગ ટાયર, નળી અને મોજા સહિત વિવિધ ઉત્પાદનોમાં થઈ શકે છે. ",
        "source": "https://www.britannica.com/plant/rubber-tree",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "7-8 વર્ષ",
        "img": "/cropImg/rubber.webp",
        "name": "રબર"
      },
      "sugarcane": {
        "definition": "એક ઊંચું ઘાસ જે તેના મીઠા રસ માટે ઉગાડવામાં આવે છે, જેનો ઉપયોગ ખાંડ બનાવવા માટે થાય છે.",
        "advantages": "શેરડી ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે અને તે ખાંડનો સારો સ્ત્રોત છે.",
        "disadvantages": "શેરડી પાણી-સઘન પાક બની શકે છે. ",
        "method to grow": "શેરડી સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "શેરડી વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ થાય છે. ",
        "cost of growth": "શેરડી ઉગાડવાની કિંમત સ્થળ અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "શેરડી ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "શેરડી એ બહુમુખી પાક છે જેનો ઉપયોગ ખાંડ, દાળ અને ઇથેનોલ સહિત વિવિધ ઉત્પાદનોમાં થઈ શકે છે. ",
        "source": "https://www.britannica.com/plant/sugarcane",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "12-18 મહિના",
        "img": "/cropImg/sugar.webp",
        "name": "શેરડી"
      },
      "tobacco": {
        "definition": "એક છોડ કે જે તેના પાંદડા માટે ઉગાડવામાં આવે છે, જેનો ઉપયોગ તમાકુના ઉત્પાદનો બનાવવા માટે થાય છે.",
        "advantages": "તમાકુ એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે અને તે નફાકારક પાક બની શકે છે.",
        "disadvantages": "તમાકુ એ અત્યંત વ્યસનકારક પદાર્થ છે અને તે મૃત્યુ અને રોગનું મુખ્ય કારણ છે.",
        "method to grow": "તમાકુ સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "તમાકુ વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ ઉગાડવામાં આવે છે. ",
        "cost of growth": "તમાકુ ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "તમાકુ એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "તમાકુ એ બહુમુખી પાક છે જેનો ઉપયોગ સિગારેટ, સિગાર અને ચાવવાની તમાકુ સહિત વિવિધ ઉત્પાદનોમાં થઈ શકે છે. ",
        "source": "https://www.britannica.com/plant/tobacco",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "6-8 મહિના",
        "img": "/cropImg/tobacco.webp",
        "name": "તમાકુ"
      },
      "kidney beans": {
        "definition": "તેના ખાદ્ય બીજ માટે ઉગાડવામાં આવતી એક કઠોળ.",
        "advantages": "કીડની બીન્સ પ્રોટીન, ફાઈબર અને આયર્નનો સારો સ્ત્રોત છે. ",
        "disadvantages": "કીડની બીન્સ જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "રાજમા સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "રાજમા વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ કરે છે. ",
        "cost of growth": "રાજમા ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "રાજમા એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "રાજમા એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/kidney-bean",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "60-70 દિવસ",
        "img": "/cropImg/rajma.webp",
        "name": "રાજમા"
      },
      "moth beans": {
        "definition": "તેના ખાદ્ય બીજ માટે ઉગાડવામાં આવતી એક કઠોળ.",
        "advantages": "મોથ બીન્સ પ્રોટીન, ફાઈબર અને આયર્નનો સારો સ્ત્રોત છે. ",
        "disadvantages": "મોથ બીન્સ જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "શલભ કઠોળ સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "શલભ કઠોળ વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ કરે છે. ",
        "cost of growth": "મોથ બીન્સ ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "મોથ બીન્સ એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "મોથ બીન્સ એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/moth-bean",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "60-70 દિવસ",
        "img": "/cropImg/moth.webp",
        "name": "શલભ કઠોળ"
      },
      "coconut": {
        "definition": "નાળિયેર પામનું ફળ, જે એક ઊંચું, પાતળું વૃક્ષ છે.",
        "advantages": "નારિયેળ પોષક તત્વોનો સારો સ્ત્રોત છે, જેમાં પ્રોટીન, ફાઈબર અને ચરબીનો સમાવેશ થાય છે. ",
        "disadvantages": "નારિયેળ પાણી-સઘન પાક બની શકે છે. ",
        "method to grow": "નાળિયેર સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "નારિયેળ વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ છે. ",
        "cost of growth": "નારિયેળ ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "નારિયેળની ખજૂર ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "નારિયેળ એ બહુમુખી પાક છે જેનો ઉપયોગ નારિયેળનું દૂધ, નારિયેળ તેલ અને નારિયેળ પાણી સહિત વિવિધ ઉત્પાદનોમાં થઈ શકે છે. ",
        "source": "https://www.britannica.com/plant/coconut-palm",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "5-7 વર્ષ",
        "img": "/cropImg/coconut.webp",
        "name": "નાળિયેર"
      },
      "black gram": {
        "definition": "તેના ખાદ્ય બીજ માટે ઉગાડવામાં આવતી એક કઠોળ.",
        "advantages": "કાળા ચણા પ્રોટીન, ફાઈબર અને આયર્નનો સારો સ્ત્રોત છે. ",
        "disadvantages": "કાળા ચણા જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "કાળા ચણા સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "કાળા ચણા વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ ઉગાડવામાં આવે છે. ",
        "cost of growth": "કાળા ચણા ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "કાળા ચણા એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "કાળા ચણા એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/black-gram",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "60-70 દિવસ",
        "img": "/cropImg/blackgram.webp",
        "name": "કાળા ગ્રામ"
      },
      "adzuki beans": {
        "definition": "તેના ખાદ્ય બીજ માટે ઉગાડવામાં આવતી એક કઠોળ.",
        "advantages": "Adzuki કઠોળ પ્રોટીન, ફાઇબર અને આયર્નનો સારો સ્ત્રોત છે. ",
        "disadvantages": "Adzuki કઠોળ જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "Adzuki કઠોળ સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "Adzuki કઠોળ વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ કરે છે. ",
        "cost of growth": "એડઝુકી કઠોળ ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "Adzuki કઠોળ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "Adzuki કઠોળ એક બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં થઈ શકે છે. ",
        "source": "https://www.britannica.com/plant/adzuki-bean",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "60-70 દિવસ",
        "img": "/cropImg/adjzukibeans.webp",
        "name": "adzuki કઠોળ"
      },
      "pigeon pea": {
        "definition": "તેના ખાદ્ય બીજ માટે ઉગાડવામાં આવતી એક કઠોળ.",
        "advantages": "કબૂતરના વટાણા પ્રોટીન, ફાઇબર અને આયર્નનો સારો સ્ત્રોત છે. ",
        "disadvantages": "કબૂતર વટાણા જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "કબૂતર વટાણા સારી રીતે નિકાલવાળી જમીનમાં ઉગાડવામાં આવે છે. ",
        "how to grow": "કબૂતર વટાણા વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ છે. ",
        "cost of growth": "કબૂતર વટાણા ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "કબૂતર વટાણા એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "કબૂતર વટાણા એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં થઈ શકે છે. ",
        "source": "https://www.britannica.com/plant/pigeon-pea",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "90-120 દિવસ",
        "img": "/cropImg/pigeonpea.webp",
        "name": "કબૂતર વટાણા"
      },
      "chickpea": {
        "definition": "તેના ખાદ્ય બીજ માટે ઉગાડવામાં આવતી એક કઠોળ.",
        "advantages": "ચણા પ્રોટીન, ફાઈબર અને આયર્નનો સારો સ્ત્રોત છે. ",
        "disadvantages": "ચણા જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "ચણાની ખેતી સારી રીતે નિકાલવાળી જમીનમાં થાય છે. ",
        "how to grow": "ચણા વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ કરે છે. ",
        "cost of growth": "ચણા ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "ચણા એ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "ચણા એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/chickpea",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "60-70 દિવસ",
        "img": "/cropImg/chana.webp",
        "name": "ચણા"
      },
      "banana": {
        "definition": "એક ખાદ્ય ફળ - બોટનીકલી બેરી - મુસા જીનસમાં વિવિધ પ્રકારના મોટા હર્બેસિયસ ફૂલોના છોડ દ્વારા ઉત્પાદિત થાય છે. ",
        "advantages": "કેળા પોટેશિયમ, વિટામિન સી અને ફાઈબરનો સારો સ્ત્રોત છે. ",
        "disadvantages": "કેળા જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "કેળા ઉષ્ણકટિબંધીય અને ઉષ્ણકટિબંધીય આબોહવામાં ઉગાડવામાં આવે છે. ",
        "how to grow": "કેળા વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ ઉગાડવામાં આવે છે. ",
        "cost of growth": "કેળા ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "કેળા ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ પાણીની જરૂર પડે છે. ",
        "other details": "કેળા એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/banana",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "12-18 મહિના",
        "img": "/cropImg/banana.webp",
        "name": "કેળા"
      },
      "grapes": {
        "definition": "બેરીનો એક પ્રકાર જે સામાન્ય રીતે મીઠી અને બીજ વગરની હોય છે. ",
        "advantages": "દ્રાક્ષ એન્ટીઑકિસડન્ટો, પોટેશિયમ અને વિટામિન Kનો સારો સ્ત્રોત છે. તે ખરીદવા માટે પ્રમાણમાં સસ્તી પણ છે.",
        "disadvantages": "દ્રાક્ષ જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "દ્રાક્ષ સમશીતોષ્ણ અને ઉષ્ણકટિબંધીય આબોહવામાં ઉગાડવામાં આવે છે. ",
        "how to grow": "દ્રાક્ષ વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, શુષ્ક આબોહવામાં શ્રેષ્ઠ છે. ",
        "cost of growth": "દ્રાક્ષ ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "દ્રાક્ષ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેને પુષ્કળ સૂર્યપ્રકાશની જરૂર પડે છે. ",
        "other details": "દ્રાક્ષ એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/grape",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "90-120 દિવસ",
        "img": "/cropImg/grapes.webp",
        "name": "દ્રાક્ષ"
      },
      "apple": {
        "definition": "સફરજનના ઝાડ દ્વારા ઉત્પાદિત પોમેસિયસ ફળ. ",
        "advantages": "સફરજન ફાઈબર, વિટામિન સી અને પોટેશિયમનો સારો સ્ત્રોત છે. ",
        "disadvantages": "સફરજન જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "સફરજન સમશીતોષ્ણ આબોહવામાં ઉગાડવામાં આવે છે. ",
        "how to grow": "સફરજન વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ઠંડી, શુષ્ક આબોહવામાં શ્રેષ્ઠ ઉગાડવામાં આવે છે. ",
        "cost of growth": "સફરજન ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "સફરજનના વૃક્ષો ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેમને પુષ્કળ સૂર્યપ્રકાશની જરૂર પડે છે. ",
        "other details": "સફરજન એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/apple",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "1-3 વર્ષ",
        "img": "/cropImg/apple.webp",
        "name": "સફરજન"
      },
      "mango": {
        "definition": "એક ઉષ્ણકટિબંધીય ફળ જે દક્ષિણ એશિયાનું મૂળ છે. ",
        "advantages": "કેરી વિટામિન સી, પોટેશિયમ અને ફાઈબરનો સારો સ્ત્રોત છે. ",
        "disadvantages": "કેરી જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "કેરી ઉષ્ણકટિબંધીય અને ઉષ્ણકટિબંધીય આબોહવામાં ઉગાડવામાં આવે છે. ",
        "how to grow": "કેરી વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ ઉગાડવામાં આવે છે. ",
        "cost of growth": "કેરી ઉગાડવાની કિંમત સ્થળ અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "કેરીના ઝાડ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેમને પુષ્કળ સૂર્યપ્રકાશની જરૂર પડે છે. ",
        "other details": "કેરી એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/mango",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "3-5 વર્ષ",
        "img": "/cropImg/mango.webp",
        "name": "કેરી"
      },
      "muskmelon": {
        "definition": "તરબૂચનો એક પ્રકાર જે સામાન્ય રીતે ગોળાકાર અથવા અંડાકાર આકારનો હોય છે અને તેમાં મીઠો, નારંગી માંસ હોય છે. ",
        "advantages": "મસ્કમેલન વિટામિન A, પોટેશિયમ અને ફાઇબરનો સારો સ્ત્રોત છે. ",
        "disadvantages": "મસ્કમેલન જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "મસ્કમેલન સમશીતોષ્ણ અને ઉષ્ણકટિબંધીય આબોહવામાં ઉગાડવામાં આવે છે. ",
        "how to grow": "મસ્કમેલન વિવિધ આબોહવામાં ઉગાડવામાં આવે છે, પરંતુ તેઓ ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ કરે છે. ",
        "cost of growth": "મસ્કમેલન ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "મસ્કમેલન છોડ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેમને પુષ્કળ સૂર્યપ્રકાશની જરૂર પડે છે. ",
        "other details": "મસ્કમેલન એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/muskmelon",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "3-5 મહિના",
        "img": "/cropImg/muskmelon.webp",
        "name": "મસ્કેમેલન"
      },
      "orange": {
        "definition": "એક સાઇટ્રસ ફળ જે દક્ષિણપૂર્વ એશિયાનું મૂળ છે. ",
        "advantages": "નારંગી વિટામિન સી, પોટેશિયમ અને ફાઈબરનો સારો સ્ત્રોત છે. ",
        "disadvantages": "નારંગી જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "નારંગી સમશીતોષ્ણ અને ઉષ્ણકટિબંધીય આબોહવામાં ઉગાડવામાં આવે છે. ",
        "how to grow": "નારંગી વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, સૂકી આબોહવામાં શ્રેષ્ઠ છે. ",
        "cost of growth": "નારંગી ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "નારંગીના ઝાડ ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેમને પુષ્કળ સૂર્યપ્રકાશની જરૂર પડે છે. ",
        "other details": "નારંગી એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/orange",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "4-6 વર્ષ",
        "img": "/cropImg/orange.webp",
        "name": "નારંગી"
      },
      "papaya": {
        "definition": "એક ઉષ્ણકટિબંધીય ફળ જે મધ્ય અમેરિકાનું મૂળ છે. ",
        "advantages": "પપૈયા વિટામિન સી, પોટેશિયમ અને ફાઈબરનો સારો સ્ત્રોત છે. ",
        "disadvantages": "પપૈયા જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "પપૈયા ઉષ્ણકટિબંધીય અને ઉષ્ણકટિબંધીય આબોહવામાં ઉગાડવામાં આવે છે. ",
        "how to grow": "પપૈયા વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ ઉગાડવામાં આવે છે. ",
        "cost of growth": "પપૈયા ઉગાડવાની કિંમત સ્થાન અને ખેતીની પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "પપૈયાના વૃક્ષો ઉગાડવા માટે પ્રમાણમાં સરળ પાક છે, પરંતુ તેમને પુષ્કળ સૂર્યપ્રકાશની જરૂર પડે છે. ",
        "other details": "પપૈયા એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/papaya",
        "equipment": "પાવડો, રેક, પાણી આપવાનું કેન, બીજ, ખાતર",
        "time duration": "3-5 વર્ષ",
        "img": "/cropImg/papaya.webp",
        "name": "પપૈયા"
      },
      "pomegranate": {
        "definition": "એક ફળ જે મૂળ ઈરાનનું છે. ",
        "advantages": "દાડમ વિટામિન સી, પોટેશિયમ અને ફાઈબરનો સારો સ્ત્રોત છે. ",
        "disadvantages": "દાડમનું બીજ કરવું મુશ્કેલ હોઈ શકે છે.",
        "method to grow": "દાડમ સમશીતોષ્ણ અને ઉષ્ણકટિબંધીય આબોહવામાં ઉગાડવામાં આવે છે. ",
        "how to grow": "દાડમ વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, શુષ્ક આબોહવામાં શ્રેષ્ઠ છે. ",
        "cost of growth": "સ્થાન અને ખેતી પદ્ધતિના આધારે દાડમ ઉગાડવાની કિંમત બદલાય છે. ",
        "difficulty": "દાડમના ઝાડ ઉગાડવા માટે પ્રમાણમાં સરળ છે, પરંતુ તેમને ખૂબ સૂર્યપ્રકાશની જરૂર પડે છે. ",
        "other details": "દાડમ એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/pomegranate",
        "equipment": "પાવડો, રેક, વોટરિંગ કેન, બીજ, ખાતર",
        "time duration": "6-8 વર્ષ",
        "img": "/cropImg/pomogranate.webp",
        "name": "દાડમ"
      },
      "watermelon": {
        "definition": "તરબૂચનો એક પ્રકાર જે સામાન્ય રીતે ગોળાકાર અથવા અંડાકાર આકારનો હોય છે અને તેમાં મીઠી, લાલ માંસ હોય છે. ",
        "advantages": "તરબૂચ વિટામિન A, પોટેશિયમ અને ફાઈબરનો સારો સ્ત્રોત છે. ",
        "disadvantages": "તરબૂચ જીવાતો અને રોગો માટે સંવેદનશીલ હોઈ શકે છે.",
        "method to grow": "તરબૂચ સમશીતોષ્ણ અને ઉષ્ણકટિબંધીય આબોહવામાં ઉગાડવામાં આવે છે. ",
        "how to grow": "તરબૂચ વિવિધ આબોહવામાં ઉગાડી શકાય છે, પરંતુ તે ગરમ, ભેજવાળી આબોહવામાં શ્રેષ્ઠ રીતે ઉગાડવામાં આવે છે. ",
        "cost of growth": "તરબૂચ ઉગાડવાની કિંમત સ્થાન અને ખેતી પદ્ધતિના આધારે બદલાય છે. ",
        "difficulty": "તરબૂચના છોડ ઉગાડવામાં પ્રમાણમાં સરળ છે, પરંતુ તેમને ખૂબ સૂર્યપ્રકાશની જરૂર પડે છે. ",
        "other details": "તરબૂચ એ બહુમુખી પાક છે જેનો ઉપયોગ વિવિધ વાનગીઓમાં કરી શકાય છે. ",
        "source": "https://www.britannica.com/plant/watermelon",
        "equipment": "પાવડો, રેક, વોટરિંગ કેન, બીજ, ખાતર",
        "time duration": "3-4 મહિના",
        "img": "/cropImg/water melon.webp",
        "name": "તરબૂચ"
      }
    }
  }