{
    "cropData": {
        "rice": {
            "definition": "ਇੱਕ ਧਾਨ ਅਣਾਜ ਵਜੋਂ ਖੇਤੀ ਕੀਤੀ ਜਾਂਦੀ ਜੋ ਘਾਸ ਨੂੰ ਹੈ।",
            "advantages": "ਦੁਨੀਆ ਦੀ ਵੱਡੀਆਂ ਕਿਸਮ ਦੀ ਆਹਾਰਾਂ ਦੀ ਬਣਤਰੀ ਹੈ। ਹੋਰਡੇ ਦੀਆਂ ਚੁਕਾਣਾਂ, ਪ੍ਰੋਟੀਨ ਅਤੇ ਫਾਈਬਰ ਦੀ ਚੁਣੌਤੀ ਹੈ। ਉਤਪਾਦਨ ਦੀ ਖਰਚ ਵੀ ਕਮ ਹੈ।",
            "disadvantages": "ਚਾਵਲ ਪਾਣੀ ਦੀ ਪੂਰੇਪਣ ਵਾਲਾ ਅਣਾਜ ਹੈ। ਇਸ ਨੂੰ ਕੀਟਾਂ ਅਤੇ ਰੋਗਾਂ ਨੂੰ ਵੀ ਪ੍ਰਭਾਵਿਤ ਕੀਤਾ ਜਾ ਸਕਦਾ ਹੈ।",
            "method to grow": "ਚਾਵਲ ਨੂੰ ਭਰਿਆ ਖੇਤ ਵਿੱਚ ਪੈਦਾ ਕੀਤਾ ਜਾਂਦਾ ਹੈ। ਬੀਜ ਪਾਣੀ ਵਿੱਚ ਬੋਆ ਜਾਂਦੇ ਹਨ ਅਤੇ ਫੀਲਡਾਂ ਨੂੰ ਪਾਣੀ ਵਿੱਚ ਭਰਿਆ ਜਾਂਦਾ ਹੈ ਜੋ ਕਿ ਲਗਭਗ 6 ਇੰਚ ਦੀ ਗਹਿਰਾਈ ਵਾਲਾ ਹੁੰਦਾ ਹੈ। ਚਾਵਲ ਦੇ ਪੌਦੇ ਪਾਣੀ ਵਿੱਚ ਵੱਧਦੇ ਹਨ ਅਤੇ ਜਦੋਂ ਉਹ ਪੂਰਣ ਹੋ ਜਾਂਦੇ ਹਨ ਤਾਂ ਉਨ੍ਹਾਂ ਨੂੰ ਕਾਟ ਲਿਆ ਜਾਂਦਾ ਹੈ।",
            "how to grow": "ਚਾਵਲ ਨੂੰ ਵੱਡੇ-ਵੱਡੇ ਇਕਾਇਆਂ ਵਿੱਚ ਪੈਦਾ ਕੀਤਾ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਸਦਾ ਸਭ ਤੋਂ ਵਧੀਆ ਪ੍ਰਭਾਵ ਗਰਮ, ਮਹਿਮਾਨੀ ਹਵਾਵਾਂ ਦੀ ਹੁੰਦੀ ਹੈ। ਮਿੱਟੀ ਠੰਢੀ, ਥੋਡੀ ਦੂਰਿਆਂ ਵਾਲੀ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ ਅਤੇ ਰੋਜ਼ਾਨਾ ਨਾਲ ਪਾਣੀ ਦੀ ਬਹੁਤ ਲੋੜ ਹੁੰਦੀ ਹੈ। ਚਾਵਲ ਇੱਕ ਸੰਤੋਸ਼ਜਨਕ ਅਣਾਜ ਹੈ, ਪਰ ਇਸ ਨੂੰ ਪਾਣੀ ਦੀ ਬਹੁਤ ਜ਼ਰੂਰਤ ਹੁੰਦੀ ਹੈ।",
            "cost of growth": "ਚਾਵਲ ਦੀ ਉਗਾਹਰੀ ਦੇ ਖਰਚ ਦਾ ਖਰਚ ਸਥਾਨਕ ਅਤੇ ਖੇਤੀ ਦੀ ਪਦਦਤੀ ਤੇ ਹੋਰ ਮੁੱਦਾਂ ਤੇ ਅਧਾਰਿਤ ਹੁੰਦਾ ਹੈ। ਤਾਂਕੀ, ਇਸ ਨੂੰ ਵੱਧਤੀਆਂ ਤੋਂ ਵੱਧ ਸਸਤਾ ਅਣਾਜ ਖੇਤੀ ਦੀ ਜਾਂਚ ਕੀਤੀ ਜਾ ਸਕਦੀ ਹੈ।",
            "difficulty": "ਚਾਵਲ ਨੂੰ ਵੱਡੇ ਵਿੱਚ ਪੈਦਾ ਕਰਨਾ ਸੁਝਾਅੀਆਂ ਵਾਲੀ ਇਕ ਨਿਹਾਲ ਅਣਾਜ ਹੈ, ਪਰ ਇਸਦੀ ਬਹੁਤ ਵੱਡੀ ਜਰੂਰਤ ਹੈ ਪਾਣੀ ਦੀ। ਕੀਟਾਂ ਅਤੇ ਰੋਗਾਂ ਨੂੰ ਨਿਯੰਤਰਿਤ ਕਰਨਾ ਵੀ ਮਹੱਤਵਪੂਰਨ ਹੈ।",
            "other details": "ਚਾਵਲ ਇੱਕ ਕਿਸਮ ਦੀ ਅਣਾਜ ਹੈ ਜੋ ਵੱਡੀਆਂ ਤੋਂ ਵੱਧ ਤਰੀਕਿਆਂ ਵਿੱਚ ਵਰਤੀ ਜਾ ਸਕਦੀ ਹੈ। ਇਸ ਨੂੰ ਕਾਰਬੋਹਾਈਡਰੇਟ, ਪ੍ਰੋਟੀਨ ਅਤੇ ਫਾਈਬਰ ਦਾ ਵੱਡਾ ਸੋਰਸ ਹੈ।",
            "source": "https://www.britannica.com/plant/rice",
            "equipment": "ਖੁਦਾਈ ਕਾਂ, ਢੇਰ, ਪਾਣੀ ਪਾਉਣ ਵਾਲਾ ਕੇਨ, ਬੀਜ, ਖਾਦ",
            "time duration": "6-8 ਮਹੀਨੇ",
            "img": "./picture/paddy.jpg",
            "name": "ਚਾਵਲ"
        },
        "wheat": {
            "definition": "ਇੱਕ ਧਾਨ ਅਣਾਜ ਵਜੋਂ ਖੇਤੀ ਕੀਤੀ ਜਾਂਦੀ ਜੋ ਘਾਸ ਨੂੰ ਹੈ।",
            "advantages": "ਦੁਨੀਆ ਦੀ ਤਿੰਨ ਭਾਗ ਵਿੱਚ ਦਾਇਰਾ ਕਰਨ ਵਾਲੀ ਆਹਾਰਾਂ ਦੀ ਬਣਤਰੀ ਹੈ। ਇਹ ਕਾਰਬੋਹਾਈਡਰੇਟ, ਪ੍ਰੋਟੀਨ ਅਤੇ ਫਾਈਬਰ ਦਾ ਵੱਡਾ ਸੋਰਸ ਹੈ। ਵੇਟ ਵੱਡੇ ਵੱਧ ਤਰੀਕਿਆਂ ਵਿੱਚ ਵਰਤੀ ਜਾ ਸਕਦੀ ਹੈ ਅਤੇ ਇਸ ਦੀ ਖੇਤੀ ਵੀ ਕਮ ਖਰਚ ਹੁੰਦੀ ਹੈ।",
            "disadvantages": "ਗੇਹੂ ਨੂੰ ਪਾਣੀ ਦੀ ਬਹੁਤ ਲੋੜ ਹੁੰਦੀ ਹੈ ਅਤੇ ਇਸ ਨੂੰ ਕੀਟਾਂ ਅਤੇ ਰੋਗਾਂ ਨੂੰ ਵੀ ਪ੍ਰਭਾਵਿਤ ਕੀਤਾ ਜਾ ਸਕਦਾ ਹੈ।",
            "method to grow": "ਗੇਹੂ ਸੂਖੇ ਖੇਤਾਂ ਵਿੱਚ ਪੈਦਾ ਕੀਤੀ ਜਾਂਦੀ ਹੈ। ਬੀਜ ਮਿੱਟੀ ਵਿੱਚ ਬੋਆ ਜਾਂਦੇ ਹਨ ਅਤੇ ਫੀਲਡਾਂ ਨੂੰ ਜਰੂਰ ਅਨੁਸਾਰ ਸਿੰਚਾਈ ਦਿੱਤੀ ਜਾਂਦੀ ਹੈ। ਗੇਹੂ ਦੇ ਪੌਦੇ ਧਰਤੀ ਵਿੱਚ ਵਧਦੇ ਹਨ ਅਤੇ ਜਦੋਂ ਉਹ ਪੂਰੇਪਣ ਹੋ ਜਾਂਦੇ ਹਨ ਤਾਂ ਉਨ੍ਹਾਂ ਨੂੰ ਕਾਟ ਲਿਆ ਜਾਂਦਾ ਹੈ।",
            "how to grow": "ਗੇਹੂ ਵਿੱਚ ਵੱਡੇ ਵਿੱਚ ਪੈਦਾ ਕਰਨ ਵਾਲੀ ਆਹਾਰਾਂ ਦੀ ਬਣਤਰੀ ਹੈ। ਇਹ ਕਾਰਬੋਹਾਈਡਰੇਟ, ਪ੍ਰੋਟੀਨ ਅਤੇ ਫਾਈਬਰ ਦਾ ਵੱਡਾ ਸੋਰਸ ਹੈ। ਵੇਟ ਵੱਡੇ ਵੱਧ ਤਰੀਕਿਆਂ ਵਿੱਚ ਵਰਤੀ ਜਾ ਸਕਦੀ ਹੈ ਅਤੇ ਇਸ ਦੀ ਖੇਤੀ ਵੀ ਕਮ ਖਰਚ ਹੁੰਦੀ ਹੈ।",
            "cost of growth": "ਗੇਹੂ ਦੀ ਉਗਾਹਰੀ ਦੇ ਖਰਚ ਦਾ ਖਰਚ ਸਥਾਨਕ ਅਤੇ ਖੇਤੀ ਦੀ ਪਦਦਤੀ ਤੇ ਹੋਰ ਮੁੱਦਾਂ ਤੇ ਅਧਾਰਿਤ ਹੁੰਦਾ ਹੈ। ਤਾਂਕੀ, ਇਸ ਨੂੰ ਵੱਧਤੀਆਂ ਤੋਂ ਵੱਧ ਸਸਤਾ ਅਣਾਜ ਖੇਤੀ ਦੀ ਜਾ ਸਕੇ।",
            "difficulty": "ਗੇਹੂ ਨੂੰ ਵੱਡੇ ਵਿੱਚ ਪੈਦਾ ਕਰਨਾ ਸੁਝਾਅੀਆਂ ਵਾਲੀ ਇਕ ਨਿਹਾਲ ਅਣਾਜ ਹੈ, ਪਰ ਇਸਦੀ ਬਹੁਤ ਵੱਡੀ ਜਰੂਰਤ ਹੈ ਪਾਣੀ ਦੀ। ਕੀਟਾਂ ਅਤੇ ਰੋਗਾਂ ਨੂੰ ਨਿਯੰਤਰਿਤ ਕਰਨਾ ਵੀ ਮਹੱਤਵਪੂਰਨ ਹੈ।",
            "other details": "ਗੇਹੂ ਵੱਡੇ ਵਿੱਚ ਵੱਧ ਤਰੀਕਿਆਂ ਵਿੱਚ ਵਰਤੀ ਜਾ ਸਕਦੀ ਹੈ ਅਤੇ ਇਸ ਦਾ ਉਪਯੋਗ ਕਈ ਤਰੀਕਿਆਂ ਵਿੱਚ ਕੀਤਾ ਜਾ ਸਕਦਾ ਹੈ। ਇਹ ਕਾਰਬੋਹਾਈਡਰੇਟ, ਪ੍ਰੋਟੀਨ ਅਤੇ ਫਾਈਬਰ ਦਾ ਵੱਡਾ ਸੋਰਸ ਹੈ।",
            "source": "https://www.britannica.com/plant/wheat",
            "equipment": "ਖੁਦਾਈ ਕਾਂ, ਢੇਰ, ਪਾਣੀ ਪਾਉਣ ਵਾਲਾ ਕੇਨ, ਬੀਜ, ਖਾਦ",
            "time duration": "7-8 ਮਹੀਨੇ",
            "img": "./picture/wheat.jpg",
            "name": "ਗੇਹੂ"
        },
        "mung bean": {
            "definition": "ਇਸ ਦਾ ਬੀਜ ਖਾਣ ਵਾਲੇ ਲੋਕਾਂ ਵਲੋਂ ਉਗਾਈ ਜਾਣ ਵਾਲੀ ਇੱਕ ਫਲੀ ਮੁੱਠੀ ਹੈ।",
            "advantages": "ਮੂਂਗ ਬੀਨਾਂ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਵਿਟਾਮਿਨਾਂ ਦਾ ਸੱਚਾ ਸੋਰਸ ਹਨ। ਇਸਦੀ ਖੇਤੀ ਵੀ ਕਮ ਖਰਚ ਹੁੰਦੀ ਹੈ।",
            "disadvantages": "ਮੂਂਗ ਬੀਨਾਂ ਕੀਟਾਂ ਅਤੇ ਰੋਗਾਂ ਦੇ ਸੰਕਰਮਿਤ ਹੋਣ ਦੇ ਆਧਾਰਾਂ ਹੋ ਸਕਦੀਆਂ ਹਨ।",
            "method to grow": "ਮੂਂਗ ਬੀਨਾਂ ਨੂੰ ਛਿੱਟੇ ਮਿਟੀ ਵਿੱਚ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ। ਬੀਜ ਮਿਟੀ ਵਿੱਚ ਬੋਇਆ ਜਾਂਦੇ ਹਨ ਅਤੇ ਫੀਲਡਾਂ ਨੂੰ ਜਰੂਰਤ ਅਨੁਸਾਰ ਪਾਣੀ ਦੀ ਸਿਂਚਾਈ ਕੀਤੀ ਜਾਂਦੀ ਹੈ। ਮੂਂਗ ਬੀਨਾਂ ਦੇ ਪੌਧੇ ਮਿਟੀ ਵਿੱਚ ਉਗਣ ਦੇ ਸਮਾਂ ਵਿੱਚ ਬੜੇ ਹੁੰਦੇ ਹਨ ਤਾਂਕਿ ਉਹ ਪਕੇ ਹੋ ਜਾਂਦੇ ਹਨ।",
            "how to grow": "ਮੂਂਗ ਬੀਨਾਂ ਨੂੰ ਵੱਧ ਤਰੀਕਿਆਂ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਵਰਮ ਅਤੇ ਭੇਜਨ ਦਾ ਮਾਹੌਲ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਫਲਦਾਰ ਪ੍ਰਦਾਨ ਕਰਦੀ ਹੈ। ਮਿਟੀ ਵੱਖਰੀ ਅਤੇ ਉਰਵਰ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ। ਮੂਂਗ ਬੀਨਾਂ ਨੂੰ ਉਗਾਉਣਾ ਸੰਤੋਸ਼ਜਨਕ ਫਸਲ ਹੈ, ਪਰ ਇਸ ਲਈ ਹੋਰ ਪਾਣੀ ਦੀ ਵਰਤੋਂ ਕਰਨੀ ਪੈਂਦੀ ਹੈ।",
            "cost of growth": "ਮੂਂਗ ਬੀਨਾਂ ਦੀ ਵਾਧੂ ਕੀਮਤ ਨੂੰ ਖੇਤੀ ਦੀ ਥਾਈਂ ਅਤੇ ਕੁਲਿਵੇ ਦੀ ਢੰਗ ਤੋਂ ਭਿੰਨ ਹੋਣ ਦੇ ਅਧਾਰ ਤੇ ਬਦਲਦੀ ਹੈ। ਪਰ ਇਸ ਦੀ ਆਮ ਤੌਰ ਤੇ ਖੇਤੀ ਕੀਮਤ ਵਧੀਆ ਹੈ।",
            "difficulty": "ਮੂਂਗ ਬੀਨਾਂ ਨੂੰ ਉਗਾਉਣ ਦਾ ਕੰਮ ਸਹਜ ਹੈ, ਪਰ ਇਸ ਲਈ ਪਾਣੀ ਦੀ ਬਹੁਤ ਵੱਡੀ ਵਰਤੋਂ ਕਰਨੀ ਪੈਂਦੀ ਹੈ। ਕੀਟਾਂ ਅਤੇ ਰੋਗਾਂ ਨੂੰ ਨਿਯੰਤਰਣ ਕਰਨਾ ਵੀ ਮਹੱਤਵਪੂਰਣ ਹੈ।",
            "other details": "ਮੂਂਗ ਬੀਨਾਂ ਇੱਕ ਬਹੁਤ ਵਰਤਮਾਨਸ਼ੀਲ ਫਸਲ ਹਨ ਜੋ ਵੱਡੇ ਨੰਬਰਾਂ ਵਿੱਚ ਵਰਤੀ ਜਾਂਦੀਆਂ ਹਨ। ਇਹ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਵਿਟਾਮਿਨਾਂ ਦਾ ਸੱਚਾ ਸੋਰਸ ਹੈ।",
            "source": "https://www.britannica.com/plant/mung-bean",
            "equipment": "ਕੁੱਦਲ, ਕਹੋਂਈ, ਪਾਣੀ ਦੀ ਦਾਨਾ, ਬੀਜ, ਖਾਦ",
            "time duration": "60-70 ਦਿਨ",
            "img": "./picture/mong",
            "name": "ਮੂਂਗ ਬੀਨ"
        },
        "tea": {
            "definition": "ਕੈਮੇਲੀਆ ਸਿਨੇਸਿਸ ਪੌਦੇ ਦੇ ਪੱਤਿਆਂ ਤੋਂ ਬਣਾਈ ਜਾਣ ਵਾਲੀ ਸੁਗੰਧਿਤ ਪੀਣੇ ਵਾਲੀ ਦ੍ਰਵ ਹੈ।",
            "advantages": "ਚਾ ਕੀਟਾਂ ਅਤੇ ਰੋਗਾਂ ਦੇ ਸੰਕਰਮਿਤ ਹੋਣ ਦੇ ਆਧਾਰ ਤੇ ਹਨਿਕਾਰਕਾਂ ਦਾ ਸੱਚਾ ਸੋਰਸ ਹੈ ਅਤੇ ਕਮ ਖਰਚ ਵਾਲੀ ਫਸਲ ਵੀ ਹੈ।",
            "disadvantages": "ਚਾ ਕੀਟਾਂ ਅਤੇ ਰੋਗਾਂ ਦੇ ਸੰਕਰਮਿਤ ਹੋ ਸਕਦੀ ਹੈ।",
            "method to grow": "ਚਾ ਨੂੰ ਵੱਖਰੀ ਅਤੇ ਉਰਵਰ ਮਿਟੀ ਵਿੱਚ ਉਗਾਇਆ ਜਾਂਦਾ ਹੈ। ਪੌਧੇ ਬੀਜੀ ਜਾਂਦੇ ਹਨ ਅਤੇ ਇਹਨਾਂ ਨੂੰ ਭੂਮਿ ਵਿੱਚ ਸਥਾਪਿਤ ਕੀਤਾ ਜਾਂਦਾ ਹੈ। ਚਾ ਪੌਧੇ ਨੂੰ ਨਿਯਮਿਤ ਤੌਰ 'ਤੇ ਕੱਟਾ ਜਾਂਦਾ ਹੈ ਅਤੇ ਜਦੋਂ ਪੱਤੀਆਂ ਨੌਵਾਂ ਅਤੇ ਨਰਮ ਹੋ ਜਾਂਦੀਆਂ ਹਨ ਤਾਂ ਉਹਨਾਂ ਨੂੰ ਕੱਟਿਆ ਜਾਂਦਾ ਹੈ।",
            "how to grow": "ਚਾ ਵੱਖਰੀ ਅਤੇ ਉਰਵਰ ਮਿਟੀ ਵਿੱਚ ਉਗਾਈ ਜਾਂਦੀ ਹੈ, ਪਰ ਇਹ ਵਰਮ ਅਤੇ ਭੇਜਨ ਦਾ ਮਾਹੌਲ ਵਿੱਚ ਸਭ ਤੋਂ ਵਧੀਆ ਫਲਦਾਰ ਪ੍ਰਦਾਨ ਕਰਦੀ ਹੈ। ਮਿਟੀ ਵੱਖਰੀ ਅਤੇ ਉਰਵਰ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ। ਚਾ ਨੂੰ ਉਗਾਉਣਾ ਸੰਤੋਸ਼ਜਨਕ ਫਸਲ ਹੈ, ਪਰ ਇਸ ਲਈ ਹੋਰ ਪਾਣੀ ਦੀ ਵਰਤੋਂ ਕਰਨੀ ਪੈਂਦੀ ਹੈ।",
            "cost of growth": "ਚਾ ਦੀ ਵਾਧੂ ਕੀਮਤ ਨੂੰ ਖੇਤੀ ਦੀ ਥਾਈਂ ਅਤੇ ਕੁਲਿਵੇ ਦੀ ਢੰਗ ਤੋਂ ਭਿੰਨ ਹੋਣ ਦੇ ਅਧਾਰ ਤੇ ਬਦਲਦੀ ਹੈ। ਪਰ ਇਸ ਦੀ ਆਮ ਤੌਰ ਤੇ ਖੇਤੀ ਕੀਮਤ ਵਧੀਆ ਹੈ।",
            "difficulty": "ਚਾ ਨੂੰ ਉਗਾਉਣ ਦਾ ਕੰਮ ਸਹਜ ਹੈ, ਪਰ ਇਸ ਲਈ ਪਾਣੀ ਦੀ ਬਹੁਤ ਵੱਡੀ ਵਰਤੋਂ ਕਰਨੀ ਪੈਂਦੀ ਹੈ। ਕੀਟਾਂ ਅਤੇ ਰੋਗਾਂ ਨੂੰ ਨਿਯੰਤਰਣ ਕਰਨਾ ਵੀ ਮਹੱਤਵਪੂਰਣ ਹੈ।",
            "other details": "ਚਾ ਇੱਕ ਵਰਤਮਾਨਸ਼ੀਲ ਫਸਲ ਹੈ ਜੋ ਵੱਡੇ ਨੰਬਰਾਂ ਵਿੱਚ ਵਰਤੀ ਜਾਂਦੀ ਹੈ। ਇਹ ਪ੍ਰੋਟੀਨ, ਫਾਈਬਰ ਅਤੇ ਵਿਟਾਮਿਨਾਂ ਦਾ ਸੱਚਾ ਸੋਰਸ ਹੈ ਅਤੇ ਕਈ ਸਿਹਤ ਲਾਭ ਵੀ ਹੋਏ ਨੇ।",
            "source": "https://www.britannica.com/plant/tea",
            "equipment": "ਕੁੱਦਲ, ਕਹੋਂਈ, ਪਾਣੀ ਦੀ ਦਾਨਾ, ਬੀਜ, ਖਾਦ",
            "time duration": "3-4 ਸਾਲ",
            "img": "./picture/tea.jpg",
            "name": "ਚਾ"
        },
        "millet": {
            "definition": "ਖੇਤੀ ਲਈ ਬਿਜ ਦੇ ਕਾਰਨ ਕਿਸਾਨਾਂ ਦੁਆਰਾ ਉਗਾਹਿ ਜਾਣ ਵਾਲਾ ਗਹਮਾਲ ਵਾਲਾ ਘਾਸ।",
            "advantages": "ਮਿਲੇਟ ਕਰਬੋਹਾਇਡਰੇਟ, ਪ੍ਰੋਟੀਨ ਅਤੇ ਫਾਈਬਰ ਦਾ ਸੁੱਖ ਸਰੋਤ ਹੈ। ਇਸ ਨੂੰ ਉਗਾਉਣ ਲਈ ਪੈਸਾਵਾਰ ਤਰੀਕੇ ਦੀ ਲੋੜ ਨਹੀਂ ਹੁੰਦੀ।",
            "disadvantages": "ਮਿਲੇਟ ਪੇਸਟ ਅਤੇ ਬੀਮਾਰੀਆਂ ਦੇ ਹਮਲੇ ਦਾ ਸ਼ਿਕਾਰ ਹੋ ਸਕਦਾ ਹੈ।",
            "method to grow": "ਮਿਲੇਟ ਵੱਜੋਂ ਸੁਸਤ ਮਿੱਟੀ ਵਿਚ ਉਗਾਹੀ ਜਾਂਦੀ ਹੈ। ਬੀਜ ਮਿੱਟੀ ਵਿੱਚ ਬੋਣੇ ਜਾਂਦੇ ਹਨ ਅਤੇ ਫਿਰ ਜ਼ਰੂਰਤ ਅਨੁਸਾਰ ਖੇਤਰਾਂ ਨੂੰ ਸਿੱਖਰੇ ਦੇਆ ਜਾਂਦੇ ਹਨ। ਮਿਲੇਟ ਦੇ ਪੌਦੇ ਮਿੱਟੀ ਵਿਚ ਉੱਗਦੇ ਹਨ ਅਤੇ ਉੱਗਦੇ ਹੋਏ ਪੌਦੇ ਨੂੰ ਵੱਧ ਹੋਣ ਤੇ ਕਾਟਿਆ ਜਾਂਦਾ ਹੈ।",
            "how to grow": "ਮਿਲੇਟ ਨੂੰ ਵੱਖ-ਵੱਖ ਇਕਾਇਆਂ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਹ ਗਰਮ ਅਤੇ ਸੁੱਖਾ ਹਵਾਵਾਂ ਵਾਲੇ ਹਵਾਈ ਹਾਲਾਤ ਵਿੱਚ ਵਧੀਆ ਸਨ। ਮਿੱਟੀ ਸੁੱਖੀ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ ਅਤੇ ਖੇਤੀਬਾੜੀ ਲਈ ਇਹ ਉਪਯੁਕਤ ਹੈ। ਮਿਲੇਟ ਦੀ ਨਿਰੰਤਰ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ।",
            "cost of growth": "ਮਿਲੇਟ ਦੀ ਵਧੇਰੀ ਵਿੱਧੀ ਅਤੇ ਖੇਤੀ ਦੇ ਤਰੀਕੇ ਤੋਂ ਬਣਦਾ ਖਰਚ ਲੋਕੇਸ਼ਨ ਅਤੇ ਮੁੱਦੇ ਤੇ ਇਸ ਨੂੰ ਪ੍ਰਭਾਵਿਤ ਕਰਦਾ ਹੈ। ਪਰ ਸਾਮਾਨਿਆਂ ਤੌਰ ਤੇ ਮਿਲੇਟ ਉਗਾਉਣ ਲਈ ਇੱਕ ਸਸਤਾ ਖੇਤੀ ਹੈ।",
            "difficulty": "ਮਿਲੇਟ ਨੂੰ ਉਗਾਉਣ ਲਈ ਸੁੱਤਾ ਹੈ ਪਰ ਇਸ ਨੂੰ ਧੂਪ ਦੀ ਬਹੁਤ ਲੋੜ ਹੁੰਦੀ ਹੈ। ਇਸ ਨੂੰ ਪੇਸਟ ਅਤੇ ਬੀਮਾਰੀਆਂ ਦੀ ਨਿਗਰਾਨੀ ਕਰਨਾ ਵੀ ਮਹੱਤਵਪੂਰਨ ਹੁੰਦਾ ਹੈ।",
            "other details": "ਮਿਲੇਟ ਇੱਕ ਵਰਦੀ ਖਾਣੇ ਦੀ ਖੇਤੀ ਹੈ ਜੋ ਵਿੱਧਾਂ ਵਿੱਚ ਵਰਤੀ ਜਾ ਸਕਦੀ ਹੈ। ਇਹ ਕਾਰਬੋਹਾਇਡਰੇਟ, ਪ੍ਰੋਟੀਨ ਅਤੇ ਫਾਈਬਰ ਦਾ ਸੁੱਖ ਸਰੋਤ ਹੈ।",
            "source": "https://www.britannica.com/plant/millet",
            "equipment": "ਕੁੱਦਨ, ਰੇਕ, ਪਾਣੀ ਦਾ ਬਿਆਸ, ਬੀਜ, ਖਾਦ",
            "time duration": "60-70 ਦਿਨ",
            "img": "./picture/millet.jpg",
            "name": "ਮਿਲੇਟ"
        },
        "maize": {
            "definition": "ਇੱਕ ਧਾਨ ਦਾਣਾ ਜੋ ਦੁਨੀਆ ਭਰ ਵਿੱਚ ਸਭ ਤੋਂ ਵੱਡਾ ਧਾਨ ਫਸਲ ਹੈ।",
            "advantages": "ਮੇਜ ਕਾਰਬੋਹਾਇਡਰੇਟ, ਪ੍ਰੋਟੀਨ ਅਤੇ ਫਾਈਬਰ ਦਾ ਸੁੱਖ ਸਰੋਤ ਹੈ। ਇਸ ਨੂੰ ਉਗਾਉਣ ਲਈ ਪੈਸਾਵਾਰ ਤਰੀਕੇ ਦੀ ਲੋੜ ਨਹੀਂ ਹੁੰਦੀ।",
            "disadvantages": "ਮੇਜ ਪੇਸਟ ਅਤੇ ਬੀਮਾਰੀਆਂ ਦੇ ਹਮਲੇ ਦਾ ਸ਼ਿਕਾਰ ਹੋ ਸਕਦਾ ਹੈ।",
            "method to grow": "ਮੇਜ ਸੁੱਤੀ ਮਿੱਟੀ ਵਿੱਚ ਉਗਾਈ ਜਾਂਦੀ ਹੈ। ਬੀਜ ਮਿੱਟੀ ਵਿੱਚ ਬੋਣੇ ਜਾਂਦੇ ਹਨ ਅਤੇ ਫਿਰ ਜ਼ਰੂਰਤ ਅਨੁਸਾਰ ਖੇਤਰਾਂ ਨੂੰ ਸਿੱਖਰੇ ਦੇਆ ਜਾਂਦੇ ਹਨ। ਮੇਜ ਦੇ ਪੌਦੇ ਮਿੱਟੀ ਵਿੱਚ ਉੱਗਦੇ ਹਨ ਅਤੇ ਉੱਗਦੇ ਹੋਏ ਪੌਦੇ ਨੂੰ ਵੱਧ ਹੋਣ ਤੇ ਕਾਟਿਆ ਜਾਂਦਾ ਹੈ।",
            "how to grow": "ਮੇਜ ਨੂੰ ਵੱਖ-ਵੱਖ ਕਾਇਆਂ ਵਿੱਚ ਉਗਾਇਆ ਜਾ ਸਕਦਾ ਹੈ, ਪਰ ਇਸ ਨੂੰ ਮੁੱਖਿਆਂ ਤੋਂ ਉਬਾਲ ਅਤੇ ਨਮੀ ਵਾਲੇ ਹਵਾਵਾਂ ਵਾਲੇ ਹਵਾਈ ਹਾਲਾਤ ਵਿੱਚ ਵਰਤੀ ਜਾਣਗੇ। ਮਿੱਟੀ ਨੂੰ ਸੁੱਖਾ ਹੋਣੀ ਚਾਹੀਦੀ ਹੈ ਅਤੇ ਖੇਤੀਬਾੜੀ ਲਈ ਯਹ ਉਪਯੁਕਤ ਹੈ। ਮੇਜ ਦੀ ਨਿਰੰਤਰ ਪਾਣੀ ਦੀ ਲੋੜ ਹੁੰਦੀ ਹੈ।",
            "cost of growth": "ਮੇਜ ਦੀ ਵਧੇਰੀ ਵਿੱਧੀ ਅਤੇ ਖੇਤੀ ਦੇ ਤਰੀਕੇ ਤੋਂ ਬਣਦਾ ਖਰਚ ਲੋਕੇਸ਼ਨ ਅਤੇ ਮੁੱਦੇ ਤੇ ਇਸ ਨੂੰ ਪ੍ਰਭਾਵਿਤ ਕਰਦਾ ਹੈ। ਪਰ ਸਾਮਾਨਿਆਂ ਤੌਰ ਤੇ ਮੇਜ ਉਗਾਉਣ ਲਈ ਇੱਕ ਸਸਤਾ ਖੇਤੀ ਹੈ।",
            "difficulty": "ਮੇਜ ਨੂੰ ਉਗਾਉਣ ਲਈ ਸੁੱਤਾ ਹੈ ਪਰ ਇਸ ਨੂੰ ਪਾਣੀ ਦੀ ਬਹੁਤ ਲੋੜ ਹੁੰਦੀ ਹੈ। ਇਸ ਨੂੰ ਪੇਸਟ ਅਤੇ ਬੀਮਾਰੀਆਂ ਦੀ ਨਿਗਰਾਨੀ ਕਰਨਾ ਵੀ ਮਹੱਤਵਪੂਰਨ ਹੁੰਦਾ ਹੈ।",
            "other details": "ਮੇਜ ਇੱਕ ਵਰਤਮਾਨ ਫਸਲ ਹੈ ਜੋ ਵਿਭਿਨਨ ਪਕਵਾਨਾਂ ਵਿੱਚ ਵਰਤੀ ਜਾ ਸਕਦੀ ਹੈ। ਇਸ ਨੂੰ ਕਾਰਬੋਹਾਇਡਰੇਟ, ਪ੍ਰੋਟੀਨ ਅਤੇ ਫਾਈਬਰ ਦਾ ਸੁੱਖ ਸਰੋਤ ਵੀ ਕਿਹਾ ਜਾਂਦਾ ਹੈ।",
            "source": "https://www.britannica.com/plant/maize",
            "equipment": "ਕੁੱਦਨ, ਰੇਕ, ਪਾਣੀ ਦਾ ਬਿਆਸ, ਬੀਜ, ਖਾਦ",
            "time duration": "90-120 ਦਿਨ",
            "img": "./picture/maize.jpg",
            "name": "ਮੇਜ"
        }
    }
}