{
    "h1_name": "बोलवर्म",
    "h1_para": "बोलवर्म तत्व बोल पर। कपास बोलवर्म (जिसे कॉर्न ईयरवर्म भी कहा जाता है) दक्षिणी कपास उगाने वाले क्षेत्रों में एक गंभीर कीट है। कंसास में कपास में कभी-कभी प्रकोप देखा जाता है, हालांकि कोई भी हानि कच्चे मक्का और ज्वार में उच्च प्रकोप विकसित हो चुके हैं।",
    "h2_name": "एफिड्स",
    "h2_para": "एफिड्स के पास नरम नासा-आकार के शरीर होते हैं जिनमें लंबे पैर और श्वान शरीर वाले ब्रह्मरंड होते हैं और ये प्रजाति और पौधों पर खाने के आधार पर हरे, पीले, भूरे, लाल या काले रंग में हो सकते हैं। कुछ प्रजातियाँ अपने शरीर सतह पर एक सफेद या धूसर वैक्सी सफेद या ग्रे पदार्थ के उत्पादन के कारण मोमीय या ऊनी जैसी दिखती हैं।",
    "h3_name": "सफेद मक्खियाँ",
    "h3_para": "सफेद मक्खियाँ छोटे आकार की रस चूसने वाली कीट होती हैं जो सब्जी और सजावटी पौधों में विशेष रूप से गर्म मौसम के दौरान बहुतायत में हो सकती हैं। वे चिकना हनीड्यू छोड़ती हैं और पत्तियों का पीला होने या मरने का कारण बनती हैं। प्राकृतिक जैविक नियंत्रण में बाधा होने पर अक्सर प्रकोप होता है।",
    "h4_name": "टिड्डी",
    "h4_para": "टिड्डी घास के मैदानी पक्षियों के लिए एक महत्वपूर्ण आहार स्रोत हैं। कीट और गैर-कीट प्रजातियों को पहचानना, जबकि उन्नति ज्वार फसल के लिए एक संभावित खतरा हो सकता है, जो कीट प्रजातियों को हानि नहीं पहुंचा सकती हैं जिनका महत्वपूर्ण पारिस्थितिकीय भूमिका हो सकती है।",
    "h5_name": "लीफहॉपर",
    "h5_para": "लीफहॉपर आमतौर पर भूरे, धूसरे, हरे या पीले रंग की दिखाई देती हैं या इनके विभिन्न रंगों का मिश्रण होता है। कुछ प्रजातियाँ चमकीले रंग की होती हैं, जबकि अन्यपौधों के रंग से मेल खाती हैं। लीफहॉपर गतिशील कीट होती हैं जो अशांति की स्थिति में जल्दी तरफ़-तरफ़ चलती हैं या छलांग लगा देती हैं।",
    "h6_name": "आर्मीवर्म",
    "h6_para": "आर्मीवर्म घास के चरागाहों और अनाजीय फसलों की ग्रंथिका कीट होते हैं। वे इस समय उगाने वाले अनाजीय फसलों में कृषकों को सामान्य रूप से प्रतिभाग करने का सामना कर सकते हैं, हालांकि कभी-कभी स्थानीय बड़ीमक्खी भी जब पूर्व मौसमी पौधे सूख जाते हैं तो अनाज में हमला कर सकती हैं।",
    "h7_name": "दीमक",
    "h7_para": "दीमक गेहूं, मक्का, मूंगफली, गन्ने, यम्स और कसावा जैसे गोले में सबसे बड़ी फसलों को धमकाती हैं, जो कई देशों में घरेलू पोषण का आधार हैं। भारत में सबसे सामान्य दीमक प्रजातियाँ माइक्रोटर्मीज और ओडोंटोटर्म्स होती हैं।",
    "h8_name": "माइट्स",
    "h8_para": "माइट्स घरेलू और बाहरी कृषि पारिस्थितिकी में गंभीर कीट होते हैं और सिंथेटिक कीटनाशक  द्वारा नियंत्रित होते हैं। कीटनाशक प्राकृतिक शत्रुओं को हानि पहुंचाते हैं और पर्यावरण प्रदूषण, मानव स्वास्थ्य समस्याएं, हानिकारक परिणाम और कीट प्रतिरोध के जोखिम का कारण बनते हैं।",
    "h9_name": "जैसिड्स",
    "h9_para": "जैसिड्स कपास के ग्रोइंग अवधि के दौरान सभी क्षेत्रों में उगाई जाने वाली चूसने वाली कीट हैं। कीट आपातकाल के दौरान पत्तियों में विषाक्त पदार्थ इंजेक्ट करती हैं जिससे पत्तियों में असामान्य परिवर्तन होता है - पारिधांकीय पीलापन और लालीकरण।",
    "h10_name": "स्टेमबोरर्स",
    "h10_para": "स्टेमबोरर्स अनाजीय फसलों के सबसे व्यापक और हानिकारक कीट समूह माने जाते हैं। वे साधारणतया दुनिया भर में अनाज उत्पादन की सीमा करने वाले कारकों में से एक होते हैं। वे बियार उत्पादन के समय से परिपक्वता तक मैदान में मौजूद होते हैं।"
}